sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
/**
 *******************************************************************************
 * @file  HC32A052.h
 * @brief Headerfile for HC32A052 series MCU.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-07-15       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

#ifndef __HC32A052_H__
#define __HC32A052_H__

#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************
 * Configuration of the Cortex-M0+ Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT 0          /* No MPU                                       */
#define __NVIC_PRIO_BITS 2       /* M0P uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig 0 /* Set to 1 if different SysTick Config is used */
    /** @} */                    /* End of group Configuration_of_CMSIS */

    /******************************************************************************
     * Interrupt Number Definition
     ******************************************************************************/
    typedef enum IRQn
    {
        NMI_IRQn = -14,       /*  2 Non Maskable                            */
        HardFault_IRQn = -13, /*  3 Hard Fault                              */
        SVC_IRQn = -5,        /* 11 SV Call                                 */
        PendSV_IRQn = -2,     /* 14 Pend SV                                 */
        SysTick_IRQn = -1,    /* 15 System Tick                             */

        PORTA_IRQn = 0,
        PORTB_IRQn = 1,
        PORTC_IRQn = 2,
        PORTD_IRQn = 3,
        DMAC_IRQn = 4,
        ATIM3_IRQn = 5,
        USART0_IRQn = 6,
        USART1_IRQn = 7,
        LPUART0_IRQn = 8,
        LPUART1_IRQn = 9,
        SPI0_IRQn = 10,
        SPI1_IRQn = 11,
        I2C0_IRQn = 12,
        I2C1_IRQn = 13,
        ATIM0_IRQn = 14,
        ATIM1_IRQn = 15,
        ATIM2_IRQn = 16,
        LPTIM_IRQn = 17,
        GTIM0_BTIM0_1_2_IRQn = 18,
        GTIM1_BTIM3_4_5_IRQn = 19,
        I2CSLV_IRQn = 20,
        WWDT_IRQn = 21,
        IWDT_IRQn = 22,
        RTC_IRQn = 23,
        ADC_IRQn = 24,
        VC0_VC1_LVD_IRQn = 26,
        CAN_IRQn = 28,
        ATIM_BK_IRQn = 29,
        FLASH_RAM_IRQn = 30,
        CTRIM_IRQn = 31,

    } IRQn_Type;

#include <core_cm0plus.h>
#include <stdint.h>

#define SUCCESS (0)
#define ERROR (-1)

#ifndef NULL
#define NULL (0)
#endif

    /******************************************************************************/
    /*                Device Specific Peripheral Registers structures             */
    /******************************************************************************/

#if defined(__CC_ARM)
#pragma anon_unions
#endif

    typedef struct
    {
        __IO uint32_t BGREN : 1;
        __IO uint32_t TSEN : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_adc_bgr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t CKDIV : 3;
        __IO uint32_t SGLMUX : 5;
        __IO uint32_t REF : 2;
        __IO uint32_t BUF : 1;
        __IO uint32_t SAM : 2;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_adc_cr0_field_t;

    typedef struct
    {
        __IO uint32_t MODE : 2;
        __IO uint32_t ALIGN : 1;
        __IO uint32_t THCH : 5;
        uint32_t RESERVED8 : 2;
        __IO uint32_t OVMD : 1;
        __IO uint32_t RACCEN : 1;
        __IO uint32_t LTCMP : 1;
        __IO uint32_t HTCMP : 1;
        __IO uint32_t REGCMP : 1;
        __IO uint32_t RACCCLR : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_cr1_field_t;

    typedef struct
    {
        __IO uint32_t ESG : 1;
        __IO uint32_t LTI : 1;
        __IO uint32_t HTI : 1;
        __IO uint32_t RGI : 1;
        __IO uint32_t EOS : 1;
        __IO uint32_t EOJ : 1;
        __IO uint32_t EOC : 1;
        __IO uint32_t DEOC : 1;
        __IO uint32_t DEOJ : 1;
        __IO uint32_t OV : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_adc_ier_field_t;

    typedef struct
    {
        __IO uint32_t CH0MUX : 5;
        __IO uint32_t CH1MUX : 5;
        __IO uint32_t CH2MUX : 5;
        __IO uint32_t CH3MUX : 5;
        __IO uint32_t CH4MUX : 5;
        __IO uint32_t CH5MUX : 5;
        uint32_t RESERVED30 : 1;
        __IO uint32_t RSV : 1;
    } stc_adc_sqr0_field_t;

    typedef struct
    {
        __IO uint32_t CH6MUX : 5;
        __IO uint32_t CH7MUX : 5;
        __IO uint32_t CH8MUX : 5;
        __IO uint32_t CH9MUX : 5;
        __IO uint32_t CH10MUX : 5;
        __IO uint32_t CH11MUX : 5;
        uint32_t RESERVED30 : 1;
        __IO uint32_t RSV : 1;
    } stc_adc_sqr1_field_t;

    typedef struct
    {
        __IO uint32_t CH12MUX : 5;
        __IO uint32_t CH13MUX : 5;
        __IO uint32_t CH14MUX : 5;
        __IO uint32_t CH15MUX : 5;
        __IO uint32_t CNT : 4;
        uint32_t RESERVED24 : 7;
        __IO uint32_t RSV : 1;
    } stc_adc_sqr2_field_t;

    typedef struct
    {
        __IO uint32_t CH0MUX : 5;
        __IO uint32_t CH1MUX : 5;
        __IO uint32_t CH2MUX : 5;
        __IO uint32_t CH3MUX : 5;
        __IO uint32_t CNT : 2;
        uint32_t RESERVED22 : 9;
        __IO uint32_t RSV : 1;
    } stc_adc_jqr_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_sqrresult0_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_sqrresult1_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_sqrresult2_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_sqrresult3_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_jqrresult0_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_jqrresult1_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_jqrresult2_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_jqrresult3_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_adc_result_field_t;

    typedef struct
    {
        __IO uint32_t RESULTACC : 20;
        uint32_t RESERVED20 : 11;
        __IO uint32_t RSV : 1;
    } stc_adc_resultacc_field_t;

    typedef struct
    {
        __IO uint32_t HT : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_adc_ht_field_t;

    typedef struct
    {
        __IO uint32_t LT : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_adc_lt_field_t;

    typedef struct
    {
        __IO uint32_t ESG : 1;
        __IO uint32_t LTI : 1;
        __IO uint32_t HTI : 1;
        __IO uint32_t RGI : 1;
        __IO uint32_t EOS : 1;
        __IO uint32_t EOJ : 1;
        __IO uint32_t EOC : 1;
        uint32_t RESERVED7 : 2;
        __IO uint32_t OV : 1;
        __IO uint32_t RDY : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_adc_ifr_field_t;

    typedef struct
    {
        __IO uint32_t ESG : 1;
        __IO uint32_t LTI : 1;
        __IO uint32_t HTI : 1;
        __IO uint32_t RGI : 1;
        __IO uint32_t EOS : 1;
        __IO uint32_t EOJ : 1;
        __IO uint32_t EOC : 1;
        uint32_t RESERVED7 : 2;
        __IO uint32_t OV : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_adc_icr_field_t;

    typedef struct
    {
        __IO uint32_t TRIG : 5;
        __IO uint32_t DELAY : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_adc_exttrig0_field_t;

    typedef struct
    {
        __IO uint32_t TRIG : 5;
        __IO uint32_t DELAY : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_adc_exttrig1_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_sglstart_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_sqrstart_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_adc_jqrstart_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CTEN : 1;
        __IO uint32_t COMP : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t PWM2S : 1;
        __IO uint32_t PRS : 3;
        __IO uint32_t BUFPEN : 1;
        __IO uint32_t CRG : 1;
        __IO uint32_t CFG : 1;
        __IO uint32_t UIE : 1;
        __IO uint32_t UDE : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t ONESHOT : 1;
        __IO uint32_t CSG : 1;
        __IO uint32_t OCCS : 1;
        __IO uint32_t URS : 1;
        __IO uint32_t TDE : 1;
        __IO uint32_t TIE : 1;
        __IO uint32_t BIE : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t OCCE : 1;
        __IO uint32_t TG : 1;
        __IO uint32_t UG : 1;
        __IO uint32_t BG : 1;
        __IO uint32_t DIR : 1;
        __IO uint32_t OVE : 1;
        __IO uint32_t UNDE : 1;
        uint32_t RESERVED30 : 1;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_m23cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        __IO uint32_t CA1 : 1;
        __IO uint32_t CA2 : 1;
        __IO uint32_t CB0 : 1;
        __IO uint32_t CB1 : 1;
        __IO uint32_t CB2 : 1;
        __IO uint32_t CA0E : 1;
        __IO uint32_t CA1E : 1;
        __IO uint32_t CA2E : 1;
        __IO uint32_t CB0E : 1;
        __IO uint32_t CB1E : 1;
        __IO uint32_t CB2E : 1;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        __IO uint32_t CA3A : 1;
        __IO uint32_t CA3B : 1;
        uint32_t RESERVED20 : 11;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        __IO uint32_t CA1 : 1;
        __IO uint32_t CA2 : 1;
        __IO uint32_t CB0 : 1;
        __IO uint32_t CB1 : 1;
        __IO uint32_t CB2 : 1;
        __IO uint32_t CA0E : 1;
        __IO uint32_t CA1E : 1;
        __IO uint32_t CA2E : 1;
        __IO uint32_t CB0E : 1;
        __IO uint32_t CB1E : 1;
        __IO uint32_t CB2E : 1;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        __IO uint32_t CA3A : 1;
        __IO uint32_t CA3B : 1;
        uint32_t RESERVED20 : 11;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_iclr_field_t;

    typedef struct
    {
        __IO uint32_t MMS : 3;
        __IO uint32_t CCDS : 1;
        __IO uint32_t MSM : 1;
        __IO uint32_t TS : 3;
        __IO uint32_t SMS : 3;
        __IO uint32_t IA0S : 1;
        __IO uint32_t IB0S : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_mscr_field_t;

    typedef struct
    {
        __IO uint32_t OCMA0FLTA0 : 3;
        __IO uint32_t CCPA0 : 1;
        __IO uint32_t OCMB0FLTB0 : 3;
        __IO uint32_t CCPB0 : 1;
        __IO uint32_t OCMA1FLTA1 : 3;
        __IO uint32_t CCPA1 : 1;
        __IO uint32_t OCMB1FLTB1 : 3;
        __IO uint32_t CCPB1 : 1;
        __IO uint32_t OCMA2FLTA2 : 3;
        __IO uint32_t CCPA2 : 1;
        __IO uint32_t OCMB2FLTB2 : 3;
        __IO uint32_t CCPB2 : 1;
        __IO uint32_t FLTBK : 3;
        __IO uint32_t BKP : 1;
        __IO uint32_t FLTET : 3;
        __IO uint32_t ETP : 1;
    } stc_atim3mode23_fltr_field_t;

    typedef struct
    {
        __IO uint32_t UEVE : 1;
        __IO uint32_t CMA0E : 1;
        __IO uint32_t CMA1E : 1;
        __IO uint32_t CMA2E : 1;
        __IO uint32_t CMB0E : 1;
        __IO uint32_t CMB1E : 1;
        __IO uint32_t CMB2E : 1;
        __IO uint32_t ADTE : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_adtr_field_t;

    typedef struct
    {
        __IO uint32_t CFACRABKSA : 2;
        __IO uint32_t CFBCRBBKSB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch0_field_t;

    typedef struct
    {
        __IO uint32_t CFACRABKSA : 2;
        __IO uint32_t CFBCRBBKSB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch1_field_t;

    typedef struct
    {
        __IO uint32_t CFACRABKSA : 2;
        __IO uint32_t CFBCRBBKSB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch2_field_t;

    typedef struct
    {
        __IO uint32_t DTR : 8;
        __IO uint32_t BKSEL : 1;
        __IO uint32_t DTEN : 1;
        __IO uint32_t BKE : 1;
        __IO uint32_t AOE : 1;
        __IO uint32_t MOE : 1;
        __IO uint32_t SAFEEN : 1;
        __IO uint32_t VCE : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_dtr_field_t;

    typedef struct
    {
        __IO uint32_t RCR : 8;
        __IO uint32_t OV : 1;
        __IO uint32_t UD : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_rcr_field_t;

    typedef struct
    {
        __IO uint32_t CCR0A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr0a_field_t;

    typedef struct
    {
        __IO uint32_t CCR0B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr0b_field_t;

    typedef struct
    {
        __IO uint32_t CCR1A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr1a_field_t;

    typedef struct
    {
        __IO uint32_t CCR1B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr1b_field_t;

    typedef struct
    {
        __IO uint32_t CCR2A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr2a_field_t;

    typedef struct
    {
        __IO uint32_t CCR2B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr2b_field_t;

    typedef struct
    {
        __IO uint32_t CCR3A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr3a_field_t;

    typedef struct
    {
        __IO uint32_t BUF : 1;
        __IO uint32_t CI : 1;
        __IO uint32_t CD : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t C3AEN : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch3a_field_t;

    typedef struct
    {
        __IO uint32_t CCR3B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_ccr3b_field_t;

    typedef struct
    {
        __IO uint32_t BUF : 1;
        __IO uint32_t CI : 1;
        __IO uint32_t CD : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t C3BEN : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_atim3mode23_crch3b_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CNT32 : 32;
    } stc_atimmode0_cnt32_field_t;

    typedef struct
    {
        __IO uint32_t CTEN : 1;
        __IO uint32_t MD : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t TOGEN : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t GATE : 1;
        __IO uint32_t GATEP : 1;
        __IO uint32_t UIE : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t MODE : 2;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_m0cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_iclr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 12;
        __IO uint32_t MOE : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atimmode0_dtr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CTEN : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CT : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t EDG1ST : 1;
        __IO uint32_t EDG2ND : 1;
        __IO uint32_t UIE : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t ONESHOT : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_m1cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t PWC : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t PWC : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_iclr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 5;
        __IO uint32_t TS : 3;
        uint32_t RESERVED8 : 3;
        __IO uint32_t IA0S : 1;
        __IO uint32_t IB0S : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_mscr_field_t;

    typedef struct
    {
        __IO uint32_t FLTA0 : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t FLTB0 : 3;
        uint32_t RESERVED7 : 21;
        __IO uint32_t FLTET : 3;
        __IO uint32_t ETP : 1;
    } stc_atimmode1_fltr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 4;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        uint32_t RESERVED6 : 2;
        __IO uint32_t CIEA : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_cr0_field_t;

    typedef struct
    {
        __IO uint32_t CCR0A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode1_ccr0a_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CTEN : 1;
        __IO uint32_t COMP : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t PWM2S : 1;
        __IO uint32_t PRS : 3;
        __IO uint32_t BUFPEN : 1;
        __IO uint32_t CRG : 1;
        __IO uint32_t CFG : 1;
        __IO uint32_t UIE : 1;
        __IO uint32_t UDE : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t ONESHOT : 1;
        __IO uint32_t CSG : 1;
        __IO uint32_t OCCS : 1;
        __IO uint32_t URS : 1;
        __IO uint32_t TDE : 1;
        __IO uint32_t TIE : 1;
        __IO uint32_t BIE : 1;
        __IO uint32_t CIS : 2;
        __IO uint32_t OCCE : 1;
        __IO uint32_t TG : 1;
        __IO uint32_t UG : 1;
        __IO uint32_t BG : 1;
        __IO uint32_t DIR : 1;
        __IO uint32_t OVE : 1;
        __IO uint32_t UNDE : 1;
        uint32_t RESERVED30 : 1;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_m23cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        uint32_t RESERVED3 : 2;
        __IO uint32_t CB0 : 1;
        uint32_t RESERVED6 : 2;
        __IO uint32_t CA0E : 1;
        uint32_t RESERVED9 : 2;
        __IO uint32_t CB0E : 1;
        uint32_t RESERVED12 : 2;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        uint32_t RESERVED18 : 13;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_ifr_field_t;

