sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
    typedef struct
    {
        __IO uint32_t UI : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CA0 : 1;
        uint32_t RESERVED3 : 2;
        __IO uint32_t CB0 : 1;
        uint32_t RESERVED6 : 2;
        __IO uint32_t CA0E : 1;
        uint32_t RESERVED9 : 2;
        __IO uint32_t CB0E : 1;
        uint32_t RESERVED12 : 2;
        __IO uint32_t BI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t UND : 1;
        uint32_t RESERVED18 : 13;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_iclr_field_t;

    typedef struct
    {
        __IO uint32_t MMS : 3;
        __IO uint32_t CCDS : 1;
        __IO uint32_t MSM : 1;
        __IO uint32_t TS : 3;
        __IO uint32_t SMS : 3;
        __IO uint32_t IA0S : 1;
        __IO uint32_t IB0S : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_mscr_field_t;

    typedef struct
    {
        __IO uint32_t OCMA0FLTA0 : 3;
        __IO uint32_t CCPA0 : 1;
        __IO uint32_t OCMB0FLTB0 : 3;
        __IO uint32_t CCPB0 : 1;
        uint32_t RESERVED8 : 16;
        __IO uint32_t FLTBK : 3;
        __IO uint32_t BKP : 1;
        __IO uint32_t FLTET : 3;
        __IO uint32_t ETP : 1;
    } stc_atimmode23_fltr_field_t;

    typedef struct
    {
        __IO uint32_t UEVE : 1;
        __IO uint32_t CMA0E : 1;
        uint32_t RESERVED2 : 2;
        __IO uint32_t CMB0E : 1;
        uint32_t RESERVED5 : 2;
        __IO uint32_t ADTE : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_adtr_field_t;

    typedef struct
    {
        __IO uint32_t CFACRABKSA : 2;
        __IO uint32_t CFBCRBBKSB : 2;
        __IO uint32_t CSA : 1;
        __IO uint32_t CSB : 1;
        __IO uint32_t BUFEA : 1;
        __IO uint32_t BUFEB : 1;
        __IO uint32_t CIEA : 1;
        __IO uint32_t CIEB : 1;
        __IO uint32_t CDEA : 1;
        __IO uint32_t CDEB : 1;
        __IO uint32_t CISB : 2;
        __IO uint32_t CCGA : 1;
        __IO uint32_t CCGB : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_crch0_field_t;

    typedef struct
    {
        __IO uint32_t DTR : 8;
        __IO uint32_t BKSEL : 1;
        __IO uint32_t DTEN : 1;
        __IO uint32_t BKE : 1;
        __IO uint32_t AOE : 1;
        __IO uint32_t MOE : 1;
        __IO uint32_t SAFEEN : 1;
        __IO uint32_t VCE : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_dtr_field_t;

    typedef struct
    {
        __IO uint32_t RCR : 8;
        __IO uint32_t OV : 1;
        __IO uint32_t UD : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_rcr_field_t;

    typedef struct
    {
        __IO uint32_t CCR0A : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_ccr0a_field_t;

    typedef struct
    {
        __IO uint32_t CCR0B : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_atimmode23_ccr0b_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_btim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_btim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t TOGEN : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        __IO uint32_t TRS : 2;
        __IO uint32_t ETP : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_btim_cr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_btim_icr_field_t;

    typedef struct
    {
        __IO uint32_t UI03 : 1;
        __IO uint32_t TI03 : 1;
        __IO uint32_t UI14 : 1;
        __IO uint32_t TI14 : 1;
        __IO uint32_t UI25 : 1;
        __IO uint32_t TI25 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_btim_aifr_field_t;

    typedef struct
    {
        __IO uint32_t UI03 : 1;
        __IO uint32_t TI03 : 1;
        __IO uint32_t UI14 : 1;
        __IO uint32_t TI14 : 1;
        __IO uint32_t UI25 : 1;
        __IO uint32_t TI25 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_btim_aicr_field_t;

    typedef struct
    {
        __IO uint8_t BUSOFF : 1;
        __IO uint8_t TACTIVE : 1;
        __IO uint8_t RACTIVE : 1;
        __IO uint8_t TSSS : 1;
        __IO uint8_t TPSS : 1;
        __IO uint8_t LBMI : 1;
        __IO uint8_t LBME : 1;
        __IO uint8_t RESET : 1;
    } stc_can_cfg_stat_field_t;

    typedef struct
    {
        __IO uint8_t TSA : 1;
        __IO uint8_t TSALL : 1;
        __IO uint8_t TSONE : 1;
        __IO uint8_t TPA : 1;
        __IO uint8_t TPE : 1;
        __IO uint8_t STBY : 1;
        __IO uint8_t LOM : 1;
        __IO uint8_t TBSEL : 1;
    } stc_can_tcmd_field_t;

    typedef struct
    {
        __IO uint8_t TSSTAT : 2;
        uint8_t RESERVED2 : 2;
        __IO uint8_t TTTBM : 1;
        __IO uint8_t TSMODE : 1;
        __IO uint8_t TSNEXT : 1;
    } stc_can_tctrl_field_t;

    typedef struct
    {
        __IO uint8_t RSSTAT : 2;
        uint8_t RESERVED2 : 1;
        __IO uint8_t RBALL : 1;
        __IO uint8_t RREL : 1;
        __IO uint8_t ROV : 1;
        __IO uint8_t ROM : 1;
        __IO uint8_t SACK : 1;
    } stc_can_rctrl_field_t;

    typedef struct
    {
        __IO uint8_t TSFF : 1;
        __IO uint8_t EIE : 1;
        __IO uint8_t TSIE : 1;
        __IO uint8_t TPIE : 1;
        __IO uint8_t RAFIE : 1;
        __IO uint8_t RFIE : 1;
        __IO uint8_t ROIE : 1;
        __IO uint8_t RIE : 1;
    } stc_can_rtie_field_t;

    typedef struct
    {
        __IO uint8_t AIF : 1;
        __IO uint8_t EIF : 1;
        __IO uint8_t TSIF : 1;
        __IO uint8_t TPIF : 1;
        __IO uint8_t RAFIF : 1;
        __IO uint8_t RFIF : 1;
        __IO uint8_t ROIF : 1;
        __IO uint8_t RIF : 1;
    } stc_can_rtif_field_t;

    typedef struct
    {
        __IO uint8_t BEIF : 1;
        __IO uint8_t BEIE : 1;
        __IO uint8_t ALIF : 1;
        __IO uint8_t ALIE : 1;
        __IO uint8_t EPIF : 1;
        __IO uint8_t EPIE : 1;
        __IO uint8_t EPASS : 1;
        __IO uint8_t EWARN : 1;
    } stc_can_errint_field_t;

    typedef struct
    {
        __IO uint8_t EWL : 4;
        __IO uint8_t AFWL : 4;
    } stc_can_limit_field_t;

    typedef struct
    {
        __IO uint32_t SEG_1 : 8;
        __IO uint32_t SEG_2 : 7;
        uint32_t RESERVED15 : 1;
        __IO uint32_t SJW : 7;
        uint32_t RESERVED23 : 1;
        __IO uint32_t PRESC : 8;
    } stc_can_bt_field_t;

    typedef struct
    {
        __IO uint8_t ALC : 5;
        __IO uint8_t KOER : 3;
    } stc_can_ealcap_field_t;

    typedef struct
    {
        __IO uint8_t ACFADR : 4;
        uint8_t RESERVED4 : 1;
        __IO uint8_t SELMASK : 1;
    } stc_can_acfctrl_field_t;

    typedef struct
    {
        __IO uint8_t AE_1 : 1;
        __IO uint8_t AE_2 : 1;
        __IO uint8_t AE_3 : 1;
        __IO uint8_t AE_4 : 1;
        __IO uint8_t AE_5 : 1;
        __IO uint8_t AE_6 : 1;
        __IO uint8_t AE_7 : 1;
        __IO uint8_t AE_8 : 1;
    } stc_can_acfen_field_t;

    typedef struct
    {
        __IO uint32_t ACODE_AMASK : 29;
        __IO uint32_t AIDE : 1;
        __IO uint32_t AIDEE : 1;
    } stc_can_acf_field_t;

    typedef struct
    {
        __IO uint8_t TBPTR : 3;
        uint8_t RESERVED3 : 3;
        __IO uint8_t TBF : 1;
        __IO uint8_t TBE : 1;
    } stc_can_tbslot_field_t;

    typedef struct
    {
        __IO uint8_t TTEN : 1;
        __IO uint8_t T_PRESC : 2;
        __IO uint8_t TTIF : 1;
        __IO uint8_t TTIE : 1;
        __IO uint8_t TEIF : 1;
        __IO uint8_t WTIF : 1;
        __IO uint8_t WTIE : 1;
    } stc_can_ttcfg_field_t;

    typedef struct
    {
        __IO uint32_t REF_ID : 29;
        uint32_t RESERVED29 : 2;
        __IO uint32_t REF_IDE : 1;
    } stc_can_ref_msg_field_t;

    typedef struct
    {
        __IO uint16_t TTPTR : 3;
        uint16_t RESERVED3 : 5;
        __IO uint16_t TTYPE : 3;
        uint16_t RESERVED11 : 1;
        __IO uint16_t TEW : 4;
    } stc_can_trg_cfg_field_t;

    typedef struct
    {
        __IO uint32_t CODE : 1;
        __IO uint32_t FLAG : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_crc_csr_field_t;

    typedef struct
    {
        __IO uint32_t RESULT : 32;
    } stc_crc_result_field_t;

    typedef struct
    {
        __IO uint32_t DATA : 32;
    } stc_crc_data_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t STEP : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t ETRFLT : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t SRC : 3;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cr0_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t AUTO : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        __IO uint32_t MDRCH : 2;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_ctrim_cr1_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t OK : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_ctrim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t OK : 1;
        __IO uint32_t DIR : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_ctrim_isr_field_t;

    typedef struct
    {
        __IO uint32_t UD : 1;
        __IO uint32_t END : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t MISS : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t OK : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_ctrim_icr_field_t;

    typedef struct
    {
        __IO uint32_t FCAP : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_fcap_field_t;

    typedef struct
    {
        __IO uint32_t TVAL : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_ctrim_tval_field_t;

    typedef struct
    {
        __IO uint32_t FLIM : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_ctrim_flim_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 24;
        __IO uint32_t HALT : 4;
        __IO uint32_t PRIO : 1;
        uint32_t RESERVED29 : 2;
        __IO uint32_t EN : 1;
    } stc_dmac_conf_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa0_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb0_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr0_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr0_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa1_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb1_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr1_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr1_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa2_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb2_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr2_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr2_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa3_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb3_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr3_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr3_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa4_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb4_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr4_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr4_field_t;

    typedef struct
    {
        __IO uint32_t TC : 16;
        __IO uint32_t BC : 4;
        uint32_t RESERVED20 : 2;
        __IO uint32_t TRISEL : 7;
        __IO uint32_t ST : 1;
        __IO uint32_t PAS : 1;
        __IO uint32_t ENS : 1;
    } stc_dmac_confa5_field_t;

    typedef struct
    {
        __IO uint32_t MSK : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t STAT : 3;
        __IO uint32_t FISIE : 1;
        __IO uint32_t ERRIE : 1;
        __IO uint32_t RD : 1;
        __IO uint32_t RS : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t FD : 1;
        __IO uint32_t FS : 1;
        __IO uint32_t WIDTH : 2;
        __IO uint32_t MODE : 2;
    } stc_dmac_confb5_field_t;

    typedef struct
    {
        __IO uint32_t SRCADR : 32;
    } stc_dmac_srcadr5_field_t;

    typedef struct
    {
        __IO uint32_t DSTADR : 32;
    } stc_dmac_dstadr5_field_t;

    typedef struct
    {
        __IO uint32_t MODE : 2;
        __IO uint32_t OVR : 1;
        __IO uint32_t ZERO : 1;
        __IO uint32_t BUSY : 1;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_eau_csr_field_t;

    typedef struct
    {
        __IO uint32_t DIVIDEND : 32;
    } stc_eau_dividend_field_t;

    typedef struct
    {
        __IO uint32_t DIVISOR : 32;
    } stc_eau_divisor_field_t;

    typedef struct
    {
        __IO uint32_t QUOTIENT : 32;
    } stc_eau_quotient_field_t;

    typedef struct
    {
        __IO uint32_t REMAINDER : 32;
    } stc_eau_remainder_field_t;

    typedef struct
    {
        __IO uint32_t OP : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t FWUP : 1;
        __IO uint32_t ROMD : 1;
        uint32_t RESERVED6 : 1;
        __IO uint32_t DPSTBEN : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_flash_cr_field_t;

    typedef struct
    {
        __IO uint32_t WAIT : 3;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_flash_wait_field_t;

    typedef struct
    {
        __IO uint32_t STATE : 2;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_lockst_field_t;

    typedef struct
    {
        __IO uint32_t PC : 1;
        __IO uint32_t PROT : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_ier_field_t;

    typedef struct
    {
        __IO uint32_t PC : 1;
        __IO uint32_t PROT : 1;
        uint32_t RESERVED2 : 2;
        __IO uint32_t BUSY : 1;
        __IO uint32_t CFDONE : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_flash_ifr_field_t;

    typedef struct
    {
        __IO uint32_t PC : 1;
        __IO uint32_t PROT : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_flash_icr_field_t;

    typedef struct
    {
        __IO uint32_t BYSEQ : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_flash_bypass_field_t;

    typedef struct
    {
        __IO uint32_t SLOCK : 32;
    } stc_flash_slock0_field_t;

    typedef struct
    {
        __IO uint32_t SLOCK : 32;
    } stc_flash_slock1_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_ads_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_dir_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_opendrain_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_driver_field_t;

    typedef struct
    {
        __IO uint32_t PUPIN0 : 1;
        __IO uint32_t PUPIN1 : 1;
        __IO uint32_t PUPIN2 : 1;
        __IO uint32_t PUPIN3 : 1;
        __IO uint32_t PUPIN4 : 1;
        __IO uint32_t PUPIN5 : 1;
        __IO uint32_t PUPIN6 : 1;
        __IO uint32_t PUPIN7 : 1;
        __IO uint32_t PUPIN8 : 1;
        __IO uint32_t PUPIN9 : 1;
        __IO uint32_t PUPIN10 : 1;
        __IO uint32_t PUPIN11 : 1;
        __IO uint32_t PUPIN12 : 1;
        __IO uint32_t PUPIN13 : 1;
        __IO uint32_t PUPIN14 : 1;
        __IO uint32_t PUPIN15 : 1;
        __IO uint32_t PDPIN0 : 1;
        __IO uint32_t PDPIN1 : 1;
        __IO uint32_t PDPIN2 : 1;
        __IO uint32_t PDPIN3 : 1;
        __IO uint32_t PDPIN4 : 1;
        __IO uint32_t PDPIN5 : 1;
        __IO uint32_t PDPIN6 : 1;
        __IO uint32_t PDPIN7 : 1;
        __IO uint32_t PDPIN8 : 1;
        __IO uint32_t PDPIN9 : 1;
        __IO uint32_t PDPIN10 : 1;
        __IO uint32_t PDPIN11 : 1;
        __IO uint32_t PDPIN12 : 1;
        __IO uint32_t PDPIN13 : 1;
        __IO uint32_t PDPIN14 : 1;
        __IO uint32_t PDPIN15 : 1;
    } stc_gpio_pupd_field_t;

