sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_in_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_out_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_brr_field_t;

    typedef struct
    {
        __IO uint32_t BSPIN0 : 1;
        __IO uint32_t BSPIN1 : 1;
        __IO uint32_t BSPIN2 : 1;
        __IO uint32_t BSPIN3 : 1;
        __IO uint32_t BSPIN4 : 1;
        __IO uint32_t BSPIN5 : 1;
        __IO uint32_t BSPIN6 : 1;
        __IO uint32_t BSPIN7 : 1;
        __IO uint32_t BSPIN8 : 1;
        __IO uint32_t BSPIN9 : 1;
        __IO uint32_t BSPIN10 : 1;
        __IO uint32_t BSPIN11 : 1;
        __IO uint32_t BSPIN12 : 1;
        __IO uint32_t BSPIN13 : 1;
        __IO uint32_t BSPIN14 : 1;
        __IO uint32_t BSPIN15 : 1;
        __IO uint32_t BRPIN0 : 1;
        __IO uint32_t BRPIN1 : 1;
        __IO uint32_t BRPIN2 : 1;
        __IO uint32_t BRPIN3 : 1;
        __IO uint32_t BRPIN4 : 1;
        __IO uint32_t BRPIN5 : 1;
        __IO uint32_t BRPIN6 : 1;
        __IO uint32_t BRPIN7 : 1;
        __IO uint32_t BRPIN8 : 1;
        __IO uint32_t BRPIN9 : 1;
        __IO uint32_t BRPIN10 : 1;
        __IO uint32_t BRPIN11 : 1;
        __IO uint32_t BRPIN12 : 1;
        __IO uint32_t BRPIN13 : 1;
        __IO uint32_t BRPIN14 : 1;
        __IO uint32_t BRPIN15 : 1;
    } stc_gpio_bsrr_field_t;

    typedef struct
    {
        __IO uint32_t AFSEL0 : 4;
        __IO uint32_t AFSEL1 : 4;
        __IO uint32_t AFSEL2 : 4;
        __IO uint32_t AFSEL3 : 4;
        __IO uint32_t AFSEL4 : 4;
        __IO uint32_t AFSEL5 : 4;
        __IO uint32_t AFSEL6 : 4;
        __IO uint32_t AFSEL7 : 4;
    } stc_gpio_afrl_field_t;

    typedef struct
    {
        __IO uint32_t AFSEL8 : 4;
        __IO uint32_t AFSEL9 : 4;
        __IO uint32_t AFSEL10 : 4;
        __IO uint32_t AFSEL11 : 4;
        __IO uint32_t AFSEL12 : 4;
        __IO uint32_t AFSEL13 : 4;
        __IO uint32_t AFSEL14 : 4;
        __IO uint32_t AFSEL15 : 4;
    } stc_gpio_afrh_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_highie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_lowie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_riseie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_fallie_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_ifr_field_t;

    typedef struct
    {
        __IO uint32_t PIN0 : 1;
        __IO uint32_t PIN1 : 1;
        __IO uint32_t PIN2 : 1;
        __IO uint32_t PIN3 : 1;
        __IO uint32_t PIN4 : 1;
        __IO uint32_t PIN5 : 1;
        __IO uint32_t PIN6 : 1;
        __IO uint32_t PIN7 : 1;
        __IO uint32_t PIN8 : 1;
        __IO uint32_t PIN9 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gpio_icr_field_t;

    typedef struct
    {
        __IO uint32_t PCLKDIV : 3;
        uint32_t RESERVED3 : 5;
        __IO uint32_t MCODIV : 3;
        uint32_t RESERVED11 : 1;
        __IO uint32_t MCOSEL : 3;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_gpioaux_cr0_field_t;

    typedef struct
    {
        __IO uint32_t ATIM0ETR : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t CTIM0ETR : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t CTIM1ETR : 3;
        uint32_t RESERVED11 : 1;
        __IO uint32_t ATIM3ETR : 3;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_gpioaux_cr1_field_t;

    typedef struct
    {
        __IO uint32_t ATIM0CAP0 : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t CTIM0CAP3 : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t CTIM1CAP3 : 3;
        uint32_t RESERVED11 : 1;
        __IO uint32_t ATIM3CAP3 : 3;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_gpioaux_cr2_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t CC0M : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t CC1M : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t CC2M : 3;
        uint32_t RESERVED11 : 1;
        __IO uint32_t CC3M : 3;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_gtim_cmmr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 4;
        __IO uint32_t ETRFLT : 3;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_gtim_cr1_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 2;
        __IO uint32_t TOGEN : 1;
        __IO uint32_t PRS : 4;
        __IO uint32_t OST : 1;
        __IO uint32_t TRS : 2;
        __IO uint32_t ETP : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_gtim_cr0_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        __IO uint32_t DCC0 : 1;
        __IO uint32_t DCC1 : 1;
        __IO uint32_t DCC2 : 1;
        __IO uint32_t DCC3 : 1;
        __IO uint32_t OVTRAD : 1;
        __IO uint32_t C0TRAD : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_gtim_ier_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_gtim_ifr_field_t;

    typedef struct
    {
        __IO uint32_t UI : 1;
        __IO uint32_t TI : 1;
        __IO uint32_t CC0 : 1;
        __IO uint32_t CC1 : 1;
        __IO uint32_t CC2 : 1;
        __IO uint32_t CC3 : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_gtim_icr_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr0_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr1_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr2_field_t;

    typedef struct
    {
        __IO uint32_t CCR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_gtim_ccr3_field_t;

    typedef struct
    {
        __IO uint32_t TME : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_i2c_tmrun_field_t;

    typedef struct
    {
        __IO uint32_t TM : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_tm_field_t;

    typedef struct
    {
        __IO uint32_t H1M : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t AA : 1;
        __IO uint32_t SI : 1;
        __IO uint32_t STO : 1;
        __IO uint32_t STA : 1;
        __IO uint32_t ENS : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_i2c_cr_field_t;

    typedef struct
    {
        __IO uint32_t DAT : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_data_field_t;

    typedef struct
    {
        __IO uint32_t GC : 1;
        __IO uint32_t ADDR0 : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr0_field_t;

    typedef struct
    {
        __IO uint32_t STAT : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_stat_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t ADDR : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr1_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t ADDR : 7;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2c_addr2_field_t;

    typedef struct
    {
        __IO uint32_t AD0F : 1;
        __IO uint32_t AD1F : 1;
        __IO uint32_t AD2F : 1;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_i2c_match_field_t;

    typedef struct
    {
        __IO uint32_t RD : 1;
        __IO uint32_t WR : 1;
        __IO uint32_t STOP : 1;
        __IO uint32_t START : 1;
        __IO uint32_t NACK : 1;
        __IO uint32_t I2CINT : 1;
        __IO uint32_t ACTIVE : 1;
        __IO uint32_t HSMODE : 1;
        __IO uint32_t TIMEOUT : 1;
        __IO uint32_t ACK : 1;
        __IO uint32_t SLADDR0 : 1;
        __IO uint32_t SLADDR1 : 1;
        __IO uint32_t SLADDR2 : 1;
        __IO uint32_t SLADDR3 : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t GC : 1;
        uint32_t RESERVED17 : 14;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_sr_field_t;

    typedef struct
    {
        __IO uint32_t DOUT : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_doutr_field_t;

    typedef struct
    {
        __IO uint32_t ADIR : 10;
        __IO uint32_t ADRLEN : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_adir_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 10;
        __IO uint32_t AM : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_sladr0_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 10;
        __IO uint32_t AM : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_sladr1_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 10;
        __IO uint32_t ADDRLEN : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_sladr2_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 10;
        __IO uint32_t ADDRLEN : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_sladr3_field_t;

    typedef struct
    {
        __IO uint32_t DIN : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_dinr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t BUSY : 1;
        __IO uint32_t FSCLC : 1;
        __IO uint32_t TIMEOUT : 1;
        uint32_t RESERVED4 : 3;
        __IO uint32_t GC : 1;
        __IO uint32_t DMATE : 1;
        __IO uint32_t DMARE : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_cr_field_t;

    typedef struct
    {
        __IO uint32_t ADDRMASK : 10;
        __IO uint32_t FACS : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_admr0_field_t;

    typedef struct
    {
        __IO uint32_t FW : 3;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_flt_field_t;

    typedef struct
    {
        __IO uint32_t TOR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_tor_field_t;

    typedef struct
    {
        __IO uint32_t ODPU : 2;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_oddr_field_t;

    typedef struct
    {
        __IO uint32_t NS : 2;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_rsr_field_t;

    typedef struct
    {
        __IO uint32_t RD : 1;
        __IO uint32_t WR : 1;
        __IO uint32_t STOP : 1;
        __IO uint32_t START : 1;
        __IO uint32_t NACK : 1;
        __IO uint32_t I2CINT : 1;
        __IO uint32_t ACTIVE : 1;
        __IO uint32_t HSMODE : 1;
        __IO uint32_t TIMEOUT : 1;
        __IO uint32_t ACK : 1;
        __IO uint32_t SLADDR0 : 1;
        __IO uint32_t SLADDR1 : 1;
        __IO uint32_t SLADDR2 : 1;
        __IO uint32_t SLADDR3 : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t GC : 1;
        uint32_t RESERVED17 : 14;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_ier_field_t;

    typedef struct
    {
        __IO uint32_t RD : 1;
        __IO uint32_t WR : 1;
        __IO uint32_t STOP : 1;
        __IO uint32_t START : 1;
        __IO uint32_t NACK : 1;
        __IO uint32_t I2CINT : 1;
        __IO uint32_t ACTIVE : 1;
        __IO uint32_t HSMODE : 1;
        __IO uint32_t TIMEOUT : 1;
        __IO uint32_t ACK : 1;
        __IO uint32_t SLADDR0 : 1;
        __IO uint32_t SLADDR1 : 1;
        __IO uint32_t SLADDR2 : 1;
        __IO uint32_t SLADDR3 : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t GC : 1;
        uint32_t RESERVED17 : 14;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_icr_field_t;

    typedef struct
    {
        __IO uint32_t RID : 3;
        __IO uint32_t PID : 9;
        __IO uint32_t MID : 12;
        uint32_t RESERVED24 : 7;
        __IO uint32_t RSV : 1;
    } stc_i2cslv_didr_field_t;

    typedef struct
    {
        __IO uint32_t KR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_iwdt_kr_field_t;

    typedef struct
    {
        __IO uint32_t PRS : 3;
        uint32_t RESERVED3 : 1;
        __IO uint32_t IE : 1;
        __IO uint32_t ACTION : 1;
        __IO uint32_t PAUSE : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_iwdt_cr_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_iwdt_arr_field_t;

    typedef struct
    {
        __IO uint32_t PRSF : 1;
        __IO uint32_t ARRF : 1;
        __IO uint32_t WINRF : 1;
        __IO uint32_t OV : 1;
        __IO uint32_t RUN : 1;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_iwdt_sr_field_t;

    typedef struct
    {
        __IO uint32_t WINR : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_iwdt_winr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lptim_cnt_field_t;

    typedef struct
    {
        __IO uint32_t ARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lptim_arr_field_t;

    typedef struct
    {
        __IO uint32_t CEN : 1;
        __IO uint32_t MD : 1;
        __IO uint32_t CT : 1;
        __IO uint32_t TOG_EN : 1;
        __IO uint32_t TCK_SEL : 2;
        uint32_t RESERVED6 : 1;
        __IO uint32_t WT_FLAG : 1;
        __IO uint32_t GATE : 1;
        __IO uint32_t GATE_P : 1;
        __IO uint32_t IE : 1;
        __IO uint32_t PRS : 4;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_lptim_cr_field_t;

    typedef struct
    {
        __IO uint32_t OV : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_lptim_ifr_field_t;

    typedef struct
    {
        __IO uint32_t OV : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_lptim_iclr_field_t;

    typedef struct
    {
        __IO uint32_t DATA : 8;
        __IO uint32_t DR8 : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_lpuart_sbuf_field_t;

    typedef struct
    {
        __IO uint32_t RCIE : 1;
        __IO uint32_t TCIE : 1;
        __IO uint32_t DR8CFG : 2;
        __IO uint32_t RXEN : 1;
        __IO uint32_t ADRDET : 1;
        __IO uint32_t MODE : 2;
        __IO uint32_t TXEIE : 1;
        __IO uint32_t OVER : 2;
        __IO uint32_t CLKSRC : 2;
        __IO uint32_t PEIE : 1;
        __IO uint32_t STOP : 2;
        __IO uint32_t DMARXEN : 1;
        __IO uint32_t DMATXEN : 1;
        __IO uint32_t RTSEN : 1;
        __IO uint32_t CTSEN : 1;
        __IO uint32_t CTSIE : 1;
        __IO uint32_t FEIE : 1;
        __IO uint32_t HDSEL : 1;
        uint32_t RESERVED23 : 8;
        __IO uint32_t RSV : 1;
    } stc_lpuart_scon_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_lpuart_saddr_field_t;

    typedef struct
    {
        __IO uint32_t SADEN : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_lpuart_saden_field_t;

    typedef struct
    {
        __IO uint32_t RC : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t FE : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t CTSIF : 1;
        __IO uint32_t CTS : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_lpuart_isr_field_t;

    typedef struct
    {
        __IO uint32_t RC : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t FE : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t CTSIF : 1;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_lpuart_icr_field_t;

    typedef struct
    {
        __IO uint32_t SCNT : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lpuart_scnt_field_t;

    typedef struct
    {
        __IO uint32_t LVDEN : 1;
        __IO uint32_t ACT : 1;
        __IO uint32_t SOURCE : 2;
        __IO uint32_t VTDS : 4;
        __IO uint32_t FLTEN : 1;
        __IO uint32_t DEBOUNCETIME : 3;
        __IO uint32_t FTEN : 1;
        __IO uint32_t RTEN : 1;
        __IO uint32_t HTEN : 1;
        __IO uint32_t IE : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_lvd_cr_field_t;

    typedef struct
    {
        __IO uint32_t INTF : 1;
        __IO uint32_t FILTER : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_lvd_sr_field_t;

    typedef struct
    {
        __IO uint32_t OPAEN : 1;
        __IO uint32_t AZEN : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t BIASSEL : 3;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_opa_cr0_field_t;

    typedef struct
    {
        __IO uint32_t OPAEN : 1;
        __IO uint32_t AZEN : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t BIASSEL : 3;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_opa_cr1_field_t;

