sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
    typedef struct
    {
        __IO uint32_t ADCTREN : 1;
        __IO uint32_t TRIGGER : 1;
        __IO uint32_t AZPULSE : 1;
        __IO uint32_t CLKSWSET : 1;
        __IO uint32_t CLKSEL : 4;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_opa_az_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t IE : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_ram_cr_field_t;

    typedef struct
    {
        __IO uint32_t ERRADDR : 14;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_ram_erraddr_field_t;

    typedef struct
    {
        __IO uint32_t ERR : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_ram_ifr_field_t;

    typedef struct
    {
        __IO uint32_t ERRCLR : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_ram_iclr_field_t;

    typedef struct
    {
        __IO uint32_t PRDS : 3;
        __IO uint32_t AMPM : 1;
        uint32_t RESERVED4 : 1;
        __IO uint32_t HZ1OE : 1;
        __IO uint32_t HZ1SEL : 1;
        __IO uint32_t START : 1;
        __IO uint32_t PRDX : 6;
        __IO uint32_t PRDSEL : 1;
        __IO uint32_t TEST : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_rtc_cr0_field_t;

    typedef struct
    {
        __IO uint32_t WAIT : 1;
        __IO uint32_t WAITF : 1;
        uint32_t RESERVED2 : 6;
        __IO uint32_t CKSEL : 3;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_rtc_cr1_field_t;

    typedef struct
    {
        __IO uint32_t SECL : 4;
        __IO uint32_t SECH : 3;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_rtc_sec_field_t;

    typedef struct
    {
        __IO uint32_t MINL : 4;
        __IO uint32_t MINH : 3;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_rtc_min_field_t;

    typedef struct
    {
        __IO uint32_t HOURL : 4;
        __IO uint32_t HOURH : 2;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_rtc_hour_field_t;

    typedef struct
    {
        __IO uint32_t WEEK : 3;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_rtc_week_field_t;

    typedef struct
    {
        __IO uint32_t DAYL : 4;
        __IO uint32_t DAYH : 2;
        uint32_t RESERVED6 : 25;
        __IO uint32_t RSV : 1;
    } stc_rtc_day_field_t;

    typedef struct
    {
        __IO uint32_t MON : 5;
        uint32_t RESERVED5 : 26;
        __IO uint32_t RSV : 1;
    } stc_rtc_mon_field_t;

    typedef struct
    {
        __IO uint32_t YEARL : 4;
        __IO uint32_t YEARH : 4;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_rtc_year_field_t;

    typedef struct
    {
        __IO uint32_t CR : 9;
        uint32_t RESERVED9 : 6;
        __IO uint32_t EN : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_rtc_compen_field_t;

    typedef struct
    {
        __IO uint32_t WUCKSEL : 3;
        __IO uint32_t TSEDG : 1;
        __IO uint32_t O2SEL : 2;
        __IO uint32_t TSE : 1;
        __IO uint32_t WUTE : 1;
        uint32_t RESERVED8 : 1;
        __IO uint32_t ALMAE : 1;
        __IO uint32_t ALMBE : 1;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_rtc_cr2_field_t;

    typedef struct
    {
        __IO uint32_t SECL : 4;
        __IO uint32_t SECH : 3;
        __IO uint32_t MSKS : 1;
        __IO uint32_t MINL : 4;
        __IO uint32_t MINH : 3;
        __IO uint32_t MSKM : 1;
        __IO uint32_t HOURL : 4;
        __IO uint32_t HOURH : 2;
        uint32_t RESERVED22 : 1;
        __IO uint32_t MSKH : 1;
        __IO uint32_t WEEK : 7;
        __IO uint32_t RSV : 1;
    } stc_rtc_alma_field_t;

    typedef struct
    {
        __IO uint32_t SECL : 4;
        __IO uint32_t SECH : 3;
        __IO uint32_t MSKS : 1;
        __IO uint32_t MINL : 4;
        __IO uint32_t MINH : 3;
        __IO uint32_t MSKM : 1;
        __IO uint32_t HOURL : 4;
        __IO uint32_t HOURH : 2;
        uint32_t RESERVED22 : 1;
        __IO uint32_t MSKH : 1;
        __IO uint32_t WEEK : 7;
        __IO uint32_t RSV : 1;
    } stc_rtc_almb_field_t;

    typedef struct
    {
        __IO uint32_t SECL : 4;
        __IO uint32_t SECH : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t MINL : 4;
        __IO uint32_t MINH : 3;
        uint32_t RESERVED15 : 1;
        __IO uint32_t HOURL : 4;
        __IO uint32_t HOURH : 2;
        uint32_t RESERVED22 : 9;
        __IO uint32_t RSV : 1;
    } stc_rtc_tstr_field_t;

    typedef struct
    {
        __IO uint32_t DAYL : 4;
        __IO uint32_t DAYH : 2;
        uint32_t RESERVED6 : 2;
        __IO uint32_t MON : 5;
        __IO uint32_t WEEK : 3;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_rtc_tsdr_field_t;

    typedef struct
    {
        __IO uint32_t WUTARR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_rtc_wutarr_field_t;

    typedef struct
    {
        __IO uint32_t ALMA : 1;
        __IO uint32_t ALMB : 1;
        __IO uint32_t WU : 1;
        __IO uint32_t TS : 1;
        __IO uint32_t TSOV : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t PRD : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_rtc_ier_field_t;

    typedef struct
    {
        __IO uint32_t ALMA : 1;
        __IO uint32_t ALMB : 1;
        __IO uint32_t WU : 1;
        __IO uint32_t TS : 1;
        __IO uint32_t TSOV : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t PRD : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_rtc_ifr_field_t;

    typedef struct
    {
        __IO uint32_t ALMA : 1;
        __IO uint32_t ALMB : 1;
        __IO uint32_t WU : 1;
        __IO uint32_t TS : 1;
        __IO uint32_t TSOV : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t PRD : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_rtc_icr_field_t;

    typedef struct
    {
        __IO uint32_t WPR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_rtc_wpr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t BRR : 3;
        __IO uint32_t CPHA : 1;
        __IO uint32_t CPOL : 1;
        __IO uint32_t MSTR : 1;
        __IO uint32_t LSBF : 1;
        __IO uint32_t WIDTH : 4;
        __IO uint32_t SSM : 1;
        __IO uint32_t CM : 2;
        __IO uint32_t SMP : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_spi_cr0_field_t;

    typedef struct
    {
        __IO uint32_t TXEIE : 1;
        __IO uint32_t RXNEIE : 1;
        __IO uint32_t SSFIE : 1;
        __IO uint32_t SSRIE : 1;
        __IO uint32_t UDFIE : 1;
        __IO uint32_t OVFIE : 1;
        __IO uint32_t SSERRIE : 1;
        __IO uint32_t MODFIE : 1;
        __IO uint32_t DMARXEN : 1;
        __IO uint32_t DMATXEN : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_spi_cr1_field_t;

    typedef struct
    {
        __IO uint32_t HDOE : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_spi_hdoe_field_t;

    typedef struct
    {
        __IO uint32_t SSI : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_spi_ssi_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t SSF : 1;
        __IO uint32_t SSR : 1;
        __IO uint32_t UDF : 1;
        __IO uint32_t OVF : 1;
        __IO uint32_t SSERR : 1;
        __IO uint32_t MODF : 1;
        __IO uint32_t BUSY : 1;
        __IO uint32_t SSLVL : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_spi_sr_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t SSF : 1;
        __IO uint32_t SSR : 1;
        __IO uint32_t UDF : 1;
        __IO uint32_t OVF : 1;
        __IO uint32_t SSERR : 1;
        __IO uint32_t MODF : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_spi_icr_field_t;

    typedef struct
    {
        __IO uint32_t DR : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_spi_dr_field_t;

    typedef struct
    {
        __IO uint32_t CLKSRC : 3;
        __IO uint32_t HCLKPRS : 3;
        __IO uint32_t PCLKPRS : 2;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr0_field_t;

    typedef struct
    {
        __IO uint32_t SWDUSEIO : 1;
        __IO uint32_t LOCKUP_EN : 1;
        __IO uint32_t WAKEUPBYRCH : 1;
        __IO uint32_t RTCLPW : 1;
        __IO uint32_t RTCADJ : 3;
        __IO uint32_t AUTOSWITCH : 1;
        __IO uint32_t SPIPCTRL : 1;
        __IO uint32_t XTHFLT : 1;
        __IO uint32_t GTIM0CFG : 1;
        __IO uint32_t GTIM1CFG : 1;
        __IO uint32_t FASTIOENB : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr1_field_t;

    typedef struct
    {
        __IO uint32_t RCH : 1;
        __IO uint32_t XTH : 1;
        __IO uint32_t RCL : 1;
        __IO uint32_t XTL : 1;
        __IO uint32_t PLL : 1;
        __IO uint32_t EXXTH : 1;
        __IO uint32_t EXXTL : 1;
        __IO uint32_t XTLLOCK : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr2_field_t;

    typedef struct
    {
        __IO uint32_t CR3 : 16;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_cr3_field_t;

    typedef struct
    {
        __IO uint32_t DIV : 3;
        uint32_t RESERVED3 : 28;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rchcr_field_t;

    typedef struct
    {
        __IO uint32_t DRIVER : 2;
        __IO uint32_t RANGE : 2;
        __IO uint32_t STARTUP : 2;
        __IO uint32_t DETEN : 1;
        __IO uint32_t DETTIME : 1;
        __IO uint32_t DETIE : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_xthcr_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 10;
        __IO uint32_t STARTUP : 2;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rclcr_field_t;

    typedef struct
    {
        __IO uint32_t DRIVER : 2;
        __IO uint32_t AMP_SEL : 2;
        __IO uint32_t STARTUP : 2;
        __IO uint32_t DETEN : 1;
        __IO uint32_t DETTIME : 1;
        __IO uint32_t DETIE : 1;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_xtlcr_field_t;

    typedef struct
    {
        __IO uint32_t SRC : 2;
        __IO uint32_t DIVR : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t WAITCYCLE : 3;
        uint32_t RESERVED7 : 1;
        __IO uint32_t DIVN : 7;
        uint32_t RESERVED15 : 1;
        __IO uint32_t DIVF : 3;
        uint32_t RESERVED19 : 1;
        __IO uint32_t POSTDIV : 4;
        uint32_t RESERVED24 : 7;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_pllcr_field_t;

    typedef struct
    {
        __IO uint32_t TRIML : 6;
        __IO uint32_t TRIMH : 5;
        uint32_t RESERVED11 : 20;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rchtrim_field_t;

    typedef struct
    {
        __IO uint32_t TRIM : 10;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rcltrim_field_t;

    typedef struct
    {
        __IO uint32_t RCH : 1;
        __IO uint32_t XTH : 1;
        __IO uint32_t RCL : 1;
        __IO uint32_t XTL : 1;
        __IO uint32_t PLL : 1;
        __IO uint32_t PLLLOCK : 1;
        uint32_t RESERVED6 : 2;
        __IO uint32_t XTHFAIL : 1;
        __IO uint32_t XTHFAULT : 1;
        __IO uint32_t XTLFAIL : 1;
        __IO uint32_t XTLFAULT : 1;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_state_field_t;

    typedef struct
    {
        __IO uint32_t USART0 : 1;
        __IO uint32_t USART1 : 1;
        __IO uint32_t LPUART0 : 1;
        __IO uint32_t LPUART1 : 1;
        __IO uint32_t I2C0 : 1;
        __IO uint32_t I2C1 : 1;
        __IO uint32_t SPI0 : 1;
        __IO uint32_t SPI1 : 1;
        __IO uint32_t ATIM0 : 1;
        __IO uint32_t LPTIM : 1;
        __IO uint32_t ATIM1 : 1;
        __IO uint32_t ATIM3 : 1;
        __IO uint32_t ATIM2 : 1;
        __IO uint32_t OPA : 1;
        __IO uint32_t WWDT : 1;
        __IO uint32_t IWDT : 1;
        __IO uint32_t ADC : 1;
        __IO uint32_t VCLVD : 1;
        __IO uint32_t I2CSLV : 1;
        uint32_t RESERVED19 : 1;
        __IO uint32_t RTC : 1;
        __IO uint32_t CTRIM : 1;
        uint32_t RESERVED22 : 2;
        __IO uint32_t TICK : 1;
        __IO uint32_t SWD : 1;
        __IO uint32_t CRC : 1;
        uint32_t RESERVED27 : 2;
        __IO uint32_t DMA : 1;
        __IO uint32_t EAU : 1;
        __IO uint32_t FLASH : 1;
    } stc_sysctrl_periclken0_field_t;

    typedef struct
    {
        __IO uint32_t GPIOA : 1;
        __IO uint32_t GPIOB : 1;
        __IO uint32_t GPIOC : 1;
        __IO uint32_t GPIOD : 1;
        uint32_t RESERVED4 : 3;
        __IO uint32_t CAN : 1;
        __IO uint32_t GTIM0 : 1;
        __IO uint32_t GTIM1 : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_periclken1_field_t;

    typedef struct
    {
        __IO uint32_t USART0 : 1;
        __IO uint32_t USART1 : 1;
        __IO uint32_t LPUART0 : 1;
        __IO uint32_t LPUART1 : 1;
        __IO uint32_t I2C0 : 1;
        __IO uint32_t I2C1 : 1;
        __IO uint32_t SPI0 : 1;
        __IO uint32_t SPI1 : 1;
        __IO uint32_t ATIM0 : 1;
        __IO uint32_t LPTIM : 1;
        __IO uint32_t ATIM1 : 1;
        __IO uint32_t ATIM3 : 1;
        __IO uint32_t ATIM2 : 1;
        __IO uint32_t OPA : 1;
        __IO uint32_t WWDT : 1;
        __IO uint32_t IWDT : 1;
        __IO uint32_t ADC : 1;
        __IO uint32_t VCLVD : 1;
        __IO uint32_t I2CSLV : 1;
        uint32_t RESERVED19 : 1;
        __IO uint32_t RTC : 1;
        __IO uint32_t CTRIM : 1;
        uint32_t RESERVED22 : 2;
        __IO uint32_t TICK : 1;
        __IO uint32_t SWD : 1;
        __IO uint32_t CRC : 1;
        uint32_t RESERVED27 : 2;
        __IO uint32_t DMA : 1;
        __IO uint32_t EAU : 1;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_perireset0_field_t;

    typedef struct
    {
        __IO uint32_t GPIOA : 1;
        __IO uint32_t GPIOB : 1;
        __IO uint32_t GPIOC : 1;
        __IO uint32_t GPIOD : 1;
        uint32_t RESERVED4 : 3;
        __IO uint32_t CAN : 1;
        __IO uint32_t GTIM0 : 1;
        __IO uint32_t GTIM1 : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_perireset1_field_t;

    typedef struct
    {
        __IO uint32_t POR5V : 1;
        __IO uint32_t POR12V : 1;
        __IO uint32_t LVD : 1;
        __IO uint32_t IWDT : 1;
        __IO uint32_t WWDT : 1;
        __IO uint32_t LOCKUP : 1;
        __IO uint32_t SYSREQ : 1;
        __IO uint32_t RSTB : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_rstflag_field_t;

    typedef struct
    {
        __IO uint32_t ATIM0 : 1;
        __IO uint32_t ATIM1 : 1;
        __IO uint32_t ATIM2 : 1;
        __IO uint32_t LPTIM : 1;
        __IO uint32_t GTIM0 : 1;
        __IO uint32_t GTIM1 : 1;
        uint32_t RESERVED6 : 1;
        __IO uint32_t CTRIM : 1;
        __IO uint32_t IWDT : 1;
        __IO uint32_t RTC : 1;
        __IO uint32_t TICK : 1;
        __IO uint32_t ATIM3 : 1;
        __IO uint32_t WWDT : 1;
        uint32_t RESERVED13 : 18;
        __IO uint32_t RSV : 1;
    } stc_sysctrl_dbgstop_field_t;

    typedef struct
    {
        __IO uint32_t RE : 1;
        __IO uint32_t TE : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t PCE : 1;
        __IO uint32_t CHLEN : 1;
        __IO uint32_t STOP : 1;
        __IO uint32_t MSB : 1;
        __IO uint32_t OVER8 : 1;
        __IO uint32_t TOE : 3;
        __IO uint32_t SBS : 1;
        __IO uint32_t COMB : 1;
        __IO uint32_t MPE : 1;
        __IO uint32_t SLME : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_usart_cr1_field_t;

    typedef struct
    {
        __IO uint32_t RXDMAEN : 1;
        __IO uint32_t TXDMAEN : 1;
        __IO uint32_t RTSEN : 1;
        __IO uint32_t CTSEN : 1;
        __IO uint32_t RXINV : 1;
        __IO uint32_t TXINV : 1;
        __IO uint32_t SYNC : 1;
        __IO uint32_t SWAP : 1;
        __IO uint32_t CLKC : 2;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_usart_cr2_field_t;

    typedef struct
    {
        __IO uint32_t LINEN : 1;
        __IO uint32_t LBDE : 1;
        __IO uint32_t ABRE : 1;
        __IO uint32_t BREAK : 1;
        __IO uint32_t SCEN : 1;
        __IO uint32_t BCN : 3;
        __IO uint32_t SMCPU : 2;
        uint32_t RESERVED10 : 3;
        __IO uint32_t IREN : 1;
        __IO uint32_t IRCW : 1;
        __IO uint32_t IRMOD : 1;
        uint32_t RESERVED16 : 15;
        __IO uint32_t RSV : 1;
    } stc_usart_cr3_field_t;

    typedef struct
    {
        __IO uint32_t DIVF : 7;
        __IO uint32_t FBME : 1;
        __IO uint32_t DIVI : 8;
        __IO uint32_t PSC : 2;
        uint32_t RESERVED18 : 13;
        __IO uint32_t RSV : 1;
    } stc_usart_brr_field_t;

    typedef struct
    {
        __IO uint32_t TOR : 20;
        uint32_t RESERVED20 : 11;
        __IO uint32_t RSV : 1;
    } stc_usart_tor_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t FE : 1;
        __IO uint32_t OR : 1;
        __IO uint32_t TO : 1;
        uint32_t RESERVED7 : 1;
        __IO uint32_t MPB : 1;
        __IO uint32_t AM : 1;
        __IO uint32_t CTSV : 1;
        __IO uint32_t CTS : 1;
        __IO uint32_t ABR : 1;
        __IO uint32_t LBD : 1;
        __IO uint32_t DWK : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_usart_sr_field_t;

    typedef struct
    {
        __IO uint32_t TDR : 9;
        __IO uint32_t MPID : 1;
        uint32_t RESERVED10 : 21;
        __IO uint32_t RSV : 1;
    } stc_usart_tdr_field_t;

    typedef struct
    {
        __IO uint32_t TXE : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t FE : 1;
        __IO uint32_t OR : 1;
        __IO uint32_t TO : 1;
        uint32_t RESERVED7 : 2;
        __IO uint32_t AM : 1;
        uint32_t RESERVED10 : 1;
        __IO uint32_t CTS : 1;
        __IO uint32_t ABR : 1;
        __IO uint32_t LBD : 1;
        __IO uint32_t DWK : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_usart_ier_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t RC : 1;
        __IO uint32_t PE : 1;
        __IO uint32_t FE : 1;
        __IO uint32_t OR : 1;
        __IO uint32_t TO : 1;
        uint32_t RESERVED7 : 2;
        __IO uint32_t AM : 1;
        uint32_t RESERVED10 : 1;
        __IO uint32_t CTS : 1;
        __IO uint32_t ABR : 1;
        __IO uint32_t LBD : 1;
        __IO uint32_t DWK : 1;
        uint32_t RESERVED15 : 16;
        __IO uint32_t RSV : 1;
    } stc_usart_icr_field_t;

    typedef struct
    {
        __IO uint32_t RDR : 9;
        uint32_t RESERVED9 : 22;
        __IO uint32_t RSV : 1;
    } stc_usart_rdr_field_t;

    typedef struct
    {
        __IO uint32_t ADDR : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_usart_addr_field_t;

    typedef struct
    {
        __IO uint32_t ADDM : 8;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_usart_addmr_field_t;

    typedef struct
    {
        __IO uint32_t BDR : 12;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_usart_bdr_field_t;

    typedef struct
    {
        __IO uint32_t DCNTL : 11;
        uint32_t RESERVED11 : 5;
        __IO uint32_t DCNTH : 11;
        uint32_t RESERVED27 : 4;
        __IO uint32_t RSV : 1;
    } stc_usart_ir_field_t;

    typedef struct
    {
        __IO uint32_t DIV : 6;
        __IO uint32_t DIVEN : 1;
        __IO uint32_t REF : 1;
        __IO uint32_t BIAS : 2;
        __IO uint32_t HYS : 2;
        uint32_t RESERVED12 : 19;
        __IO uint32_t RSV : 1;
    } stc_vc_cr0_field_t;

    typedef struct
    {
        __IO uint32_t PSEL : 4;
        __IO uint32_t NSEL : 4;
        __IO uint32_t FLTEN : 1;
        __IO uint32_t FLTTIME : 3;
        __IO uint32_t FALLING : 1;
        __IO uint32_t RISING : 1;
        __IO uint32_t LEVEL : 1;
        __IO uint32_t IE : 1;
        __IO uint32_t EN : 1;
        __IO uint32_t FLTCLK : 1;
        uint32_t RESERVED18 : 13;
        __IO uint32_t RSV : 1;
    } stc_vc_cr1_field_t;

    typedef struct
    {
        __IO uint32_t POL : 1;
        __IO uint32_t ATIM0CLR : 1;
        __IO uint32_t ATIM1CLR : 1;
        __IO uint32_t ATIM2CLR : 1;
        __IO uint32_t ATIM3CLR : 1;
        __IO uint32_t ATIMBK : 1;
        __IO uint32_t WINDOW : 1;
        uint32_t RESERVED7 : 24;
        __IO uint32_t RSV : 1;
    } stc_vc_cr2_field_t;

    typedef struct
    {
        __IO uint32_t INTF : 1;
        __IO uint32_t FLTV : 1;
        uint32_t RESERVED2 : 29;
        __IO uint32_t RSV : 1;
    } stc_vc_sr_field_t;

    typedef struct
    {
        __IO uint32_t WCNT : 7;
        __IO uint32_t EN : 1;
        uint32_t RESERVED8 : 23;
        __IO uint32_t RSV : 1;
    } stc_wwdt_cr0_field_t;

    typedef struct
    {
        __IO uint32_t WINR : 7;
        uint32_t RESERVED7 : 2;
        __IO uint32_t IE : 1;
        uint32_t RESERVED10 : 1;
        __IO uint32_t PRS : 3;
        uint32_t RESERVED14 : 17;
        __IO uint32_t RSV : 1;
    } stc_wwdt_cr1_field_t;

    typedef struct
    {
        __IO uint32_t POV : 1;
        uint32_t RESERVED1 : 30;
        __IO uint32_t RSV : 1;
    } stc_wwdt_sr_field_t;

