sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
    typedef struct
    {
        union {
            __IO uint32_t BGR;
            stc_adc_bgr_field_t BGR_f;
        };
        union {
            __IO uint32_t CR0;
            stc_adc_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_adc_cr1_field_t CR1_f;
        };
        uint8_t RESERVED3[36];
        union {
            __IO uint32_t IER;
            stc_adc_ier_field_t IER_f;
        };
        uint8_t RESERVED4[12];
        union {
            __IO uint32_t SQR0;
            stc_adc_sqr0_field_t SQR0_f;
        };
        union {
            __IO uint32_t SQR1;
            stc_adc_sqr1_field_t SQR1_f;
        };
        union {
            __IO uint32_t SQR2;
            stc_adc_sqr2_field_t SQR2_f;
        };
        union {
            __IO uint32_t JQR;
            stc_adc_jqr_field_t JQR_f;
        };
        union {
            __IO uint32_t SQRRESULT0;
            stc_adc_sqrresult0_field_t SQRRESULT0_f;
        };
        union {
            __IO uint32_t SQRRESULT1;
            stc_adc_sqrresult1_field_t SQRRESULT1_f;
        };
        union {
            __IO uint32_t SQRRESULT2;
            stc_adc_sqrresult2_field_t SQRRESULT2_f;
        };
        union {
            __IO uint32_t SQRRESULT3;
            stc_adc_sqrresult3_field_t SQRRESULT3_f;
        };
        uint8_t RESERVED12[48];
        union {
            __IO uint32_t JQRRESULT0;
            stc_adc_jqrresult0_field_t JQRRESULT0_f;
        };
        union {
            __IO uint32_t JQRRESULT1;
            stc_adc_jqrresult1_field_t JQRRESULT1_f;
        };
        union {
            __IO uint32_t JQRRESULT2;
            stc_adc_jqrresult2_field_t JQRRESULT2_f;
        };
        union {
            __IO uint32_t JQRRESULT3;
            stc_adc_jqrresult3_field_t JQRRESULT3_f;
        };
        union {
            __IO uint32_t RESULT;
            stc_adc_result_field_t RESULT_f;
        };
        union {
            __IO uint32_t RESULTACC;
            stc_adc_resultacc_field_t RESULTACC_f;
        };
        union {
            __IO uint32_t HT;
            stc_adc_ht_field_t HT_f;
        };
        union {
            __IO uint32_t LT;
            stc_adc_lt_field_t LT_f;
        };
        union {
            __IO uint32_t IFR;
            stc_adc_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_adc_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t EXTTRIG0;
            stc_adc_exttrig0_field_t EXTTRIG0_f;
        };
        union {
            __IO uint32_t EXTTRIG1;
            stc_adc_exttrig1_field_t EXTTRIG1_f;
        };
        union {
            __IO uint32_t SGLSTART;
            stc_adc_sglstart_field_t SGLSTART_f;
        };
        union {
            __IO uint32_t SQRSTART;
            stc_adc_sqrstart_field_t SQRSTART_f;
        };
        union {
            __IO uint32_t JQRSTART;
            stc_adc_jqrstart_field_t JQRSTART_f;
        };
    } ADC_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ARR;
            stc_atim3mode23_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_atim3mode23_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[4];
        union {
            __IO uint32_t M23CR;
            stc_atim3mode23_m23cr_field_t M23CR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_atim3mode23_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_atim3mode23_iclr_field_t ICLR_f;
        };
        union {
            __IO uint32_t MSCR;
            stc_atim3mode23_mscr_field_t MSCR_f;
        };
        union {
            __IO uint32_t FLTR;
            stc_atim3mode23_fltr_field_t FLTR_f;
        };
        union {
            __IO uint32_t ADTR;
            stc_atim3mode23_adtr_field_t ADTR_f;
        };
        union {
            __IO uint32_t CRCH0;
            stc_atim3mode23_crch0_field_t CRCH0_f;
        };
        union {
            __IO uint32_t CRCH1;
            stc_atim3mode23_crch1_field_t CRCH1_f;
        };
        union {
            __IO uint32_t CRCH2;
            stc_atim3mode23_crch2_field_t CRCH2_f;
        };
        union {
            __IO uint32_t DTR;
            stc_atim3mode23_dtr_field_t DTR_f;
        };
        union {
            __IO uint32_t RCR;
            stc_atim3mode23_rcr_field_t RCR_f;
        };
        uint8_t RESERVED13[4];
        union {
            __IO uint32_t CCR0A;
            stc_atim3mode23_ccr0a_field_t CCR0A_f;
        };
        union {
            __IO uint32_t CCR0B;
            stc_atim3mode23_ccr0b_field_t CCR0B_f;
        };
        union {
            __IO uint32_t CCR1A;
            stc_atim3mode23_ccr1a_field_t CCR1A_f;
        };
        union {
            __IO uint32_t CCR1B;
            stc_atim3mode23_ccr1b_field_t CCR1B_f;
        };
        union {
            __IO uint32_t CCR2A;
            stc_atim3mode23_ccr2a_field_t CCR2A_f;
        };
        union {
            __IO uint32_t CCR2B;
            stc_atim3mode23_ccr2b_field_t CCR2B_f;
        };
        union {
            __IO uint32_t CCR3A;
            stc_atim3mode23_ccr3a_field_t CCR3A_f;
        };
        union {
            __IO uint32_t CRCH3A;
            stc_atim3mode23_crch3a_field_t CRCH3A_f;
        };
        union {
            __IO uint32_t CCR3B;
            stc_atim3mode23_ccr3b_field_t CCR3B_f;
        };
        union {
            __IO uint32_t CRCH3B;
            stc_atim3mode23_crch3b_field_t CRCH3B_f;
        };
    } ATIM3MODE23_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ARR;
            stc_atimmode0_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_atimmode0_cnt_field_t CNT_f;
        };
        union {
            __IO uint32_t CNT32;
            stc_atimmode0_cnt32_field_t CNT32_f;
        };
        union {
            __IO uint32_t M0CR;
            stc_atimmode0_m0cr_field_t M0CR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_atimmode0_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_atimmode0_iclr_field_t ICLR_f;
        };
        uint8_t RESERVED6[24];
        union {
            __IO uint32_t DTR;
            stc_atimmode0_dtr_field_t DTR_f;
        };
    } ATIMMODE0_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union {
            __IO uint32_t CNT;
            stc_atimmode1_cnt_field_t CNT_f;
        };
        uint8_t RESERVED1[4];
        union {
            __IO uint32_t M1CR;
            stc_atimmode1_m1cr_field_t M1CR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_atimmode1_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_atimmode1_iclr_field_t ICLR_f;
        };
        union {
            __IO uint32_t MSCR;
            stc_atimmode1_mscr_field_t MSCR_f;
        };
        union {
            __IO uint32_t FLTR;
            stc_atimmode1_fltr_field_t FLTR_f;
        };
        uint8_t RESERVED6[4];
        union {
            __IO uint32_t CR0;
            stc_atimmode1_cr0_field_t CR0_f;
        };
        uint8_t RESERVED7[20];
        union {
            __IO uint32_t CCR0A;
            stc_atimmode1_ccr0a_field_t CCR0A_f;
        };
    } ATIMMODE1_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ARR;
            stc_atimmode23_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_atimmode23_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[4];
        union {
            __IO uint32_t M23CR;
            stc_atimmode23_m23cr_field_t M23CR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_atimmode23_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_atimmode23_iclr_field_t ICLR_f;
        };
        union {
            __IO uint32_t MSCR;
            stc_atimmode23_mscr_field_t MSCR_f;
        };
        union {
            __IO uint32_t FLTR;
            stc_atimmode23_fltr_field_t FLTR_f;
        };
        union {
            __IO uint32_t ADTR;
            stc_atimmode23_adtr_field_t ADTR_f;
        };
        union {
            __IO uint32_t CRCH0;
            stc_atimmode23_crch0_field_t CRCH0_f;
        };
        uint8_t RESERVED9[8];
        union {
            __IO uint32_t DTR;
            stc_atimmode23_dtr_field_t DTR_f;
        };
        union {
            __IO uint32_t RCR;
            stc_atimmode23_rcr_field_t RCR_f;
        };
        uint8_t RESERVED11[4];
        union {
            __IO uint32_t CCR0A;
            stc_atimmode23_ccr0a_field_t CCR0A_f;
        };
        union {
            __IO uint32_t CCR0B;
            stc_atimmode23_ccr0b_field_t CCR0B_f;
        };
    } ATIMMODE23_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ARR;
            stc_btim_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_btim_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[8];
        union {
            __IO uint32_t CR;
            stc_btim_cr_field_t CR_f;
        };
        union {
            __IO uint32_t IER;
            stc_btim_ier_field_t IER_f;
        };
        union {
            __IO uint32_t IFR;
            stc_btim_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_btim_icr_field_t ICR_f;
        };
        uint8_t RESERVED6[40];
        union {
            __IO uint32_t AIFR;
            stc_btim_aifr_field_t AIFR_f;
        };
        union {
            __IO uint32_t AICR;
            stc_btim_aicr_field_t AICR_f;
        };
    } BTIM_TypeDef;

    typedef struct
    {
        __IO uint32_t RBUF0;
        __IO uint32_t RBUF1;
        __IO uint32_t RBUF2;
        __IO uint32_t RBUF3;
        uint8_t RESERVED4[64];
        __IO uint32_t TBUF0;
        __IO uint32_t TBUF1;
        __IO uint32_t TBUF2;
        __IO uint32_t TBUF3;
        uint8_t RESERVED8[64];
        union {
            __IO uint8_t CFG_STAT;
            stc_can_cfg_stat_field_t CFG_STAT_f;
        };
        union {
            __IO uint8_t TCMD;
            stc_can_tcmd_field_t TCMD_f;
        };
        union {
            __IO uint8_t TCTRL;
            stc_can_tctrl_field_t TCTRL_f;
        };
        union {
            __IO uint8_t RCTRL;
            stc_can_rctrl_field_t RCTRL_f;
        };
        union {
            __IO uint8_t RTIE;
            stc_can_rtie_field_t RTIE_f;
        };
        union {
            __IO uint8_t RTIF;
            stc_can_rtif_field_t RTIF_f;
        };
        union {
            __IO uint8_t ERRINT;
            stc_can_errint_field_t ERRINT_f;
        };
        union {
            __IO uint8_t LIMIT;
            stc_can_limit_field_t LIMIT_f;
        };
        union {
            __IO uint32_t BT;
            stc_can_bt_field_t BT_f;
        };
        uint8_t RESERVED17[4];
        union {
            __IO uint8_t EALCAP;
            stc_can_ealcap_field_t EALCAP_f;
        };
        uint8_t RESERVED18[1];
        __IO uint8_t RECNT;
        __IO uint8_t TECNT;
        union {
            __IO uint8_t ACFCTRL;
            stc_can_acfctrl_field_t ACFCTRL_f;
        };
        uint8_t RESERVED21[1];
        union {
            __IO uint8_t ACFEN;
            stc_can_acfen_field_t ACFEN_f;
        };
        uint8_t RESERVED22[1];
        union {
            __IO uint32_t ACF;
            stc_can_acf_field_t ACF_f;
        };
        uint8_t RESERVED23[2];
        union {
            __IO uint8_t TBSLOT;
            stc_can_tbslot_field_t TBSLOT_f;
        };
        union {
            __IO uint8_t TTCFG;
            stc_can_ttcfg_field_t TTCFG_f;
        };
        union {
            __IO uint32_t REF_MSG;
            stc_can_ref_msg_field_t REF_MSG_f;
        };
        union {
            __IO uint16_t TRG_CFG;
            stc_can_trg_cfg_field_t TRG_CFG_f;
        };
        __IO uint16_t TT_TRIG;
        __IO uint16_t TT_WTRIG;
    } CAN_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CSR;
            stc_crc_csr_field_t CSR_f;
        };
        union {
            __IO uint32_t RESULT;
            stc_crc_result_field_t RESULT_f;
        };
        uint8_t RESERVED2[120];
        union {
            __IO uint32_t DATA;
            stc_crc_data_field_t DATA_f;
        };
    } CRC_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ARR;
            stc_ctrim_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_ctrim_cnt_field_t CNT_f;
        };
        uint8_t RESERVED2[4];
        union {
            __IO uint32_t CR0;
            stc_ctrim_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_ctrim_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t IER;
            stc_ctrim_ier_field_t IER_f;
        };
        union {
            __IO uint32_t ISR;
            stc_ctrim_isr_field_t ISR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_ctrim_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t FCAP;
            stc_ctrim_fcap_field_t FCAP_f;
        };
        union {
            __IO uint32_t TVAL;
            stc_ctrim_tval_field_t TVAL_f;
        };
        union {
            __IO uint32_t FLIM;
            stc_ctrim_flim_field_t FLIM_f;
        };
    } CTRIM_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CONF;
            stc_dmac_conf_field_t CONF_f;
        };
        uint8_t RESERVED1[12];
        union {
            __IO uint32_t CONFA0;
            stc_dmac_confa0_field_t CONFA0_f;
        };
        union {
            __IO uint32_t CONFB0;
            stc_dmac_confb0_field_t CONFB0_f;
        };
        union {
            __IO uint32_t SRCADR0;
            stc_dmac_srcadr0_field_t SRCADR0_f;
        };
        union {
            __IO uint32_t DSTADR0;
            stc_dmac_dstadr0_field_t DSTADR0_f;
        };
        union {
            __IO uint32_t CONFA1;
            stc_dmac_confa1_field_t CONFA1_f;
        };
        union {
            __IO uint32_t CONFB1;
            stc_dmac_confb1_field_t CONFB1_f;
        };
        union {
            __IO uint32_t SRCADR1;
            stc_dmac_srcadr1_field_t SRCADR1_f;
        };
        union {
            __IO uint32_t DSTADR1;
            stc_dmac_dstadr1_field_t DSTADR1_f;
        };
        union {
            __IO uint32_t CONFA2;
            stc_dmac_confa2_field_t CONFA2_f;
        };
        union {
            __IO uint32_t CONFB2;
            stc_dmac_confb2_field_t CONFB2_f;
        };
        union {
            __IO uint32_t SRCADR2;
            stc_dmac_srcadr2_field_t SRCADR2_f;
        };
        union {
            __IO uint32_t DSTADR2;
            stc_dmac_dstadr2_field_t DSTADR2_f;
        };
        union {
            __IO uint32_t CONFA3;
            stc_dmac_confa3_field_t CONFA3_f;
        };
        union {
            __IO uint32_t CONFB3;
            stc_dmac_confb3_field_t CONFB3_f;
        };
        union {
            __IO uint32_t SRCADR3;
            stc_dmac_srcadr3_field_t SRCADR3_f;
        };
        union {
            __IO uint32_t DSTADR3;
            stc_dmac_dstadr3_field_t DSTADR3_f;
        };
        union {
            __IO uint32_t CONFA4;
            stc_dmac_confa4_field_t CONFA4_f;
        };
        union {
            __IO uint32_t CONFB4;
            stc_dmac_confb4_field_t CONFB4_f;
        };
        union {
            __IO uint32_t SRCADR4;
            stc_dmac_srcadr4_field_t SRCADR4_f;
        };
        union {
            __IO uint32_t DSTADR4;
            stc_dmac_dstadr4_field_t DSTADR4_f;
        };
        union {
            __IO uint32_t CONFA5;
            stc_dmac_confa5_field_t CONFA5_f;
        };
        union {
            __IO uint32_t CONFB5;
            stc_dmac_confb5_field_t CONFB5_f;
        };
        union {
            __IO uint32_t SRCADR5;
            stc_dmac_srcadr5_field_t SRCADR5_f;
        };
        union {
            __IO uint32_t DSTADR5;
            stc_dmac_dstadr5_field_t DSTADR5_f;
        };
    } DMAC_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CSR;
            stc_eau_csr_field_t CSR_f;
        };
        union {
            __IO uint32_t DIVIDEND;
            stc_eau_dividend_field_t DIVIDEND_f;
        };
        union {
            __IO uint32_t DIVISOR;
            stc_eau_divisor_field_t DIVISOR_f;
        };
        union {
            __IO uint32_t QUOTIENT;
            stc_eau_quotient_field_t QUOTIENT_f;
        };
        union {
            __IO uint32_t REMAINDER;
            stc_eau_remainder_field_t REMAINDER_f;
        };
    } EAU_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR;
            stc_flash_cr_field_t CR_f;
        };
        union {
            __IO uint32_t WAIT;
            stc_flash_wait_field_t WAIT_f;
        };
        union {
            __IO uint32_t LOCKST;
            stc_flash_lockst_field_t LOCKST_f;
        };
        union {
            __IO uint32_t IER;
            stc_flash_ier_field_t IER_f;
        };
        union {
            __IO uint32_t IFR;
            stc_flash_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_flash_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t BYPASS;
            stc_flash_bypass_field_t BYPASS_f;
        };
        uint8_t RESERVED7[20];
        union {
            __IO uint32_t SLOCK0;
            stc_flash_slock0_field_t SLOCK0_f;
        };
        union {
            __IO uint32_t SLOCK1;
            stc_flash_slock1_field_t SLOCK1_f;
        };
    } FLASH_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t ADS;
            stc_gpio_ads_field_t ADS_f;
        };
        union {
            __IO uint32_t DIR;
            stc_gpio_dir_field_t DIR_f;
        };
        union {
            __IO uint32_t OPENDRAIN;
            stc_gpio_opendrain_field_t OPENDRAIN_f;
        };
        uint8_t RESERVED3[4];
        union {
            __IO uint32_t DRIVER;
            stc_gpio_driver_field_t DRIVER_f;
        };
        uint8_t RESERVED4[4];
        union {
            __IO uint32_t PUPD;
            stc_gpio_pupd_field_t PUPD_f;
        };
        union {
            __IO uint32_t IN;
            stc_gpio_in_field_t IN_f;
        };
        union {
            __IO uint32_t OUT;
            stc_gpio_out_field_t OUT_f;
        };
        union {
            __IO uint32_t BRR;
            stc_gpio_brr_field_t BRR_f;
        };
        union {
            __IO uint32_t BSRR;
            stc_gpio_bsrr_field_t BSRR_f;
        };
        uint8_t RESERVED9[4];
        union {
            __IO uint32_t AFRL;
            stc_gpio_afrl_field_t AFRL_f;
        };
        union {
            __IO uint32_t AFRH;
            stc_gpio_afrh_field_t AFRH_f;
        };
        union {
            __IO uint32_t HIGHIE;
            stc_gpio_highie_field_t HIGHIE_f;
        };
        union {
            __IO uint32_t LOWIE;
            stc_gpio_lowie_field_t LOWIE_f;
        };
        union {
            __IO uint32_t RISEIE;
            stc_gpio_riseie_field_t RISEIE_f;
        };
        union {
            __IO uint32_t FALLIE;
            stc_gpio_fallie_field_t FALLIE_f;
        };
        union {
            __IO uint32_t IFR;
            stc_gpio_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_gpio_icr_field_t ICR_f;
        };
    } GPIO_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[112];
        union {
            __IO uint32_t CR0;
            stc_gpioaux_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_gpioaux_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t CR2;
            stc_gpioaux_cr2_field_t CR2_f;
        };
    } GPIOAUX_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[768];
        union {
            __IO uint32_t ARR;
            stc_gtim_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t CNT;
            stc_gtim_cnt_field_t CNT_f;
        };
        union {
            __IO uint32_t CMMR;
            stc_gtim_cmmr_field_t CMMR_f;
        };
        union {
            __IO uint32_t CR1;
            stc_gtim_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t CR0;
            stc_gtim_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t IER;
            stc_gtim_ier_field_t IER_f;
        };
        union {
            __IO uint32_t IFR;
            stc_gtim_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_gtim_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t CCR0;
            stc_gtim_ccr0_field_t CCR0_f;
        };
        union {
            __IO uint32_t CCR1;
            stc_gtim_ccr1_field_t CCR1_f;
        };
        union {
            __IO uint32_t CCR2;
            stc_gtim_ccr2_field_t CCR2_f;
        };
        union {
            __IO uint32_t CCR3;
            stc_gtim_ccr3_field_t CCR3_f;
        };
    } GTIM_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t TMRUN;
            stc_i2c_tmrun_field_t TMRUN_f;
        };
        union {
            __IO uint32_t TM;
            stc_i2c_tm_field_t TM_f;
        };
        union {
            __IO uint32_t CR;
            stc_i2c_cr_field_t CR_f;
        };
        union {
            __IO uint32_t DATA;
            stc_i2c_data_field_t DATA_f;
        };
        union {
            __IO uint32_t ADDR0;
            stc_i2c_addr0_field_t ADDR0_f;
        };
        union {
            __IO uint32_t STAT;
            stc_i2c_stat_field_t STAT_f;
        };
        uint8_t RESERVED6[8];
        union {
            __IO uint32_t ADDR1;
            stc_i2c_addr1_field_t ADDR1_f;
        };
        union {
            __IO uint32_t ADDR2;
            stc_i2c_addr2_field_t ADDR2_f;
        };
        union {
            __IO uint32_t MATCH;
            stc_i2c_match_field_t MATCH_f;
        };
    } I2C_TypeDef;

