sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
    typedef struct
    {
        union {
            __IO uint32_t SR;
            stc_i2cslv_sr_field_t SR_f;
        };
        union {
            __IO uint32_t DOUTR;
            stc_i2cslv_doutr_field_t DOUTR_f;
        };
        union {
            __IO uint32_t ADIR;
            stc_i2cslv_adir_field_t ADIR_f;
        };
        union {
            __IO uint32_t SLADR0;
            stc_i2cslv_sladr0_field_t SLADR0_f;
        };
        union {
            __IO uint32_t SLADR1;
            stc_i2cslv_sladr1_field_t SLADR1_f;
        };
        union {
            __IO uint32_t SLADR2;
            stc_i2cslv_sladr2_field_t SLADR2_f;
        };
        union {
            __IO uint32_t SLADR3;
            stc_i2cslv_sladr3_field_t SLADR3_f;
        };
        union {
            __IO uint32_t DINR;
            stc_i2cslv_dinr_field_t DINR_f;
        };
        union {
            __IO uint32_t CR;
            stc_i2cslv_cr_field_t CR_f;
        };
        uint8_t RESERVED9[12];
        union {
            __IO uint32_t ADMR0;
            stc_i2cslv_admr0_field_t ADMR0_f;
        };
        uint8_t RESERVED10[12];
        union {
            __IO uint32_t FLT;
            stc_i2cslv_flt_field_t FLT_f;
        };
        union {
            __IO uint32_t TOR;
            stc_i2cslv_tor_field_t TOR_f;
        };
        union {
            __IO uint32_t ODDR;
            stc_i2cslv_oddr_field_t ODDR_f;
        };
        union {
            __IO uint32_t RSR;
            stc_i2cslv_rsr_field_t RSR_f;
        };
        union {
            __IO uint32_t IER;
            stc_i2cslv_ier_field_t IER_f;
        };
        union {
            __IO uint32_t ICR;
            stc_i2cslv_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t DIDR;
            stc_i2cslv_didr_field_t DIDR_f;
        };
    } I2CSLV_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t KR;
            stc_iwdt_kr_field_t KR_f;
        };
        union {
            __IO uint32_t CR;
            stc_iwdt_cr_field_t CR_f;
        };
        union {
            __IO uint32_t ARR;
            stc_iwdt_arr_field_t ARR_f;
        };
        union {
            __IO uint32_t SR;
            stc_iwdt_sr_field_t SR_f;
        };
        union {
            __IO uint32_t WINR;
            stc_iwdt_winr_field_t WINR_f;
        };
    } IWDT_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CNT;
            stc_lptim_cnt_field_t CNT_f;
        };
        union {
            __IO uint32_t ARR;
            stc_lptim_arr_field_t ARR_f;
        };
        uint8_t RESERVED2[4];
        union {
            __IO uint32_t CR;
            stc_lptim_cr_field_t CR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_lptim_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_lptim_iclr_field_t ICLR_f;
        };
    } LPTIM_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t SBUF;
            stc_lpuart_sbuf_field_t SBUF_f;
        };
        union {
            __IO uint32_t SCON;
            stc_lpuart_scon_field_t SCON_f;
        };
        union {
            __IO uint32_t SADDR;
            stc_lpuart_saddr_field_t SADDR_f;
        };
        union {
            __IO uint32_t SADEN;
            stc_lpuart_saden_field_t SADEN_f;
        };
        union {
            __IO uint32_t ISR;
            stc_lpuart_isr_field_t ISR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_lpuart_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t SCNT;
            stc_lpuart_scnt_field_t SCNT_f;
        };
    } LPUART_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR;
            stc_lvd_cr_field_t CR_f;
        };
        union {
            __IO uint32_t SR;
            stc_lvd_sr_field_t SR_f;
        };
    } LVD_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_opa_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_opa_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t AZ;
            stc_opa_az_field_t AZ_f;
        };
    } OPA_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR;
            stc_ram_cr_field_t CR_f;
        };
        union {
            __IO uint32_t ERRADDR;
            stc_ram_erraddr_field_t ERRADDR_f;
        };
        union {
            __IO uint32_t IFR;
            stc_ram_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICLR;
            stc_ram_iclr_field_t ICLR_f;
        };
    } RAM_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_rtc_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_rtc_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t SEC;
            stc_rtc_sec_field_t SEC_f;
        };
        union {
            __IO uint32_t MIN;
            stc_rtc_min_field_t MIN_f;
        };
        union {
            __IO uint32_t HOUR;
            stc_rtc_hour_field_t HOUR_f;
        };
        union {
            __IO uint32_t WEEK;
            stc_rtc_week_field_t WEEK_f;
        };
        union {
            __IO uint32_t DAY;
            stc_rtc_day_field_t DAY_f;
        };
        union {
            __IO uint32_t MON;
            stc_rtc_mon_field_t MON_f;
        };
        union {
            __IO uint32_t YEAR;
            stc_rtc_year_field_t YEAR_f;
        };
        uint8_t RESERVED9[12];
        union {
            __IO uint32_t COMPEN;
            stc_rtc_compen_field_t COMPEN_f;
        };
        uint8_t RESERVED10[8];
        union {
            __IO uint32_t CR2;
            stc_rtc_cr2_field_t CR2_f;
        };
        union {
            __IO uint32_t ALMA;
            stc_rtc_alma_field_t ALMA_f;
        };
        union {
            __IO uint32_t ALMB;
            stc_rtc_almb_field_t ALMB_f;
        };
        union {
            __IO uint32_t TSTR;
            stc_rtc_tstr_field_t TSTR_f;
        };
        union {
            __IO uint32_t TSDR;
            stc_rtc_tsdr_field_t TSDR_f;
        };
        union {
            __IO uint32_t WUTARR;
            stc_rtc_wutarr_field_t WUTARR_f;
        };
        union {
            __IO uint32_t IER;
            stc_rtc_ier_field_t IER_f;
        };
        union {
            __IO uint32_t IFR;
            stc_rtc_ifr_field_t IFR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_rtc_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t WPR;
            stc_rtc_wpr_field_t WPR_f;
        };
    } RTC_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_spi_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_spi_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t HDOE;
            stc_spi_hdoe_field_t HDOE_f;
        };
        union {
            __IO uint32_t SSI;
            stc_spi_ssi_field_t SSI_f;
        };
        union {
            __IO uint32_t SR;
            stc_spi_sr_field_t SR_f;
        };
        union {
            __IO uint32_t ICR;
            stc_spi_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t DR;
            stc_spi_dr_field_t DR_f;
        };
    } SPI_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_sysctrl_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_sysctrl_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t CR2;
            stc_sysctrl_cr2_field_t CR2_f;
        };
        union {
            __IO uint32_t CR3;
            stc_sysctrl_cr3_field_t CR3_f;
        };
        union {
            __IO uint32_t RCHCR;
            stc_sysctrl_rchcr_field_t RCHCR_f;
        };
        union {
            __IO uint32_t XTHCR;
            stc_sysctrl_xthcr_field_t XTHCR_f;
        };
        union {
            __IO uint32_t RCLCR;
            stc_sysctrl_rclcr_field_t RCLCR_f;
        };
        union {
            __IO uint32_t XTLCR;
            stc_sysctrl_xtlcr_field_t XTLCR_f;
        };
        union {
            __IO uint32_t PLLCR;
            stc_sysctrl_pllcr_field_t PLLCR_f;
        };
        union {
            __IO uint32_t RCHTRIM;
            stc_sysctrl_rchtrim_field_t RCHTRIM_f;
        };
        union {
            __IO uint32_t RCLTRIM;
            stc_sysctrl_rcltrim_field_t RCLTRIM_f;
        };
        union {
            __IO uint32_t STATE;
            stc_sysctrl_state_field_t STATE_f;
        };
        union {
            __IO uint32_t PERICLKEN0;
            stc_sysctrl_periclken0_field_t PERICLKEN0_f;
        };
        union {
            __IO uint32_t PERICLKEN1;
            stc_sysctrl_periclken1_field_t PERICLKEN1_f;
        };
        union {
            __IO uint32_t PERIRESET0;
            stc_sysctrl_perireset0_field_t PERIRESET0_f;
        };
        union {
            __IO uint32_t PERIRESET1;
            stc_sysctrl_perireset1_field_t PERIRESET1_f;
        };
        union {
            __IO uint32_t RSTFLAG;
            stc_sysctrl_rstflag_field_t RSTFLAG_f;
        };
        union {
            __IO uint32_t DBGSTOP;
            stc_sysctrl_dbgstop_field_t DBGSTOP_f;
        };
    } SYSCTRL_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR1;
            stc_usart_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t CR2;
            stc_usart_cr2_field_t CR2_f;
        };
        union {
            __IO uint32_t CR3;
            stc_usart_cr3_field_t CR3_f;
        };
        union {
            __IO uint32_t BRR;
            stc_usart_brr_field_t BRR_f;
        };
        union {
            __IO uint32_t TOR;
            stc_usart_tor_field_t TOR_f;
        };
        union {
            __IO uint32_t SR;
            stc_usart_sr_field_t SR_f;
        };
        union {
            __IO uint32_t TDR;
            stc_usart_tdr_field_t TDR_f;
        };
        union {
            __IO uint32_t IER;
            stc_usart_ier_field_t IER_f;
        };
        union {
            __IO uint32_t ICR;
            stc_usart_icr_field_t ICR_f;
        };
        union {
            __IO uint32_t RDR;
            stc_usart_rdr_field_t RDR_f;
        };
        union {
            __IO uint32_t ADDR;
            stc_usart_addr_field_t ADDR_f;
        };
        union {
            __IO uint32_t ADDMR;
            stc_usart_addmr_field_t ADDMR_f;
        };
        union {
            __IO uint32_t BDR;
            stc_usart_bdr_field_t BDR_f;
        };
        uint8_t RESERVED13[188];
        union {
            __IO uint32_t IR;
            stc_usart_ir_field_t IR_f;
        };
    } USART_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_vc_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_vc_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t CR2;
            stc_vc_cr2_field_t CR2_f;
        };
        union {
            __IO uint32_t SR;
            stc_vc_sr_field_t SR_f;
        };
    } VC_TypeDef;

    typedef struct
    {
        union {
            __IO uint32_t CR0;
            stc_wwdt_cr0_field_t CR0_f;
        };
        union {
            __IO uint32_t CR1;
            stc_wwdt_cr1_field_t CR1_f;
        };
        union {
            __IO uint32_t SR;
            stc_wwdt_sr_field_t SR_f;
        };
    } WWDT_TypeDef;

