sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
#define PERIPH_BASE (0x40000000UL)
#define ADC_BASE (PERIPH_BASE + 0x00002500UL)
#define ATIM0MODE0_BASE (PERIPH_BASE + 0x00003000UL)
#define ATIM0MODE1_BASE (PERIPH_BASE + 0x00003000UL)
#define ATIM0MODE23_BASE (PERIPH_BASE + 0x00003000UL)
#define ATIM1MODE0_BASE (PERIPH_BASE + 0x00003400UL)
#define ATIM1MODE1_BASE (PERIPH_BASE + 0x00003400UL)
#define ATIM1MODE23_BASE (PERIPH_BASE + 0x00003400UL)
#define ATIM2MODE0_BASE (PERIPH_BASE + 0x00003800UL)
#define ATIM2MODE1_BASE (PERIPH_BASE + 0x00003800UL)
#define ATIM2MODE23_BASE (PERIPH_BASE + 0x00003800UL)
#define ATIM3MODE0_BASE (PERIPH_BASE + 0x00005800UL)
#define ATIM3MODE1_BASE (PERIPH_BASE + 0x00005800UL)
#define ATIM3MODE23_BASE (PERIPH_BASE + 0x00005800UL)
#define BTIM0_BASE (PERIPH_BASE + 0x00001800UL)
#define BTIM1_BASE (PERIPH_BASE + 0x00001900UL)
#define BTIM2_BASE (PERIPH_BASE + 0x00001A00UL)
#define BTIM3_BASE (PERIPH_BASE + 0x00001C00UL)
#define BTIM4_BASE (PERIPH_BASE + 0x00001D00UL)
#define BTIM5_BASE (PERIPH_BASE + 0x00001E00UL)
#define CAN_BASE (PERIPH_BASE + 0x00030000UL)
#define CRC_BASE (PERIPH_BASE + 0x00020800UL)
#define CTRIM_BASE (PERIPH_BASE + 0x00005000UL)
#define DMAC_BASE (PERIPH_BASE + 0x00021000UL)
#define EAU_BASE (PERIPH_BASE + 0x00021800UL)
#define FLASH_BASE (PERIPH_BASE + 0x00020000UL)
#define GPIOA_BASE (PERIPH_BASE + 0x00020C00UL)
#define GPIOAUX_BASE (PERIPH_BASE + 0x00002000UL)
#define GPIOB_BASE (PERIPH_BASE + 0x00021C00UL)
#define GPIOC_BASE (PERIPH_BASE + 0x00022000UL)
#define GPIOD_BASE (PERIPH_BASE + 0x00022400UL)
#define GTIM0_BASE (PERIPH_BASE + 0x00001800UL)
#define GTIM1_BASE (PERIPH_BASE + 0x00001C00UL)
#define I2C0_BASE (PERIPH_BASE + 0x00000400UL)
#define I2C1_BASE (PERIPH_BASE + 0x00004400UL)
#define I2CSLV_BASE (PERIPH_BASE + 0x00004C00UL)
#define IWDT_BASE (PERIPH_BASE + 0x00001080UL)
#define LPTIM_BASE (PERIPH_BASE + 0x00000C00UL)
#define LPUART0_BASE (PERIPH_BASE + 0x00000000UL)
#define LPUART1_BASE (PERIPH_BASE + 0x00004000UL)
#define LVD_BASE (PERIPH_BASE + 0x00002480UL)
#define OPA_BASE (PERIPH_BASE + 0x00002600UL)
#define RAM_BASE (PERIPH_BASE + 0x00020400UL)
#define RTC_BASE (PERIPH_BASE + 0x00001400UL)
#define SPI0_BASE (PERIPH_BASE + 0x00000800UL)
#define SPI1_BASE (PERIPH_BASE + 0x00004800UL)
#define SYSCTRL_BASE (PERIPH_BASE + 0x00002000UL)
#define USART0_BASE (PERIPH_BASE + 0x00006000UL)
#define USART1_BASE (PERIPH_BASE + 0x00006400UL)
#define VC0_BASE (PERIPH_BASE + 0x00002400UL)
#define VC1_BASE (PERIPH_BASE + 0x00002410UL)
#define WWDT_BASE (PERIPH_BASE + 0x00006800UL)

#define HC_ADC ((ADC_TypeDef *)0x40002500UL)
#define HC_ATIM0MODE0 ((ATIMMODE0_TypeDef *)0x40003000UL)
#define HC_ATIM0MODE1 ((ATIMMODE1_TypeDef *)0x40003000UL)
#define HC_ATIM0MODE23 ((ATIMMODE23_TypeDef *)0x40003000UL)
#define HC_ATIM1MODE0 ((ATIMMODE0_TypeDef *)0x40003400UL)
#define HC_ATIM1MODE1 ((ATIMMODE1_TypeDef *)0x40003400UL)
#define HC_ATIM1MODE23 ((ATIMMODE23_TypeDef *)0x40003400UL)
#define HC_ATIM2MODE0 ((ATIMMODE0_TypeDef *)0x40003800UL)
#define HC_ATIM2MODE1 ((ATIMMODE1_TypeDef *)0x40003800UL)
#define HC_ATIM2MODE23 ((ATIMMODE23_TypeDef *)0x40003800UL)
#define HC_ATIM3MODE0 ((ATIMMODE0_TypeDef *)0x40005800UL)
#define HC_ATIM3MODE1 ((ATIMMODE1_TypeDef *)0x40005800UL)
#define HC_ATIM3MODE23 ((ATIM3MODE23_TypeDef *)0x40005800UL)
#define HC_BTIM0 ((BTIM_TypeDef *)0x40001800UL)
#define HC_BTIM1 ((BTIM_TypeDef *)0x40001900UL)
#define HC_BTIM2 ((BTIM_TypeDef *)0x40001A00UL)
#define HC_BTIM3 ((BTIM_TypeDef *)0x40001C00UL)
#define HC_BTIM4 ((BTIM_TypeDef *)0x40001D00UL)
#define HC_BTIM5 ((BTIM_TypeDef *)0x40001E00UL)
#define HC_CAN ((CAN_TypeDef *)0x40030000UL)
#define HC_CRC ((CRC_TypeDef *)0x40020800UL)
#define HC_CTRIM ((CTRIM_TypeDef *)0x40005000UL)
#define HC_DMAC ((DMAC_TypeDef *)0x40021000UL)
#define HC_EAU ((EAU_TypeDef *)0x40021800UL)
#define HC_FLASH ((FLASH_TypeDef *)0x40020000UL)
#define HC_GPIOA ((GPIO_TypeDef *)0x40020C00UL)
#define HC_GPIOAUX ((GPIOAUX_TypeDef *)0x40002000UL)
#define HC_GPIOB ((GPIO_TypeDef *)0x40021C00UL)
#define HC_GPIOC ((GPIO_TypeDef *)0x40022000UL)
#define HC_GPIOD ((GPIO_TypeDef *)0x40022400UL)
#define HC_GTIM0 ((GTIM_TypeDef *)0x40001800UL)
#define HC_GTIM1 ((GTIM_TypeDef *)0x40001C00UL)
#define HC_I2C0 ((I2C_TypeDef *)0x40000400UL)
#define HC_I2C1 ((I2C_TypeDef *)0x40004400UL)
#define HC_I2CSLV ((I2CSLV_TypeDef *)0x40004C00UL)
#define HC_IWDT ((IWDT_TypeDef *)0x40001080UL)
#define HC_LPTIM ((LPTIM_TypeDef *)0x40000C00UL)
#define HC_LPUART0 ((LPUART_TypeDef *)0x40000000UL)
#define HC_LPUART1 ((LPUART_TypeDef *)0x40004000UL)
#define HC_LVD ((LVD_TypeDef *)0x40002480UL)
#define HC_OPA ((OPA_TypeDef *)0x40002600UL)
#define HC_RAM ((RAM_TypeDef *)0x40020400UL)
#define HC_RTC ((RTC_TypeDef *)0x40001400UL)
#define HC_SPI0 ((SPI_TypeDef *)0x40000800UL)
#define HC_SPI1 ((SPI_TypeDef *)0x40004800UL)
#define HC_SYSCTRL ((SYSCTRL_TypeDef *)0x40002000UL)
#define HC_USART0 ((USART_TypeDef *)0x40006000UL)
#define HC_USART1 ((USART_TypeDef *)0x40006400UL)
#define HC_VC0 ((VC_TypeDef *)0x40002400UL)
#define HC_VC1 ((VC_TypeDef *)0x40002410UL)
#define HC_WWDT ((WWDT_TypeDef *)0x40006800UL)

//********************    Bits Define For Peripheral ADC    ********************//
// ADC_BGR
#define ADC_BGR_BGREN_Pos (0U)
#define ADC_BGR_BGREN_Msk (0x1UL << ADC_BGR_BGREN_Pos)
#define ADC_BGR_BGREN ADC_BGR_BGREN_Msk
#define ADC_BGR_TSEN_Pos (1U)
#define ADC_BGR_TSEN_Msk (0x1UL << ADC_BGR_TSEN_Pos)
#define ADC_BGR_TSEN ADC_BGR_TSEN_Msk

// ADC_CR0
#define ADC_CR0_EN_Pos (0U)
#define ADC_CR0_EN_Msk (0x1UL << ADC_CR0_EN_Pos)
#define ADC_CR0_EN ADC_CR0_EN_Msk
#define ADC_CR0_CKDIV_Pos (1U)
#define ADC_CR0_CKDIV_Msk (0x7UL << ADC_CR0_CKDIV_Pos)
#define ADC_CR0_CKDIV ADC_CR0_CKDIV_Msk
#define ADC_CR0_SGLMUX_Pos (4U)
#define ADC_CR0_SGLMUX_Msk (0x1FUL << ADC_CR0_SGLMUX_Pos)
#define ADC_CR0_SGLMUX ADC_CR0_SGLMUX_Msk
#define ADC_CR0_REF_Pos (9U)
#define ADC_CR0_REF_Msk (0x3UL << ADC_CR0_REF_Pos)
#define ADC_CR0_REF ADC_CR0_REF_Msk
#define ADC_CR0_BUF_Pos (11U)
#define ADC_CR0_BUF_Msk (0x1UL << ADC_CR0_BUF_Pos)
#define ADC_CR0_BUF ADC_CR0_BUF_Msk
#define ADC_CR0_SAM_Pos (12U)
#define ADC_CR0_SAM_Msk (0x3UL << ADC_CR0_SAM_Pos)
#define ADC_CR0_SAM ADC_CR0_SAM_Msk

