sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ADC_CR1
#define ADC_CR1_MODE_Pos (0U)
#define ADC_CR1_MODE_Msk (0x3UL << ADC_CR1_MODE_Pos)
#define ADC_CR1_MODE ADC_CR1_MODE_Msk
#define ADC_CR1_ALIGN_Pos (2U)
#define ADC_CR1_ALIGN_Msk (0x1UL << ADC_CR1_ALIGN_Pos)
#define ADC_CR1_ALIGN ADC_CR1_ALIGN_Msk
#define ADC_CR1_THCH_Pos (3U)
#define ADC_CR1_THCH_Msk (0x1FUL << ADC_CR1_THCH_Pos)
#define ADC_CR1_THCH ADC_CR1_THCH_Msk
#define ADC_CR1_OVMD_Pos (10U)
#define ADC_CR1_OVMD_Msk (0x1UL << ADC_CR1_OVMD_Pos)
#define ADC_CR1_OVMD ADC_CR1_OVMD_Msk
#define ADC_CR1_RACCEN_Pos (11U)
#define ADC_CR1_RACCEN_Msk (0x1UL << ADC_CR1_RACCEN_Pos)
#define ADC_CR1_RACCEN ADC_CR1_RACCEN_Msk
#define ADC_CR1_LTCMP_Pos (12U)
#define ADC_CR1_LTCMP_Msk (0x1UL << ADC_CR1_LTCMP_Pos)
#define ADC_CR1_LTCMP ADC_CR1_LTCMP_Msk
#define ADC_CR1_HTCMP_Pos (13U)
#define ADC_CR1_HTCMP_Msk (0x1UL << ADC_CR1_HTCMP_Pos)
#define ADC_CR1_HTCMP ADC_CR1_HTCMP_Msk
#define ADC_CR1_REGCMP_Pos (14U)
#define ADC_CR1_REGCMP_Msk (0x1UL << ADC_CR1_REGCMP_Pos)
#define ADC_CR1_REGCMP ADC_CR1_REGCMP_Msk
#define ADC_CR1_RACCCLR_Pos (15U)
#define ADC_CR1_RACCCLR_Msk (0x1UL << ADC_CR1_RACCCLR_Pos)
#define ADC_CR1_RACCCLR ADC_CR1_RACCCLR_Msk

// ADC_IER
#define ADC_IER_ESG_Pos (0U)
#define ADC_IER_ESG_Msk (0x1UL << ADC_IER_ESG_Pos)
#define ADC_IER_ESG ADC_IER_ESG_Msk
#define ADC_IER_LTI_Pos (1U)
#define ADC_IER_LTI_Msk (0x1UL << ADC_IER_LTI_Pos)
#define ADC_IER_LTI ADC_IER_LTI_Msk
#define ADC_IER_HTI_Pos (2U)
#define ADC_IER_HTI_Msk (0x1UL << ADC_IER_HTI_Pos)
#define ADC_IER_HTI ADC_IER_HTI_Msk
#define ADC_IER_RGI_Pos (3U)
#define ADC_IER_RGI_Msk (0x1UL << ADC_IER_RGI_Pos)
#define ADC_IER_RGI ADC_IER_RGI_Msk
#define ADC_IER_EOS_Pos (4U)
#define ADC_IER_EOS_Msk (0x1UL << ADC_IER_EOS_Pos)
#define ADC_IER_EOS ADC_IER_EOS_Msk
#define ADC_IER_EOJ_Pos (5U)
#define ADC_IER_EOJ_Msk (0x1UL << ADC_IER_EOJ_Pos)
#define ADC_IER_EOJ ADC_IER_EOJ_Msk
#define ADC_IER_EOC_Pos (6U)
#define ADC_IER_EOC_Msk (0x1UL << ADC_IER_EOC_Pos)
#define ADC_IER_EOC ADC_IER_EOC_Msk
#define ADC_IER_DEOC_Pos (7U)
#define ADC_IER_DEOC_Msk (0x1UL << ADC_IER_DEOC_Pos)
#define ADC_IER_DEOC ADC_IER_DEOC_Msk
#define ADC_IER_DEOJ_Pos (8U)
#define ADC_IER_DEOJ_Msk (0x1UL << ADC_IER_DEOJ_Pos)
#define ADC_IER_DEOJ ADC_IER_DEOJ_Msk
#define ADC_IER_OV_Pos (9U)
#define ADC_IER_OV_Msk (0x1UL << ADC_IER_OV_Pos)
#define ADC_IER_OV ADC_IER_OV_Msk

// ADC_SQR0
#define ADC_SQR0_CH0MUX_Pos (0U)
#define ADC_SQR0_CH0MUX_Msk (0x1FUL << ADC_SQR0_CH0MUX_Pos)
#define ADC_SQR0_CH0MUX ADC_SQR0_CH0MUX_Msk
#define ADC_SQR0_CH1MUX_Pos (5U)
#define ADC_SQR0_CH1MUX_Msk (0x1FUL << ADC_SQR0_CH1MUX_Pos)
#define ADC_SQR0_CH1MUX ADC_SQR0_CH1MUX_Msk
#define ADC_SQR0_CH2MUX_Pos (10U)
#define ADC_SQR0_CH2MUX_Msk (0x1FUL << ADC_SQR0_CH2MUX_Pos)
#define ADC_SQR0_CH2MUX ADC_SQR0_CH2MUX_Msk
#define ADC_SQR0_CH3MUX_Pos (15U)
#define ADC_SQR0_CH3MUX_Msk (0x1FUL << ADC_SQR0_CH3MUX_Pos)
#define ADC_SQR0_CH3MUX ADC_SQR0_CH3MUX_Msk
#define ADC_SQR0_CH4MUX_Pos (20U)
#define ADC_SQR0_CH4MUX_Msk (0x1FUL << ADC_SQR0_CH4MUX_Pos)
#define ADC_SQR0_CH4MUX ADC_SQR0_CH4MUX_Msk
#define ADC_SQR0_CH5MUX_Pos (25U)
#define ADC_SQR0_CH5MUX_Msk (0x1FUL << ADC_SQR0_CH5MUX_Pos)
#define ADC_SQR0_CH5MUX ADC_SQR0_CH5MUX_Msk

// ADC_SQR1
#define ADC_SQR1_CH6MUX_Pos (0U)
#define ADC_SQR1_CH6MUX_Msk (0x1FUL << ADC_SQR1_CH6MUX_Pos)
#define ADC_SQR1_CH6MUX ADC_SQR1_CH6MUX_Msk
#define ADC_SQR1_CH7MUX_Pos (5U)
#define ADC_SQR1_CH7MUX_Msk (0x1FUL << ADC_SQR1_CH7MUX_Pos)
#define ADC_SQR1_CH7MUX ADC_SQR1_CH7MUX_Msk
#define ADC_SQR1_CH8MUX_Pos (10U)
#define ADC_SQR1_CH8MUX_Msk (0x1FUL << ADC_SQR1_CH8MUX_Pos)
#define ADC_SQR1_CH8MUX ADC_SQR1_CH8MUX_Msk
#define ADC_SQR1_CH9MUX_Pos (15U)
#define ADC_SQR1_CH9MUX_Msk (0x1FUL << ADC_SQR1_CH9MUX_Pos)
#define ADC_SQR1_CH9MUX ADC_SQR1_CH9MUX_Msk
#define ADC_SQR1_CH10MUX_Pos (20U)
#define ADC_SQR1_CH10MUX_Msk (0x1FUL << ADC_SQR1_CH10MUX_Pos)
#define ADC_SQR1_CH10MUX ADC_SQR1_CH10MUX_Msk
#define ADC_SQR1_CH11MUX_Pos (25U)
#define ADC_SQR1_CH11MUX_Msk (0x1FUL << ADC_SQR1_CH11MUX_Pos)
#define ADC_SQR1_CH11MUX ADC_SQR1_CH11MUX_Msk

// ADC_SQR2
#define ADC_SQR2_CH12MUX_Pos (0U)
#define ADC_SQR2_CH12MUX_Msk (0x1FUL << ADC_SQR2_CH12MUX_Pos)
#define ADC_SQR2_CH12MUX ADC_SQR2_CH12MUX_Msk
#define ADC_SQR2_CH13MUX_Pos (5U)
#define ADC_SQR2_CH13MUX_Msk (0x1FUL << ADC_SQR2_CH13MUX_Pos)
#define ADC_SQR2_CH13MUX ADC_SQR2_CH13MUX_Msk
#define ADC_SQR2_CH14MUX_Pos (10U)
#define ADC_SQR2_CH14MUX_Msk (0x1FUL << ADC_SQR2_CH14MUX_Pos)
#define ADC_SQR2_CH14MUX ADC_SQR2_CH14MUX_Msk
#define ADC_SQR2_CH15MUX_Pos (15U)
#define ADC_SQR2_CH15MUX_Msk (0x1FUL << ADC_SQR2_CH15MUX_Pos)
#define ADC_SQR2_CH15MUX ADC_SQR2_CH15MUX_Msk
#define ADC_SQR2_CNT_Pos (20U)
#define ADC_SQR2_CNT_Msk (0xFUL << ADC_SQR2_CNT_Pos)
#define ADC_SQR2_CNT ADC_SQR2_CNT_Msk

// ADC_JQR
#define ADC_JQR_CH0MUX_Pos (0U)
#define ADC_JQR_CH0MUX_Msk (0x1FUL << ADC_JQR_CH0MUX_Pos)
#define ADC_JQR_CH0MUX ADC_JQR_CH0MUX_Msk
#define ADC_JQR_CH1MUX_Pos (5U)
#define ADC_JQR_CH1MUX_Msk (0x1FUL << ADC_JQR_CH1MUX_Pos)
#define ADC_JQR_CH1MUX ADC_JQR_CH1MUX_Msk
#define ADC_JQR_CH2MUX_Pos (10U)
#define ADC_JQR_CH2MUX_Msk (0x1FUL << ADC_JQR_CH2MUX_Pos)
#define ADC_JQR_CH2MUX ADC_JQR_CH2MUX_Msk
#define ADC_JQR_CH3MUX_Pos (15U)
#define ADC_JQR_CH3MUX_Msk (0x1FUL << ADC_JQR_CH3MUX_Pos)
#define ADC_JQR_CH3MUX ADC_JQR_CH3MUX_Msk
#define ADC_JQR_CNT_Pos (20U)
#define ADC_JQR_CNT_Msk (0x3UL << ADC_JQR_CNT_Pos)
#define ADC_JQR_CNT ADC_JQR_CNT_Msk

// ADC_SQRRESULT0
#define ADC_SQRRESULT0_RESULT_Pos (0U)
#define ADC_SQRRESULT0_RESULT_Msk (0xFFFFUL << ADC_SQRRESULT0_RESULT_Pos)
#define ADC_SQRRESULT0_RESULT ADC_SQRRESULT0_RESULT_Msk

// ADC_SQRRESULT1
#define ADC_SQRRESULT1_RESULT_Pos (0U)
#define ADC_SQRRESULT1_RESULT_Msk (0xFFFFUL << ADC_SQRRESULT1_RESULT_Pos)
#define ADC_SQRRESULT1_RESULT ADC_SQRRESULT1_RESULT_Msk

// ADC_SQRRESULT2
#define ADC_SQRRESULT2_RESULT_Pos (0U)
#define ADC_SQRRESULT2_RESULT_Msk (0xFFFFUL << ADC_SQRRESULT2_RESULT_Pos)
#define ADC_SQRRESULT2_RESULT ADC_SQRRESULT2_RESULT_Msk

// ADC_SQRRESULT3
#define ADC_SQRRESULT3_RESULT_Pos (0U)
#define ADC_SQRRESULT3_RESULT_Msk (0xFFFFUL << ADC_SQRRESULT3_RESULT_Pos)
#define ADC_SQRRESULT3_RESULT ADC_SQRRESULT3_RESULT_Msk

// ADC_JQRRESULT0
#define ADC_JQRRESULT0_RESULT_Pos (0U)
#define ADC_JQRRESULT0_RESULT_Msk (0xFFFFUL << ADC_JQRRESULT0_RESULT_Pos)
#define ADC_JQRRESULT0_RESULT ADC_JQRRESULT0_RESULT_Msk

