sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ADC_JQRRESULT1
#define ADC_JQRRESULT1_RESULT_Pos (0U)
#define ADC_JQRRESULT1_RESULT_Msk (0xFFFFUL << ADC_JQRRESULT1_RESULT_Pos)
#define ADC_JQRRESULT1_RESULT ADC_JQRRESULT1_RESULT_Msk

// ADC_JQRRESULT2
#define ADC_JQRRESULT2_RESULT_Pos (0U)
#define ADC_JQRRESULT2_RESULT_Msk (0xFFFFUL << ADC_JQRRESULT2_RESULT_Pos)
#define ADC_JQRRESULT2_RESULT ADC_JQRRESULT2_RESULT_Msk

// ADC_JQRRESULT3
#define ADC_JQRRESULT3_RESULT_Pos (0U)
#define ADC_JQRRESULT3_RESULT_Msk (0xFFFFUL << ADC_JQRRESULT3_RESULT_Pos)
#define ADC_JQRRESULT3_RESULT ADC_JQRRESULT3_RESULT_Msk

// ADC_RESULT
#define ADC_RESULT_RESULT_Pos (0U)
#define ADC_RESULT_RESULT_Msk (0xFFFFUL << ADC_RESULT_RESULT_Pos)
#define ADC_RESULT_RESULT ADC_RESULT_RESULT_Msk

// ADC_RESULTACC
#define ADC_RESULTACC_RESULTACC_Pos (0U)
#define ADC_RESULTACC_RESULTACC_Msk (0xFFFFFUL << ADC_RESULTACC_RESULTACC_Pos)
#define ADC_RESULTACC_RESULTACC ADC_RESULTACC_RESULTACC_Msk

// ADC_HT
#define ADC_HT_HT_Pos (0U)
#define ADC_HT_HT_Msk (0xFFFUL << ADC_HT_HT_Pos)
#define ADC_HT_HT ADC_HT_HT_Msk

// ADC_LT
#define ADC_LT_LT_Pos (0U)
#define ADC_LT_LT_Msk (0xFFFUL << ADC_LT_LT_Pos)
#define ADC_LT_LT ADC_LT_LT_Msk

// ADC_IFR
#define ADC_IFR_ESG_Pos (0U)
#define ADC_IFR_ESG_Msk (0x1UL << ADC_IFR_ESG_Pos)
#define ADC_IFR_ESG ADC_IFR_ESG_Msk
#define ADC_IFR_LTI_Pos (1U)
#define ADC_IFR_LTI_Msk (0x1UL << ADC_IFR_LTI_Pos)
#define ADC_IFR_LTI ADC_IFR_LTI_Msk
#define ADC_IFR_HTI_Pos (2U)
#define ADC_IFR_HTI_Msk (0x1UL << ADC_IFR_HTI_Pos)
#define ADC_IFR_HTI ADC_IFR_HTI_Msk
#define ADC_IFR_RGI_Pos (3U)
#define ADC_IFR_RGI_Msk (0x1UL << ADC_IFR_RGI_Pos)
#define ADC_IFR_RGI ADC_IFR_RGI_Msk
#define ADC_IFR_EOS_Pos (4U)
#define ADC_IFR_EOS_Msk (0x1UL << ADC_IFR_EOS_Pos)
#define ADC_IFR_EOS ADC_IFR_EOS_Msk
#define ADC_IFR_EOJ_Pos (5U)
#define ADC_IFR_EOJ_Msk (0x1UL << ADC_IFR_EOJ_Pos)
#define ADC_IFR_EOJ ADC_IFR_EOJ_Msk
#define ADC_IFR_EOC_Pos (6U)
#define ADC_IFR_EOC_Msk (0x1UL << ADC_IFR_EOC_Pos)
#define ADC_IFR_EOC ADC_IFR_EOC_Msk
#define ADC_IFR_OV_Pos (9U)
#define ADC_IFR_OV_Msk (0x1UL << ADC_IFR_OV_Pos)
#define ADC_IFR_OV ADC_IFR_OV_Msk
#define ADC_IFR_RDY_Pos (10U)
#define ADC_IFR_RDY_Msk (0x1UL << ADC_IFR_RDY_Pos)
#define ADC_IFR_RDY ADC_IFR_RDY_Msk

// ADC_ICR
#define ADC_ICR_ESG_Pos (0U)
#define ADC_ICR_ESG_Msk (0x1UL << ADC_ICR_ESG_Pos)
#define ADC_ICR_ESG ADC_ICR_ESG_Msk
#define ADC_ICR_LTI_Pos (1U)
#define ADC_ICR_LTI_Msk (0x1UL << ADC_ICR_LTI_Pos)
#define ADC_ICR_LTI ADC_ICR_LTI_Msk
#define ADC_ICR_HTI_Pos (2U)
#define ADC_ICR_HTI_Msk (0x1UL << ADC_ICR_HTI_Pos)
#define ADC_ICR_HTI ADC_ICR_HTI_Msk
#define ADC_ICR_RGI_Pos (3U)
#define ADC_ICR_RGI_Msk (0x1UL << ADC_ICR_RGI_Pos)
#define ADC_ICR_RGI ADC_ICR_RGI_Msk
#define ADC_ICR_EOS_Pos (4U)
#define ADC_ICR_EOS_Msk (0x1UL << ADC_ICR_EOS_Pos)
#define ADC_ICR_EOS ADC_ICR_EOS_Msk
#define ADC_ICR_EOJ_Pos (5U)
#define ADC_ICR_EOJ_Msk (0x1UL << ADC_ICR_EOJ_Pos)
#define ADC_ICR_EOJ ADC_ICR_EOJ_Msk
#define ADC_ICR_EOC_Pos (6U)
#define ADC_ICR_EOC_Msk (0x1UL << ADC_ICR_EOC_Pos)
#define ADC_ICR_EOC ADC_ICR_EOC_Msk
#define ADC_ICR_OV_Pos (9U)
#define ADC_ICR_OV_Msk (0x1UL << ADC_ICR_OV_Pos)
#define ADC_ICR_OV ADC_ICR_OV_Msk

// ADC_EXTTRIG0
#define ADC_EXTTRIG0_TRIG_Pos (0U)
#define ADC_EXTTRIG0_TRIG_Msk (0x1FUL << ADC_EXTTRIG0_TRIG_Pos)
#define ADC_EXTTRIG0_TRIG ADC_EXTTRIG0_TRIG_Msk
#define ADC_EXTTRIG0_DELAY_Pos (5U)
#define ADC_EXTTRIG0_DELAY_Msk (0x1UL << ADC_EXTTRIG0_DELAY_Pos)
#define ADC_EXTTRIG0_DELAY ADC_EXTTRIG0_DELAY_Msk

// ADC_EXTTRIG1
#define ADC_EXTTRIG1_TRIG_Pos (0U)
#define ADC_EXTTRIG1_TRIG_Msk (0x1FUL << ADC_EXTTRIG1_TRIG_Pos)
#define ADC_EXTTRIG1_TRIG ADC_EXTTRIG1_TRIG_Msk
#define ADC_EXTTRIG1_DELAY_Pos (5U)
#define ADC_EXTTRIG1_DELAY_Msk (0x1UL << ADC_EXTTRIG1_DELAY_Pos)
#define ADC_EXTTRIG1_DELAY ADC_EXTTRIG1_DELAY_Msk

// ADC_SGLSTART
#define ADC_SGLSTART_START_Pos (0U)
#define ADC_SGLSTART_START_Msk (0x1UL << ADC_SGLSTART_START_Pos)
#define ADC_SGLSTART_START ADC_SGLSTART_START_Msk

// ADC_SQRSTART
#define ADC_SQRSTART_START_Pos (0U)
#define ADC_SQRSTART_START_Msk (0x1UL << ADC_SQRSTART_START_Pos)
#define ADC_SQRSTART_START ADC_SQRSTART_START_Msk

// ADC_JQRSTART
#define ADC_JQRSTART_START_Pos (0U)
#define ADC_JQRSTART_START_Msk (0x1UL << ADC_JQRSTART_START_Pos)
#define ADC_JQRSTART_START ADC_JQRSTART_START_Msk

//********************    Bits Define For Peripheral ATIM3MODE23    ********************//
// ATIM3MODE23_ARR
#define ATIM3MODE23_ARR_ARR_Pos (0U)
#define ATIM3MODE23_ARR_ARR_Msk (0xFFFFUL << ATIM3MODE23_ARR_ARR_Pos)
#define ATIM3MODE23_ARR_ARR ATIM3MODE23_ARR_ARR_Msk

// ATIM3MODE23_CNT
#define ATIM3MODE23_CNT_CNT_Pos (0U)
#define ATIM3MODE23_CNT_CNT_Msk (0xFFFFUL << ATIM3MODE23_CNT_CNT_Pos)
#define ATIM3MODE23_CNT_CNT ATIM3MODE23_CNT_CNT_Msk

// ATIM3MODE23_M23CR
#define ATIM3MODE23_M23CR_CTEN_Pos (0U)
#define ATIM3MODE23_M23CR_CTEN_Msk (0x1UL << ATIM3MODE23_M23CR_CTEN_Pos)
#define ATIM3MODE23_M23CR_CTEN ATIM3MODE23_M23CR_CTEN_Msk
#define ATIM3MODE23_M23CR_COMP_Pos (1U)
#define ATIM3MODE23_M23CR_COMP_Msk (0x1UL << ATIM3MODE23_M23CR_COMP_Pos)
#define ATIM3MODE23_M23CR_COMP ATIM3MODE23_M23CR_COMP_Msk
#define ATIM3MODE23_M23CR_CT_Pos (2U)
#define ATIM3MODE23_M23CR_CT_Msk (0x1UL << ATIM3MODE23_M23CR_CT_Pos)
#define ATIM3MODE23_M23CR_CT ATIM3MODE23_M23CR_CT_Msk
#define ATIM3MODE23_M23CR_PWM2S_Pos (3U)
#define ATIM3MODE23_M23CR_PWM2S_Msk (0x1UL << ATIM3MODE23_M23CR_PWM2S_Pos)
#define ATIM3MODE23_M23CR_PWM2S ATIM3MODE23_M23CR_PWM2S_Msk
#define ATIM3MODE23_M23CR_PRS_Pos (4U)
#define ATIM3MODE23_M23CR_PRS_Msk (0x7UL << ATIM3MODE23_M23CR_PRS_Pos)
#define ATIM3MODE23_M23CR_PRS ATIM3MODE23_M23CR_PRS_Msk
#define ATIM3MODE23_M23CR_BUFPEN_Pos (7U)
#define ATIM3MODE23_M23CR_BUFPEN_Msk (0x1UL << ATIM3MODE23_M23CR_BUFPEN_Pos)
#define ATIM3MODE23_M23CR_BUFPEN ATIM3MODE23_M23CR_BUFPEN_Msk
#define ATIM3MODE23_M23CR_CRG_Pos (8U)
#define ATIM3MODE23_M23CR_CRG_Msk (0x1UL << ATIM3MODE23_M23CR_CRG_Pos)
#define ATIM3MODE23_M23CR_CRG ATIM3MODE23_M23CR_CRG_Msk
#define ATIM3MODE23_M23CR_CFG_Pos (9U)
#define ATIM3MODE23_M23CR_CFG_Msk (0x1UL << ATIM3MODE23_M23CR_CFG_Pos)
#define ATIM3MODE23_M23CR_CFG ATIM3MODE23_M23CR_CFG_Msk
#define ATIM3MODE23_M23CR_UIE_Pos (10U)
#define ATIM3MODE23_M23CR_UIE_Msk (0x1UL << ATIM3MODE23_M23CR_UIE_Pos)
#define ATIM3MODE23_M23CR_UIE ATIM3MODE23_M23CR_UIE_Msk
#define ATIM3MODE23_M23CR_UDE_Pos (11U)
#define ATIM3MODE23_M23CR_UDE_Msk (0x1UL << ATIM3MODE23_M23CR_UDE_Pos)
#define ATIM3MODE23_M23CR_UDE ATIM3MODE23_M23CR_UDE_Msk
#define ATIM3MODE23_M23CR_MODE_Pos (12U)
#define ATIM3MODE23_M23CR_MODE_Msk (0x3UL << ATIM3MODE23_M23CR_MODE_Pos)
#define ATIM3MODE23_M23CR_MODE ATIM3MODE23_M23CR_MODE_Msk
#define ATIM3MODE23_M23CR_ONESHOT_Pos (14U)
#define ATIM3MODE23_M23CR_ONESHOT_Msk (0x1UL << ATIM3MODE23_M23CR_ONESHOT_Pos)
#define ATIM3MODE23_M23CR_ONESHOT ATIM3MODE23_M23CR_ONESHOT_Msk
#define ATIM3MODE23_M23CR_CSG_Pos (15U)
#define ATIM3MODE23_M23CR_CSG_Msk (0x1UL << ATIM3MODE23_M23CR_CSG_Pos)
#define ATIM3MODE23_M23CR_CSG ATIM3MODE23_M23CR_CSG_Msk
#define ATIM3MODE23_M23CR_OCCS_Pos (16U)
#define ATIM3MODE23_M23CR_OCCS_Msk (0x1UL << ATIM3MODE23_M23CR_OCCS_Pos)
#define ATIM3MODE23_M23CR_OCCS ATIM3MODE23_M23CR_OCCS_Msk
#define ATIM3MODE23_M23CR_URS_Pos (17U)
#define ATIM3MODE23_M23CR_URS_Msk (0x1UL << ATIM3MODE23_M23CR_URS_Pos)
#define ATIM3MODE23_M23CR_URS ATIM3MODE23_M23CR_URS_Msk
#define ATIM3MODE23_M23CR_TDE_Pos (18U)
#define ATIM3MODE23_M23CR_TDE_Msk (0x1UL << ATIM3MODE23_M23CR_TDE_Pos)
#define ATIM3MODE23_M23CR_TDE ATIM3MODE23_M23CR_TDE_Msk
#define ATIM3MODE23_M23CR_TIE_Pos (19U)
#define ATIM3MODE23_M23CR_TIE_Msk (0x1UL << ATIM3MODE23_M23CR_TIE_Pos)
#define ATIM3MODE23_M23CR_TIE ATIM3MODE23_M23CR_TIE_Msk
#define ATIM3MODE23_M23CR_BIE_Pos (20U)
#define ATIM3MODE23_M23CR_BIE_Msk (0x1UL << ATIM3MODE23_M23CR_BIE_Pos)
#define ATIM3MODE23_M23CR_BIE ATIM3MODE23_M23CR_BIE_Msk
#define ATIM3MODE23_M23CR_CIS_Pos (21U)
#define ATIM3MODE23_M23CR_CIS_Msk (0x3UL << ATIM3MODE23_M23CR_CIS_Pos)
#define ATIM3MODE23_M23CR_CIS ATIM3MODE23_M23CR_CIS_Msk
#define ATIM3MODE23_M23CR_OCCE_Pos (23U)
#define ATIM3MODE23_M23CR_OCCE_Msk (0x1UL << ATIM3MODE23_M23CR_OCCE_Pos)
#define ATIM3MODE23_M23CR_OCCE ATIM3MODE23_M23CR_OCCE_Msk
#define ATIM3MODE23_M23CR_TG_Pos (24U)
#define ATIM3MODE23_M23CR_TG_Msk (0x1UL << ATIM3MODE23_M23CR_TG_Pos)
#define ATIM3MODE23_M23CR_TG ATIM3MODE23_M23CR_TG_Msk
#define ATIM3MODE23_M23CR_UG_Pos (25U)
#define ATIM3MODE23_M23CR_UG_Msk (0x1UL << ATIM3MODE23_M23CR_UG_Pos)
#define ATIM3MODE23_M23CR_UG ATIM3MODE23_M23CR_UG_Msk
#define ATIM3MODE23_M23CR_BG_Pos (26U)
#define ATIM3MODE23_M23CR_BG_Msk (0x1UL << ATIM3MODE23_M23CR_BG_Pos)
#define ATIM3MODE23_M23CR_BG ATIM3MODE23_M23CR_BG_Msk
#define ATIM3MODE23_M23CR_DIR_Pos (27U)
#define ATIM3MODE23_M23CR_DIR_Msk (0x1UL << ATIM3MODE23_M23CR_DIR_Pos)
#define ATIM3MODE23_M23CR_DIR ATIM3MODE23_M23CR_DIR_Msk
#define ATIM3MODE23_M23CR_OVE_Pos (28U)
#define ATIM3MODE23_M23CR_OVE_Msk (0x1UL << ATIM3MODE23_M23CR_OVE_Pos)
#define ATIM3MODE23_M23CR_OVE ATIM3MODE23_M23CR_OVE_Msk
#define ATIM3MODE23_M23CR_UNDE_Pos (29U)
#define ATIM3MODE23_M23CR_UNDE_Msk (0x1UL << ATIM3MODE23_M23CR_UNDE_Pos)
#define ATIM3MODE23_M23CR_UNDE ATIM3MODE23_M23CR_UNDE_Msk

// ATIM3MODE23_IFR
#define ATIM3MODE23_IFR_UI_Pos (0U)
#define ATIM3MODE23_IFR_UI_Msk (0x1UL << ATIM3MODE23_IFR_UI_Pos)
#define ATIM3MODE23_IFR_UI ATIM3MODE23_IFR_UI_Msk
#define ATIM3MODE23_IFR_CA0_Pos (2U)
#define ATIM3MODE23_IFR_CA0_Msk (0x1UL << ATIM3MODE23_IFR_CA0_Pos)
#define ATIM3MODE23_IFR_CA0 ATIM3MODE23_IFR_CA0_Msk
#define ATIM3MODE23_IFR_CA1_Pos (3U)
#define ATIM3MODE23_IFR_CA1_Msk (0x1UL << ATIM3MODE23_IFR_CA1_Pos)
#define ATIM3MODE23_IFR_CA1 ATIM3MODE23_IFR_CA1_Msk
#define ATIM3MODE23_IFR_CA2_Pos (4U)
#define ATIM3MODE23_IFR_CA2_Msk (0x1UL << ATIM3MODE23_IFR_CA2_Pos)
#define ATIM3MODE23_IFR_CA2 ATIM3MODE23_IFR_CA2_Msk
#define ATIM3MODE23_IFR_CB0_Pos (5U)
#define ATIM3MODE23_IFR_CB0_Msk (0x1UL << ATIM3MODE23_IFR_CB0_Pos)
#define ATIM3MODE23_IFR_CB0 ATIM3MODE23_IFR_CB0_Msk
#define ATIM3MODE23_IFR_CB1_Pos (6U)
#define ATIM3MODE23_IFR_CB1_Msk (0x1UL << ATIM3MODE23_IFR_CB1_Pos)
#define ATIM3MODE23_IFR_CB1 ATIM3MODE23_IFR_CB1_Msk
#define ATIM3MODE23_IFR_CB2_Pos (7U)
#define ATIM3MODE23_IFR_CB2_Msk (0x1UL << ATIM3MODE23_IFR_CB2_Pos)
#define ATIM3MODE23_IFR_CB2 ATIM3MODE23_IFR_CB2_Msk
#define ATIM3MODE23_IFR_CA0E_Pos (8U)
#define ATIM3MODE23_IFR_CA0E_Msk (0x1UL << ATIM3MODE23_IFR_CA0E_Pos)
#define ATIM3MODE23_IFR_CA0E ATIM3MODE23_IFR_CA0E_Msk
#define ATIM3MODE23_IFR_CA1E_Pos (9U)
#define ATIM3MODE23_IFR_CA1E_Msk (0x1UL << ATIM3MODE23_IFR_CA1E_Pos)
#define ATIM3MODE23_IFR_CA1E ATIM3MODE23_IFR_CA1E_Msk
#define ATIM3MODE23_IFR_CA2E_Pos (10U)
#define ATIM3MODE23_IFR_CA2E_Msk (0x1UL << ATIM3MODE23_IFR_CA2E_Pos)
#define ATIM3MODE23_IFR_CA2E ATIM3MODE23_IFR_CA2E_Msk
#define ATIM3MODE23_IFR_CB0E_Pos (11U)
#define ATIM3MODE23_IFR_CB0E_Msk (0x1UL << ATIM3MODE23_IFR_CB0E_Pos)
#define ATIM3MODE23_IFR_CB0E ATIM3MODE23_IFR_CB0E_Msk
#define ATIM3MODE23_IFR_CB1E_Pos (12U)
#define ATIM3MODE23_IFR_CB1E_Msk (0x1UL << ATIM3MODE23_IFR_CB1E_Pos)
#define ATIM3MODE23_IFR_CB1E ATIM3MODE23_IFR_CB1E_Msk
#define ATIM3MODE23_IFR_CB2E_Pos (13U)
#define ATIM3MODE23_IFR_CB2E_Msk (0x1UL << ATIM3MODE23_IFR_CB2E_Pos)
#define ATIM3MODE23_IFR_CB2E ATIM3MODE23_IFR_CB2E_Msk
#define ATIM3MODE23_IFR_BI_Pos (14U)
#define ATIM3MODE23_IFR_BI_Msk (0x1UL << ATIM3MODE23_IFR_BI_Pos)
#define ATIM3MODE23_IFR_BI ATIM3MODE23_IFR_BI_Msk
#define ATIM3MODE23_IFR_TI_Pos (15U)
#define ATIM3MODE23_IFR_TI_Msk (0x1UL << ATIM3MODE23_IFR_TI_Pos)
#define ATIM3MODE23_IFR_TI ATIM3MODE23_IFR_TI_Msk
#define ATIM3MODE23_IFR_OV_Pos (16U)
#define ATIM3MODE23_IFR_OV_Msk (0x1UL << ATIM3MODE23_IFR_OV_Pos)
#define ATIM3MODE23_IFR_OV ATIM3MODE23_IFR_OV_Msk
#define ATIM3MODE23_IFR_UND_Pos (17U)
#define ATIM3MODE23_IFR_UND_Msk (0x1UL << ATIM3MODE23_IFR_UND_Pos)
#define ATIM3MODE23_IFR_UND ATIM3MODE23_IFR_UND_Msk
#define ATIM3MODE23_IFR_CA3A_Pos (18U)
#define ATIM3MODE23_IFR_CA3A_Msk (0x1UL << ATIM3MODE23_IFR_CA3A_Pos)
#define ATIM3MODE23_IFR_CA3A ATIM3MODE23_IFR_CA3A_Msk
#define ATIM3MODE23_IFR_CA3B_Pos (19U)
#define ATIM3MODE23_IFR_CA3B_Msk (0x1UL << ATIM3MODE23_IFR_CA3B_Pos)
#define ATIM3MODE23_IFR_CA3B ATIM3MODE23_IFR_CA3B_Msk

// ATIM3MODE23_ICLR
#define ATIM3MODE23_ICLR_UI_Pos (0U)
#define ATIM3MODE23_ICLR_UI_Msk (0x1UL << ATIM3MODE23_ICLR_UI_Pos)
#define ATIM3MODE23_ICLR_UI ATIM3MODE23_ICLR_UI_Msk
#define ATIM3MODE23_ICLR_CA0_Pos (2U)
#define ATIM3MODE23_ICLR_CA0_Msk (0x1UL << ATIM3MODE23_ICLR_CA0_Pos)
#define ATIM3MODE23_ICLR_CA0 ATIM3MODE23_ICLR_CA0_Msk
#define ATIM3MODE23_ICLR_CA1_Pos (3U)
#define ATIM3MODE23_ICLR_CA1_Msk (0x1UL << ATIM3MODE23_ICLR_CA1_Pos)
#define ATIM3MODE23_ICLR_CA1 ATIM3MODE23_ICLR_CA1_Msk
#define ATIM3MODE23_ICLR_CA2_Pos (4U)
#define ATIM3MODE23_ICLR_CA2_Msk (0x1UL << ATIM3MODE23_ICLR_CA2_Pos)
#define ATIM3MODE23_ICLR_CA2 ATIM3MODE23_ICLR_CA2_Msk
#define ATIM3MODE23_ICLR_CB0_Pos (5U)
#define ATIM3MODE23_ICLR_CB0_Msk (0x1UL << ATIM3MODE23_ICLR_CB0_Pos)
#define ATIM3MODE23_ICLR_CB0 ATIM3MODE23_ICLR_CB0_Msk
#define ATIM3MODE23_ICLR_CB1_Pos (6U)
#define ATIM3MODE23_ICLR_CB1_Msk (0x1UL << ATIM3MODE23_ICLR_CB1_Pos)
#define ATIM3MODE23_ICLR_CB1 ATIM3MODE23_ICLR_CB1_Msk
#define ATIM3MODE23_ICLR_CB2_Pos (7U)
#define ATIM3MODE23_ICLR_CB2_Msk (0x1UL << ATIM3MODE23_ICLR_CB2_Pos)
#define ATIM3MODE23_ICLR_CB2 ATIM3MODE23_ICLR_CB2_Msk
#define ATIM3MODE23_ICLR_CA0E_Pos (8U)
#define ATIM3MODE23_ICLR_CA0E_Msk (0x1UL << ATIM3MODE23_ICLR_CA0E_Pos)
#define ATIM3MODE23_ICLR_CA0E ATIM3MODE23_ICLR_CA0E_Msk
#define ATIM3MODE23_ICLR_CA1E_Pos (9U)
#define ATIM3MODE23_ICLR_CA1E_Msk (0x1UL << ATIM3MODE23_ICLR_CA1E_Pos)
#define ATIM3MODE23_ICLR_CA1E ATIM3MODE23_ICLR_CA1E_Msk
#define ATIM3MODE23_ICLR_CA2E_Pos (10U)
#define ATIM3MODE23_ICLR_CA2E_Msk (0x1UL << ATIM3MODE23_ICLR_CA2E_Pos)
#define ATIM3MODE23_ICLR_CA2E ATIM3MODE23_ICLR_CA2E_Msk
#define ATIM3MODE23_ICLR_CB0E_Pos (11U)
#define ATIM3MODE23_ICLR_CB0E_Msk (0x1UL << ATIM3MODE23_ICLR_CB0E_Pos)
#define ATIM3MODE23_ICLR_CB0E ATIM3MODE23_ICLR_CB0E_Msk
#define ATIM3MODE23_ICLR_CB1E_Pos (12U)
#define ATIM3MODE23_ICLR_CB1E_Msk (0x1UL << ATIM3MODE23_ICLR_CB1E_Pos)
#define ATIM3MODE23_ICLR_CB1E ATIM3MODE23_ICLR_CB1E_Msk
#define ATIM3MODE23_ICLR_CB2E_Pos (13U)
#define ATIM3MODE23_ICLR_CB2E_Msk (0x1UL << ATIM3MODE23_ICLR_CB2E_Pos)
#define ATIM3MODE23_ICLR_CB2E ATIM3MODE23_ICLR_CB2E_Msk
#define ATIM3MODE23_ICLR_BI_Pos (14U)
#define ATIM3MODE23_ICLR_BI_Msk (0x1UL << ATIM3MODE23_ICLR_BI_Pos)
#define ATIM3MODE23_ICLR_BI ATIM3MODE23_ICLR_BI_Msk
#define ATIM3MODE23_ICLR_TI_Pos (15U)
#define ATIM3MODE23_ICLR_TI_Msk (0x1UL << ATIM3MODE23_ICLR_TI_Pos)
#define ATIM3MODE23_ICLR_TI ATIM3MODE23_ICLR_TI_Msk
#define ATIM3MODE23_ICLR_OV_Pos (16U)
#define ATIM3MODE23_ICLR_OV_Msk (0x1UL << ATIM3MODE23_ICLR_OV_Pos)
#define ATIM3MODE23_ICLR_OV ATIM3MODE23_ICLR_OV_Msk
#define ATIM3MODE23_ICLR_UND_Pos (17U)
#define ATIM3MODE23_ICLR_UND_Msk (0x1UL << ATIM3MODE23_ICLR_UND_Pos)
#define ATIM3MODE23_ICLR_UND ATIM3MODE23_ICLR_UND_Msk
#define ATIM3MODE23_ICLR_CA3A_Pos (18U)
#define ATIM3MODE23_ICLR_CA3A_Msk (0x1UL << ATIM3MODE23_ICLR_CA3A_Pos)
#define ATIM3MODE23_ICLR_CA3A ATIM3MODE23_ICLR_CA3A_Msk
#define ATIM3MODE23_ICLR_CA3B_Pos (19U)
#define ATIM3MODE23_ICLR_CA3B_Msk (0x1UL << ATIM3MODE23_ICLR_CA3B_Pos)
#define ATIM3MODE23_ICLR_CA3B ATIM3MODE23_ICLR_CA3B_Msk

// ATIM3MODE23_MSCR
#define ATIM3MODE23_MSCR_MMS_Pos (0U)
#define ATIM3MODE23_MSCR_MMS_Msk (0x7UL << ATIM3MODE23_MSCR_MMS_Pos)
#define ATIM3MODE23_MSCR_MMS ATIM3MODE23_MSCR_MMS_Msk
#define ATIM3MODE23_MSCR_CCDS_Pos (3U)
#define ATIM3MODE23_MSCR_CCDS_Msk (0x1UL << ATIM3MODE23_MSCR_CCDS_Pos)
#define ATIM3MODE23_MSCR_CCDS ATIM3MODE23_MSCR_CCDS_Msk
#define ATIM3MODE23_MSCR_MSM_Pos (4U)
#define ATIM3MODE23_MSCR_MSM_Msk (0x1UL << ATIM3MODE23_MSCR_MSM_Pos)
#define ATIM3MODE23_MSCR_MSM ATIM3MODE23_MSCR_MSM_Msk
#define ATIM3MODE23_MSCR_TS_Pos (5U)
#define ATIM3MODE23_MSCR_TS_Msk (0x7UL << ATIM3MODE23_MSCR_TS_Pos)
#define ATIM3MODE23_MSCR_TS ATIM3MODE23_MSCR_TS_Msk
#define ATIM3MODE23_MSCR_SMS_Pos (8U)
#define ATIM3MODE23_MSCR_SMS_Msk (0x7UL << ATIM3MODE23_MSCR_SMS_Pos)
#define ATIM3MODE23_MSCR_SMS ATIM3MODE23_MSCR_SMS_Msk
#define ATIM3MODE23_MSCR_IA0S_Pos (11U)
#define ATIM3MODE23_MSCR_IA0S_Msk (0x1UL << ATIM3MODE23_MSCR_IA0S_Pos)
#define ATIM3MODE23_MSCR_IA0S ATIM3MODE23_MSCR_IA0S_Msk
#define ATIM3MODE23_MSCR_IB0S_Pos (12U)
#define ATIM3MODE23_MSCR_IB0S_Msk (0x1UL << ATIM3MODE23_MSCR_IB0S_Pos)
#define ATIM3MODE23_MSCR_IB0S ATIM3MODE23_MSCR_IB0S_Msk

// ATIM3MODE23_FLTR
#define ATIM3MODE23_FLTR_OCMA0FLTA0_Pos (0U)
#define ATIM3MODE23_FLTR_OCMA0FLTA0_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA0FLTA0_Pos)
#define ATIM3MODE23_FLTR_OCMA0FLTA0 ATIM3MODE23_FLTR_OCMA0FLTA0_Msk
#define ATIM3MODE23_FLTR_CCPA0_Pos (3U)
#define ATIM3MODE23_FLTR_CCPA0_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA0_Pos)
#define ATIM3MODE23_FLTR_CCPA0 ATIM3MODE23_FLTR_CCPA0_Msk
#define ATIM3MODE23_FLTR_OCMB0FLTB0_Pos (4U)
#define ATIM3MODE23_FLTR_OCMB0FLTB0_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB0FLTB0_Pos)
#define ATIM3MODE23_FLTR_OCMB0FLTB0 ATIM3MODE23_FLTR_OCMB0FLTB0_Msk
#define ATIM3MODE23_FLTR_CCPB0_Pos (7U)
#define ATIM3MODE23_FLTR_CCPB0_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB0_Pos)
#define ATIM3MODE23_FLTR_CCPB0 ATIM3MODE23_FLTR_CCPB0_Msk
#define ATIM3MODE23_FLTR_OCMA1FLTA1_Pos (8U)
#define ATIM3MODE23_FLTR_OCMA1FLTA1_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA1FLTA1_Pos)
#define ATIM3MODE23_FLTR_OCMA1FLTA1 ATIM3MODE23_FLTR_OCMA1FLTA1_Msk
#define ATIM3MODE23_FLTR_CCPA1_Pos (11U)
#define ATIM3MODE23_FLTR_CCPA1_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA1_Pos)
#define ATIM3MODE23_FLTR_CCPA1 ATIM3MODE23_FLTR_CCPA1_Msk
#define ATIM3MODE23_FLTR_OCMB1FLTB1_Pos (12U)
#define ATIM3MODE23_FLTR_OCMB1FLTB1_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB1FLTB1_Pos)
#define ATIM3MODE23_FLTR_OCMB1FLTB1 ATIM3MODE23_FLTR_OCMB1FLTB1_Msk
#define ATIM3MODE23_FLTR_CCPB1_Pos (15U)
#define ATIM3MODE23_FLTR_CCPB1_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB1_Pos)
#define ATIM3MODE23_FLTR_CCPB1 ATIM3MODE23_FLTR_CCPB1_Msk
#define ATIM3MODE23_FLTR_OCMA2FLTA2_Pos (16U)
#define ATIM3MODE23_FLTR_OCMA2FLTA2_Msk (0x7UL << ATIM3MODE23_FLTR_OCMA2FLTA2_Pos)
#define ATIM3MODE23_FLTR_OCMA2FLTA2 ATIM3MODE23_FLTR_OCMA2FLTA2_Msk
#define ATIM3MODE23_FLTR_CCPA2_Pos (19U)
#define ATIM3MODE23_FLTR_CCPA2_Msk (0x1UL << ATIM3MODE23_FLTR_CCPA2_Pos)
#define ATIM3MODE23_FLTR_CCPA2 ATIM3MODE23_FLTR_CCPA2_Msk
#define ATIM3MODE23_FLTR_OCMB2FLTB2_Pos (20U)
#define ATIM3MODE23_FLTR_OCMB2FLTB2_Msk (0x7UL << ATIM3MODE23_FLTR_OCMB2FLTB2_Pos)
#define ATIM3MODE23_FLTR_OCMB2FLTB2 ATIM3MODE23_FLTR_OCMB2FLTB2_Msk
#define ATIM3MODE23_FLTR_CCPB2_Pos (23U)
#define ATIM3MODE23_FLTR_CCPB2_Msk (0x1UL << ATIM3MODE23_FLTR_CCPB2_Pos)
#define ATIM3MODE23_FLTR_CCPB2 ATIM3MODE23_FLTR_CCPB2_Msk
#define ATIM3MODE23_FLTR_FLTBK_Pos (24U)
#define ATIM3MODE23_FLTR_FLTBK_Msk (0x7UL << ATIM3MODE23_FLTR_FLTBK_Pos)
#define ATIM3MODE23_FLTR_FLTBK ATIM3MODE23_FLTR_FLTBK_Msk
#define ATIM3MODE23_FLTR_BKP_Pos (27U)
#define ATIM3MODE23_FLTR_BKP_Msk (0x1UL << ATIM3MODE23_FLTR_BKP_Pos)
#define ATIM3MODE23_FLTR_BKP ATIM3MODE23_FLTR_BKP_Msk
#define ATIM3MODE23_FLTR_FLTET_Pos (28U)
#define ATIM3MODE23_FLTR_FLTET_Msk (0x7UL << ATIM3MODE23_FLTR_FLTET_Pos)
#define ATIM3MODE23_FLTR_FLTET ATIM3MODE23_FLTR_FLTET_Msk
#define ATIM3MODE23_FLTR_ETP_Pos (31U)
#define ATIM3MODE23_FLTR_ETP_Msk (0x1UL << ATIM3MODE23_FLTR_ETP_Pos)
#define ATIM3MODE23_FLTR_ETP ATIM3MODE23_FLTR_ETP_Msk

