sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ATIM3MODE23_CRCH2
#define ATIM3MODE23_CRCH2_CFACRABKSA_Pos (0U)
#define ATIM3MODE23_CRCH2_CFACRABKSA_Msk (0x3UL << ATIM3MODE23_CRCH2_CFACRABKSA_Pos)
#define ATIM3MODE23_CRCH2_CFACRABKSA ATIM3MODE23_CRCH2_CFACRABKSA_Msk
#define ATIM3MODE23_CRCH2_CFBCRBBKSB_Pos (2U)
#define ATIM3MODE23_CRCH2_CFBCRBBKSB_Msk (0x3UL << ATIM3MODE23_CRCH2_CFBCRBBKSB_Pos)
#define ATIM3MODE23_CRCH2_CFBCRBBKSB ATIM3MODE23_CRCH2_CFBCRBBKSB_Msk
#define ATIM3MODE23_CRCH2_CSA_Pos (4U)
#define ATIM3MODE23_CRCH2_CSA_Msk (0x1UL << ATIM3MODE23_CRCH2_CSA_Pos)
#define ATIM3MODE23_CRCH2_CSA ATIM3MODE23_CRCH2_CSA_Msk
#define ATIM3MODE23_CRCH2_CSB_Pos (5U)
#define ATIM3MODE23_CRCH2_CSB_Msk (0x1UL << ATIM3MODE23_CRCH2_CSB_Pos)
#define ATIM3MODE23_CRCH2_CSB ATIM3MODE23_CRCH2_CSB_Msk
#define ATIM3MODE23_CRCH2_BUFEA_Pos (6U)
#define ATIM3MODE23_CRCH2_BUFEA_Msk (0x1UL << ATIM3MODE23_CRCH2_BUFEA_Pos)
#define ATIM3MODE23_CRCH2_BUFEA ATIM3MODE23_CRCH2_BUFEA_Msk
#define ATIM3MODE23_CRCH2_BUFEB_Pos (7U)
#define ATIM3MODE23_CRCH2_BUFEB_Msk (0x1UL << ATIM3MODE23_CRCH2_BUFEB_Pos)
#define ATIM3MODE23_CRCH2_BUFEB ATIM3MODE23_CRCH2_BUFEB_Msk
#define ATIM3MODE23_CRCH2_CIEA_Pos (8U)
#define ATIM3MODE23_CRCH2_CIEA_Msk (0x1UL << ATIM3MODE23_CRCH2_CIEA_Pos)
#define ATIM3MODE23_CRCH2_CIEA ATIM3MODE23_CRCH2_CIEA_Msk
#define ATIM3MODE23_CRCH2_CIEB_Pos (9U)
#define ATIM3MODE23_CRCH2_CIEB_Msk (0x1UL << ATIM3MODE23_CRCH2_CIEB_Pos)
#define ATIM3MODE23_CRCH2_CIEB ATIM3MODE23_CRCH2_CIEB_Msk
#define ATIM3MODE23_CRCH2_CDEA_Pos (10U)
#define ATIM3MODE23_CRCH2_CDEA_Msk (0x1UL << ATIM3MODE23_CRCH2_CDEA_Pos)
#define ATIM3MODE23_CRCH2_CDEA ATIM3MODE23_CRCH2_CDEA_Msk
#define ATIM3MODE23_CRCH2_CDEB_Pos (11U)
#define ATIM3MODE23_CRCH2_CDEB_Msk (0x1UL << ATIM3MODE23_CRCH2_CDEB_Pos)
#define ATIM3MODE23_CRCH2_CDEB ATIM3MODE23_CRCH2_CDEB_Msk
#define ATIM3MODE23_CRCH2_CISB_Pos (12U)
#define ATIM3MODE23_CRCH2_CISB_Msk (0x3UL << ATIM3MODE23_CRCH2_CISB_Pos)
#define ATIM3MODE23_CRCH2_CISB ATIM3MODE23_CRCH2_CISB_Msk
#define ATIM3MODE23_CRCH2_CCGA_Pos (14U)
#define ATIM3MODE23_CRCH2_CCGA_Msk (0x1UL << ATIM3MODE23_CRCH2_CCGA_Pos)
#define ATIM3MODE23_CRCH2_CCGA ATIM3MODE23_CRCH2_CCGA_Msk
#define ATIM3MODE23_CRCH2_CCGB_Pos (15U)
#define ATIM3MODE23_CRCH2_CCGB_Msk (0x1UL << ATIM3MODE23_CRCH2_CCGB_Pos)
#define ATIM3MODE23_CRCH2_CCGB ATIM3MODE23_CRCH2_CCGB_Msk

// ATIM3MODE23_DTR
#define ATIM3MODE23_DTR_DTR_Pos (0U)
#define ATIM3MODE23_DTR_DTR_Msk (0xFFUL << ATIM3MODE23_DTR_DTR_Pos)
#define ATIM3MODE23_DTR_DTR ATIM3MODE23_DTR_DTR_Msk
#define ATIM3MODE23_DTR_BKSEL_Pos (8U)
#define ATIM3MODE23_DTR_BKSEL_Msk (0x1UL << ATIM3MODE23_DTR_BKSEL_Pos)
#define ATIM3MODE23_DTR_BKSEL ATIM3MODE23_DTR_BKSEL_Msk
#define ATIM3MODE23_DTR_DTEN_Pos (9U)
#define ATIM3MODE23_DTR_DTEN_Msk (0x1UL << ATIM3MODE23_DTR_DTEN_Pos)
#define ATIM3MODE23_DTR_DTEN ATIM3MODE23_DTR_DTEN_Msk
#define ATIM3MODE23_DTR_BKE_Pos (10U)
#define ATIM3MODE23_DTR_BKE_Msk (0x1UL << ATIM3MODE23_DTR_BKE_Pos)
#define ATIM3MODE23_DTR_BKE ATIM3MODE23_DTR_BKE_Msk
#define ATIM3MODE23_DTR_AOE_Pos (11U)
#define ATIM3MODE23_DTR_AOE_Msk (0x1UL << ATIM3MODE23_DTR_AOE_Pos)
#define ATIM3MODE23_DTR_AOE ATIM3MODE23_DTR_AOE_Msk
#define ATIM3MODE23_DTR_MOE_Pos (12U)
#define ATIM3MODE23_DTR_MOE_Msk (0x1UL << ATIM3MODE23_DTR_MOE_Pos)
#define ATIM3MODE23_DTR_MOE ATIM3MODE23_DTR_MOE_Msk
#define ATIM3MODE23_DTR_SAFEEN_Pos (13U)
#define ATIM3MODE23_DTR_SAFEEN_Msk (0x1UL << ATIM3MODE23_DTR_SAFEEN_Pos)
#define ATIM3MODE23_DTR_SAFEEN ATIM3MODE23_DTR_SAFEEN_Msk
#define ATIM3MODE23_DTR_VCE_Pos (14U)
#define ATIM3MODE23_DTR_VCE_Msk (0x1UL << ATIM3MODE23_DTR_VCE_Pos)
#define ATIM3MODE23_DTR_VCE ATIM3MODE23_DTR_VCE_Msk

// ATIM3MODE23_RCR
#define ATIM3MODE23_RCR_RCR_Pos (0U)
#define ATIM3MODE23_RCR_RCR_Msk (0xFFUL << ATIM3MODE23_RCR_RCR_Pos)
#define ATIM3MODE23_RCR_RCR ATIM3MODE23_RCR_RCR_Msk
#define ATIM3MODE23_RCR_OV_Pos (8U)
#define ATIM3MODE23_RCR_OV_Msk (0x1UL << ATIM3MODE23_RCR_OV_Pos)
#define ATIM3MODE23_RCR_OV ATIM3MODE23_RCR_OV_Msk
#define ATIM3MODE23_RCR_UD_Pos (9U)
#define ATIM3MODE23_RCR_UD_Msk (0x1UL << ATIM3MODE23_RCR_UD_Pos)
#define ATIM3MODE23_RCR_UD ATIM3MODE23_RCR_UD_Msk

// ATIM3MODE23_CCR0A
#define ATIM3MODE23_CCR0A_CCR0A_Pos (0U)
#define ATIM3MODE23_CCR0A_CCR0A_Msk (0xFFFFUL << ATIM3MODE23_CCR0A_CCR0A_Pos)
#define ATIM3MODE23_CCR0A_CCR0A ATIM3MODE23_CCR0A_CCR0A_Msk

// ATIM3MODE23_CCR0B
#define ATIM3MODE23_CCR0B_CCR0B_Pos (0U)
#define ATIM3MODE23_CCR0B_CCR0B_Msk (0xFFFFUL << ATIM3MODE23_CCR0B_CCR0B_Pos)
#define ATIM3MODE23_CCR0B_CCR0B ATIM3MODE23_CCR0B_CCR0B_Msk

// ATIM3MODE23_CCR1A
#define ATIM3MODE23_CCR1A_CCR1A_Pos (0U)
#define ATIM3MODE23_CCR1A_CCR1A_Msk (0xFFFFUL << ATIM3MODE23_CCR1A_CCR1A_Pos)
#define ATIM3MODE23_CCR1A_CCR1A ATIM3MODE23_CCR1A_CCR1A_Msk

// ATIM3MODE23_CCR1B
#define ATIM3MODE23_CCR1B_CCR1B_Pos (0U)
#define ATIM3MODE23_CCR1B_CCR1B_Msk (0xFFFFUL << ATIM3MODE23_CCR1B_CCR1B_Pos)
#define ATIM3MODE23_CCR1B_CCR1B ATIM3MODE23_CCR1B_CCR1B_Msk

// ATIM3MODE23_CCR2A
#define ATIM3MODE23_CCR2A_CCR2A_Pos (0U)
#define ATIM3MODE23_CCR2A_CCR2A_Msk (0xFFFFUL << ATIM3MODE23_CCR2A_CCR2A_Pos)
#define ATIM3MODE23_CCR2A_CCR2A ATIM3MODE23_CCR2A_CCR2A_Msk

// ATIM3MODE23_CCR2B
#define ATIM3MODE23_CCR2B_CCR2B_Pos (0U)
#define ATIM3MODE23_CCR2B_CCR2B_Msk (0xFFFFUL << ATIM3MODE23_CCR2B_CCR2B_Pos)
#define ATIM3MODE23_CCR2B_CCR2B ATIM3MODE23_CCR2B_CCR2B_Msk

// ATIM3MODE23_CCR3A
#define ATIM3MODE23_CCR3A_CCR3A_Pos (0U)
#define ATIM3MODE23_CCR3A_CCR3A_Msk (0xFFFFUL << ATIM3MODE23_CCR3A_CCR3A_Pos)
#define ATIM3MODE23_CCR3A_CCR3A ATIM3MODE23_CCR3A_CCR3A_Msk

// ATIM3MODE23_CRCH3A
#define ATIM3MODE23_CRCH3A_BUF_Pos (0U)
#define ATIM3MODE23_CRCH3A_BUF_Msk (0x1UL << ATIM3MODE23_CRCH3A_BUF_Pos)
#define ATIM3MODE23_CRCH3A_BUF ATIM3MODE23_CRCH3A_BUF_Msk
#define ATIM3MODE23_CRCH3A_CI_Pos (1U)
#define ATIM3MODE23_CRCH3A_CI_Msk (0x1UL << ATIM3MODE23_CRCH3A_CI_Pos)
#define ATIM3MODE23_CRCH3A_CI ATIM3MODE23_CRCH3A_CI_Msk
#define ATIM3MODE23_CRCH3A_CD_Pos (2U)
#define ATIM3MODE23_CRCH3A_CD_Msk (0x1UL << ATIM3MODE23_CRCH3A_CD_Pos)
#define ATIM3MODE23_CRCH3A_CD ATIM3MODE23_CRCH3A_CD_Msk
#define ATIM3MODE23_CRCH3A_CIS_Pos (3U)
#define ATIM3MODE23_CRCH3A_CIS_Msk (0x3UL << ATIM3MODE23_CRCH3A_CIS_Pos)
#define ATIM3MODE23_CRCH3A_CIS ATIM3MODE23_CRCH3A_CIS_Msk
#define ATIM3MODE23_CRCH3A_C3AEN_Pos (5U)
#define ATIM3MODE23_CRCH3A_C3AEN_Msk (0x1UL << ATIM3MODE23_CRCH3A_C3AEN_Pos)
#define ATIM3MODE23_CRCH3A_C3AEN ATIM3MODE23_CRCH3A_C3AEN_Msk

