sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ATIM3MODE23_CCR3B
#define ATIM3MODE23_CCR3B_CCR3B_Pos (0U)
#define ATIM3MODE23_CCR3B_CCR3B_Msk (0xFFFFUL << ATIM3MODE23_CCR3B_CCR3B_Pos)
#define ATIM3MODE23_CCR3B_CCR3B ATIM3MODE23_CCR3B_CCR3B_Msk

// ATIM3MODE23_CRCH3B
#define ATIM3MODE23_CRCH3B_BUF_Pos (0U)
#define ATIM3MODE23_CRCH3B_BUF_Msk (0x1UL << ATIM3MODE23_CRCH3B_BUF_Pos)
#define ATIM3MODE23_CRCH3B_BUF ATIM3MODE23_CRCH3B_BUF_Msk
#define ATIM3MODE23_CRCH3B_CI_Pos (1U)
#define ATIM3MODE23_CRCH3B_CI_Msk (0x1UL << ATIM3MODE23_CRCH3B_CI_Pos)
#define ATIM3MODE23_CRCH3B_CI ATIM3MODE23_CRCH3B_CI_Msk
#define ATIM3MODE23_CRCH3B_CD_Pos (2U)
#define ATIM3MODE23_CRCH3B_CD_Msk (0x1UL << ATIM3MODE23_CRCH3B_CD_Pos)
#define ATIM3MODE23_CRCH3B_CD ATIM3MODE23_CRCH3B_CD_Msk
#define ATIM3MODE23_CRCH3B_CIS_Pos (3U)
#define ATIM3MODE23_CRCH3B_CIS_Msk (0x3UL << ATIM3MODE23_CRCH3B_CIS_Pos)
#define ATIM3MODE23_CRCH3B_CIS ATIM3MODE23_CRCH3B_CIS_Msk
#define ATIM3MODE23_CRCH3B_C3BEN_Pos (5U)
#define ATIM3MODE23_CRCH3B_C3BEN_Msk (0x1UL << ATIM3MODE23_CRCH3B_C3BEN_Pos)
#define ATIM3MODE23_CRCH3B_C3BEN ATIM3MODE23_CRCH3B_C3BEN_Msk

//********************    Bits Define For Peripheral ATIMMODE0    ********************//
// ATIMMODE0_ARR
#define ATIMMODE0_ARR_ARR_Pos (0U)
#define ATIMMODE0_ARR_ARR_Msk (0xFFFFUL << ATIMMODE0_ARR_ARR_Pos)
#define ATIMMODE0_ARR_ARR ATIMMODE0_ARR_ARR_Msk

// ATIMMODE0_CNT
#define ATIMMODE0_CNT_CNT_Pos (0U)
#define ATIMMODE0_CNT_CNT_Msk (0xFFFFUL << ATIMMODE0_CNT_CNT_Pos)
#define ATIMMODE0_CNT_CNT ATIMMODE0_CNT_CNT_Msk

// ATIMMODE0_CNT32
#define ATIMMODE0_CNT32_CNT32_Pos (0U)
#define ATIMMODE0_CNT32_CNT32_Msk (0xFFFFFFFFUL << ATIMMODE0_CNT32_CNT32_Pos)
#define ATIMMODE0_CNT32_CNT32 ATIMMODE0_CNT32_CNT32_Msk

// ATIMMODE0_M0CR
#define ATIMMODE0_M0CR_CTEN_Pos (0U)
#define ATIMMODE0_M0CR_CTEN_Msk (0x1UL << ATIMMODE0_M0CR_CTEN_Pos)
#define ATIMMODE0_M0CR_CTEN ATIMMODE0_M0CR_CTEN_Msk
#define ATIMMODE0_M0CR_MD_Pos (1U)
#define ATIMMODE0_M0CR_MD_Msk (0x1UL << ATIMMODE0_M0CR_MD_Pos)
#define ATIMMODE0_M0CR_MD ATIMMODE0_M0CR_MD_Msk
#define ATIMMODE0_M0CR_CT_Pos (2U)
#define ATIMMODE0_M0CR_CT_Msk (0x1UL << ATIMMODE0_M0CR_CT_Pos)
#define ATIMMODE0_M0CR_CT ATIMMODE0_M0CR_CT_Msk
#define ATIMMODE0_M0CR_TOGEN_Pos (3U)
#define ATIMMODE0_M0CR_TOGEN_Msk (0x1UL << ATIMMODE0_M0CR_TOGEN_Pos)
#define ATIMMODE0_M0CR_TOGEN ATIMMODE0_M0CR_TOGEN_Msk
#define ATIMMODE0_M0CR_PRS_Pos (4U)
#define ATIMMODE0_M0CR_PRS_Msk (0x7UL << ATIMMODE0_M0CR_PRS_Pos)
#define ATIMMODE0_M0CR_PRS ATIMMODE0_M0CR_PRS_Msk
#define ATIMMODE0_M0CR_GATE_Pos (8U)
#define ATIMMODE0_M0CR_GATE_Msk (0x1UL << ATIMMODE0_M0CR_GATE_Pos)
#define ATIMMODE0_M0CR_GATE ATIMMODE0_M0CR_GATE_Msk
#define ATIMMODE0_M0CR_GATEP_Pos (9U)
#define ATIMMODE0_M0CR_GATEP_Msk (0x1UL << ATIMMODE0_M0CR_GATEP_Pos)
#define ATIMMODE0_M0CR_GATEP ATIMMODE0_M0CR_GATEP_Msk
#define ATIMMODE0_M0CR_UIE_Pos (10U)
#define ATIMMODE0_M0CR_UIE_Msk (0x1UL << ATIMMODE0_M0CR_UIE_Pos)
#define ATIMMODE0_M0CR_UIE ATIMMODE0_M0CR_UIE_Msk
#define ATIMMODE0_M0CR_MODE_Pos (12U)
#define ATIMMODE0_M0CR_MODE_Msk (0x3UL << ATIMMODE0_M0CR_MODE_Pos)
#define ATIMMODE0_M0CR_MODE ATIMMODE0_M0CR_MODE_Msk

// ATIMMODE0_IFR
#define ATIMMODE0_IFR_UI_Pos (0U)
#define ATIMMODE0_IFR_UI_Msk (0x1UL << ATIMMODE0_IFR_UI_Pos)
#define ATIMMODE0_IFR_UI ATIMMODE0_IFR_UI_Msk

// ATIMMODE0_ICLR
#define ATIMMODE0_ICLR_UI_Pos (0U)
#define ATIMMODE0_ICLR_UI_Msk (0x1UL << ATIMMODE0_ICLR_UI_Pos)
#define ATIMMODE0_ICLR_UI ATIMMODE0_ICLR_UI_Msk

// ATIMMODE0_DTR
#define ATIMMODE0_DTR_MOE_Pos (12U)
#define ATIMMODE0_DTR_MOE_Msk (0x1UL << ATIMMODE0_DTR_MOE_Pos)
#define ATIMMODE0_DTR_MOE ATIMMODE0_DTR_MOE_Msk

//********************    Bits Define For Peripheral ATIMMODE1    ********************//
// ATIMMODE1_CNT
#define ATIMMODE1_CNT_CNT_Pos (0U)
#define ATIMMODE1_CNT_CNT_Msk (0xFFFFUL << ATIMMODE1_CNT_CNT_Pos)
#define ATIMMODE1_CNT_CNT ATIMMODE1_CNT_CNT_Msk

// ATIMMODE1_M1CR
#define ATIMMODE1_M1CR_CTEN_Pos (0U)
#define ATIMMODE1_M1CR_CTEN_Msk (0x1UL << ATIMMODE1_M1CR_CTEN_Pos)
#define ATIMMODE1_M1CR_CTEN ATIMMODE1_M1CR_CTEN_Msk
#define ATIMMODE1_M1CR_CT_Pos (2U)
#define ATIMMODE1_M1CR_CT_Msk (0x1UL << ATIMMODE1_M1CR_CT_Pos)
#define ATIMMODE1_M1CR_CT ATIMMODE1_M1CR_CT_Msk
#define ATIMMODE1_M1CR_PRS_Pos (4U)
#define ATIMMODE1_M1CR_PRS_Msk (0x7UL << ATIMMODE1_M1CR_PRS_Pos)
#define ATIMMODE1_M1CR_PRS ATIMMODE1_M1CR_PRS_Msk
#define ATIMMODE1_M1CR_EDG1ST_Pos (8U)
#define ATIMMODE1_M1CR_EDG1ST_Msk (0x1UL << ATIMMODE1_M1CR_EDG1ST_Pos)
#define ATIMMODE1_M1CR_EDG1ST ATIMMODE1_M1CR_EDG1ST_Msk
#define ATIMMODE1_M1CR_EDG2ND_Pos (9U)
#define ATIMMODE1_M1CR_EDG2ND_Msk (0x1UL << ATIMMODE1_M1CR_EDG2ND_Pos)
#define ATIMMODE1_M1CR_EDG2ND ATIMMODE1_M1CR_EDG2ND_Msk
#define ATIMMODE1_M1CR_UIE_Pos (10U)
#define ATIMMODE1_M1CR_UIE_Msk (0x1UL << ATIMMODE1_M1CR_UIE_Pos)
#define ATIMMODE1_M1CR_UIE ATIMMODE1_M1CR_UIE_Msk
#define ATIMMODE1_M1CR_MODE_Pos (12U)
#define ATIMMODE1_M1CR_MODE_Msk (0x3UL << ATIMMODE1_M1CR_MODE_Pos)
#define ATIMMODE1_M1CR_MODE ATIMMODE1_M1CR_MODE_Msk
#define ATIMMODE1_M1CR_ONESHOT_Pos (14U)
#define ATIMMODE1_M1CR_ONESHOT_Msk (0x1UL << ATIMMODE1_M1CR_ONESHOT_Pos)
#define ATIMMODE1_M1CR_ONESHOT ATIMMODE1_M1CR_ONESHOT_Msk

// ATIMMODE1_IFR
#define ATIMMODE1_IFR_UI_Pos (0U)
#define ATIMMODE1_IFR_UI_Msk (0x1UL << ATIMMODE1_IFR_UI_Pos)
#define ATIMMODE1_IFR_UI ATIMMODE1_IFR_UI_Msk
#define ATIMMODE1_IFR_PWC_Pos (2U)
#define ATIMMODE1_IFR_PWC_Msk (0x1UL << ATIMMODE1_IFR_PWC_Pos)
#define ATIMMODE1_IFR_PWC ATIMMODE1_IFR_PWC_Msk

// ATIMMODE1_ICLR
#define ATIMMODE1_ICLR_UI_Pos (0U)
#define ATIMMODE1_ICLR_UI_Msk (0x1UL << ATIMMODE1_ICLR_UI_Pos)
#define ATIMMODE1_ICLR_UI ATIMMODE1_ICLR_UI_Msk
#define ATIMMODE1_ICLR_PWC_Pos (2U)
#define ATIMMODE1_ICLR_PWC_Msk (0x1UL << ATIMMODE1_ICLR_PWC_Pos)
#define ATIMMODE1_ICLR_PWC ATIMMODE1_ICLR_PWC_Msk

// ATIMMODE1_MSCR
#define ATIMMODE1_MSCR_TS_Pos (5U)
#define ATIMMODE1_MSCR_TS_Msk (0x7UL << ATIMMODE1_MSCR_TS_Pos)
#define ATIMMODE1_MSCR_TS ATIMMODE1_MSCR_TS_Msk
#define ATIMMODE1_MSCR_IA0S_Pos (11U)
#define ATIMMODE1_MSCR_IA0S_Msk (0x1UL << ATIMMODE1_MSCR_IA0S_Pos)
#define ATIMMODE1_MSCR_IA0S ATIMMODE1_MSCR_IA0S_Msk
#define ATIMMODE1_MSCR_IB0S_Pos (12U)
#define ATIMMODE1_MSCR_IB0S_Msk (0x1UL << ATIMMODE1_MSCR_IB0S_Pos)
#define ATIMMODE1_MSCR_IB0S ATIMMODE1_MSCR_IB0S_Msk

// ATIMMODE1_FLTR
#define ATIMMODE1_FLTR_FLTA0_Pos (0U)
#define ATIMMODE1_FLTR_FLTA0_Msk (0x7UL << ATIMMODE1_FLTR_FLTA0_Pos)
#define ATIMMODE1_FLTR_FLTA0 ATIMMODE1_FLTR_FLTA0_Msk
#define ATIMMODE1_FLTR_FLTB0_Pos (4U)
#define ATIMMODE1_FLTR_FLTB0_Msk (0x7UL << ATIMMODE1_FLTR_FLTB0_Pos)
#define ATIMMODE1_FLTR_FLTB0 ATIMMODE1_FLTR_FLTB0_Msk
#define ATIMMODE1_FLTR_FLTET_Pos (28U)
#define ATIMMODE1_FLTR_FLTET_Msk (0x7UL << ATIMMODE1_FLTR_FLTET_Pos)
#define ATIMMODE1_FLTR_FLTET ATIMMODE1_FLTR_FLTET_Msk
#define ATIMMODE1_FLTR_ETP_Pos (31U)
#define ATIMMODE1_FLTR_ETP_Msk (0x1UL << ATIMMODE1_FLTR_ETP_Pos)
#define ATIMMODE1_FLTR_ETP ATIMMODE1_FLTR_ETP_Msk

// ATIMMODE1_CR0
#define ATIMMODE1_CR0_CSA_Pos (4U)
#define ATIMMODE1_CR0_CSA_Msk (0x1UL << ATIMMODE1_CR0_CSA_Pos)
#define ATIMMODE1_CR0_CSA ATIMMODE1_CR0_CSA_Msk
#define ATIMMODE1_CR0_CSB_Pos (5U)
#define ATIMMODE1_CR0_CSB_Msk (0x1UL << ATIMMODE1_CR0_CSB_Pos)
#define ATIMMODE1_CR0_CSB ATIMMODE1_CR0_CSB_Msk
#define ATIMMODE1_CR0_CIEA_Pos (8U)
#define ATIMMODE1_CR0_CIEA_Msk (0x1UL << ATIMMODE1_CR0_CIEA_Pos)
#define ATIMMODE1_CR0_CIEA ATIMMODE1_CR0_CIEA_Msk

// ATIMMODE1_CCR0A
#define ATIMMODE1_CCR0A_CCR0A_Pos (0U)
#define ATIMMODE1_CCR0A_CCR0A_Msk (0xFFFFUL << ATIMMODE1_CCR0A_CCR0A_Pos)
#define ATIMMODE1_CCR0A_CCR0A ATIMMODE1_CCR0A_CCR0A_Msk

//********************    Bits Define For Peripheral ATIMMODE23    ********************//
// ATIMMODE23_ARR
#define ATIMMODE23_ARR_ARR_Pos (0U)
#define ATIMMODE23_ARR_ARR_Msk (0xFFFFUL << ATIMMODE23_ARR_ARR_Pos)
#define ATIMMODE23_ARR_ARR ATIMMODE23_ARR_ARR_Msk

// ATIMMODE23_CNT
#define ATIMMODE23_CNT_CNT_Pos (0U)
#define ATIMMODE23_CNT_CNT_Msk (0xFFFFUL << ATIMMODE23_CNT_CNT_Pos)
#define ATIMMODE23_CNT_CNT ATIMMODE23_CNT_CNT_Msk

