sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ATIMMODE23_M23CR
#define ATIMMODE23_M23CR_CTEN_Pos (0U)
#define ATIMMODE23_M23CR_CTEN_Msk (0x1UL << ATIMMODE23_M23CR_CTEN_Pos)
#define ATIMMODE23_M23CR_CTEN ATIMMODE23_M23CR_CTEN_Msk
#define ATIMMODE23_M23CR_COMP_Pos (1U)
#define ATIMMODE23_M23CR_COMP_Msk (0x1UL << ATIMMODE23_M23CR_COMP_Pos)
#define ATIMMODE23_M23CR_COMP ATIMMODE23_M23CR_COMP_Msk
#define ATIMMODE23_M23CR_CT_Pos (2U)
#define ATIMMODE23_M23CR_CT_Msk (0x1UL << ATIMMODE23_M23CR_CT_Pos)
#define ATIMMODE23_M23CR_CT ATIMMODE23_M23CR_CT_Msk
#define ATIMMODE23_M23CR_PWM2S_Pos (3U)
#define ATIMMODE23_M23CR_PWM2S_Msk (0x1UL << ATIMMODE23_M23CR_PWM2S_Pos)
#define ATIMMODE23_M23CR_PWM2S ATIMMODE23_M23CR_PWM2S_Msk
#define ATIMMODE23_M23CR_PRS_Pos (4U)
#define ATIMMODE23_M23CR_PRS_Msk (0x7UL << ATIMMODE23_M23CR_PRS_Pos)
#define ATIMMODE23_M23CR_PRS ATIMMODE23_M23CR_PRS_Msk
#define ATIMMODE23_M23CR_BUFPEN_Pos (7U)
#define ATIMMODE23_M23CR_BUFPEN_Msk (0x1UL << ATIMMODE23_M23CR_BUFPEN_Pos)
#define ATIMMODE23_M23CR_BUFPEN ATIMMODE23_M23CR_BUFPEN_Msk
#define ATIMMODE23_M23CR_CRG_Pos (8U)
#define ATIMMODE23_M23CR_CRG_Msk (0x1UL << ATIMMODE23_M23CR_CRG_Pos)
#define ATIMMODE23_M23CR_CRG ATIMMODE23_M23CR_CRG_Msk
#define ATIMMODE23_M23CR_CFG_Pos (9U)
#define ATIMMODE23_M23CR_CFG_Msk (0x1UL << ATIMMODE23_M23CR_CFG_Pos)
#define ATIMMODE23_M23CR_CFG ATIMMODE23_M23CR_CFG_Msk
#define ATIMMODE23_M23CR_UIE_Pos (10U)
#define ATIMMODE23_M23CR_UIE_Msk (0x1UL << ATIMMODE23_M23CR_UIE_Pos)
#define ATIMMODE23_M23CR_UIE ATIMMODE23_M23CR_UIE_Msk
#define ATIMMODE23_M23CR_UDE_Pos (11U)
#define ATIMMODE23_M23CR_UDE_Msk (0x1UL << ATIMMODE23_M23CR_UDE_Pos)
#define ATIMMODE23_M23CR_UDE ATIMMODE23_M23CR_UDE_Msk
#define ATIMMODE23_M23CR_MODE_Pos (12U)
#define ATIMMODE23_M23CR_MODE_Msk (0x3UL << ATIMMODE23_M23CR_MODE_Pos)
#define ATIMMODE23_M23CR_MODE ATIMMODE23_M23CR_MODE_Msk
#define ATIMMODE23_M23CR_ONESHOT_Pos (14U)
#define ATIMMODE23_M23CR_ONESHOT_Msk (0x1UL << ATIMMODE23_M23CR_ONESHOT_Pos)
#define ATIMMODE23_M23CR_ONESHOT ATIMMODE23_M23CR_ONESHOT_Msk
#define ATIMMODE23_M23CR_CSG_Pos (15U)
#define ATIMMODE23_M23CR_CSG_Msk (0x1UL << ATIMMODE23_M23CR_CSG_Pos)
#define ATIMMODE23_M23CR_CSG ATIMMODE23_M23CR_CSG_Msk
#define ATIMMODE23_M23CR_OCCS_Pos (16U)
#define ATIMMODE23_M23CR_OCCS_Msk (0x1UL << ATIMMODE23_M23CR_OCCS_Pos)
#define ATIMMODE23_M23CR_OCCS ATIMMODE23_M23CR_OCCS_Msk
#define ATIMMODE23_M23CR_URS_Pos (17U)
#define ATIMMODE23_M23CR_URS_Msk (0x1UL << ATIMMODE23_M23CR_URS_Pos)
#define ATIMMODE23_M23CR_URS ATIMMODE23_M23CR_URS_Msk
#define ATIMMODE23_M23CR_TDE_Pos (18U)
#define ATIMMODE23_M23CR_TDE_Msk (0x1UL << ATIMMODE23_M23CR_TDE_Pos)
#define ATIMMODE23_M23CR_TDE ATIMMODE23_M23CR_TDE_Msk
#define ATIMMODE23_M23CR_TIE_Pos (19U)
#define ATIMMODE23_M23CR_TIE_Msk (0x1UL << ATIMMODE23_M23CR_TIE_Pos)
#define ATIMMODE23_M23CR_TIE ATIMMODE23_M23CR_TIE_Msk
#define ATIMMODE23_M23CR_BIE_Pos (20U)
#define ATIMMODE23_M23CR_BIE_Msk (0x1UL << ATIMMODE23_M23CR_BIE_Pos)
#define ATIMMODE23_M23CR_BIE ATIMMODE23_M23CR_BIE_Msk
#define ATIMMODE23_M23CR_CIS_Pos (21U)
#define ATIMMODE23_M23CR_CIS_Msk (0x3UL << ATIMMODE23_M23CR_CIS_Pos)
#define ATIMMODE23_M23CR_CIS ATIMMODE23_M23CR_CIS_Msk
#define ATIMMODE23_M23CR_OCCE_Pos (23U)
#define ATIMMODE23_M23CR_OCCE_Msk (0x1UL << ATIMMODE23_M23CR_OCCE_Pos)
#define ATIMMODE23_M23CR_OCCE ATIMMODE23_M23CR_OCCE_Msk
#define ATIMMODE23_M23CR_TG_Pos (24U)
#define ATIMMODE23_M23CR_TG_Msk (0x1UL << ATIMMODE23_M23CR_TG_Pos)
#define ATIMMODE23_M23CR_TG ATIMMODE23_M23CR_TG_Msk
#define ATIMMODE23_M23CR_UG_Pos (25U)
#define ATIMMODE23_M23CR_UG_Msk (0x1UL << ATIMMODE23_M23CR_UG_Pos)
#define ATIMMODE23_M23CR_UG ATIMMODE23_M23CR_UG_Msk
#define ATIMMODE23_M23CR_BG_Pos (26U)
#define ATIMMODE23_M23CR_BG_Msk (0x1UL << ATIMMODE23_M23CR_BG_Pos)
#define ATIMMODE23_M23CR_BG ATIMMODE23_M23CR_BG_Msk
#define ATIMMODE23_M23CR_DIR_Pos (27U)
#define ATIMMODE23_M23CR_DIR_Msk (0x1UL << ATIMMODE23_M23CR_DIR_Pos)
#define ATIMMODE23_M23CR_DIR ATIMMODE23_M23CR_DIR_Msk
#define ATIMMODE23_M23CR_OVE_Pos (28U)
#define ATIMMODE23_M23CR_OVE_Msk (0x1UL << ATIMMODE23_M23CR_OVE_Pos)
#define ATIMMODE23_M23CR_OVE ATIMMODE23_M23CR_OVE_Msk
#define ATIMMODE23_M23CR_UNDE_Pos (29U)
#define ATIMMODE23_M23CR_UNDE_Msk (0x1UL << ATIMMODE23_M23CR_UNDE_Pos)
#define ATIMMODE23_M23CR_UNDE ATIMMODE23_M23CR_UNDE_Msk

// ATIMMODE23_IFR
#define ATIMMODE23_IFR_UI_Pos (0U)
#define ATIMMODE23_IFR_UI_Msk (0x1UL << ATIMMODE23_IFR_UI_Pos)
#define ATIMMODE23_IFR_UI ATIMMODE23_IFR_UI_Msk
#define ATIMMODE23_IFR_CA0_Pos (2U)
#define ATIMMODE23_IFR_CA0_Msk (0x1UL << ATIMMODE23_IFR_CA0_Pos)
#define ATIMMODE23_IFR_CA0 ATIMMODE23_IFR_CA0_Msk
#define ATIMMODE23_IFR_CB0_Pos (5U)
#define ATIMMODE23_IFR_CB0_Msk (0x1UL << ATIMMODE23_IFR_CB0_Pos)
#define ATIMMODE23_IFR_CB0 ATIMMODE23_IFR_CB0_Msk
#define ATIMMODE23_IFR_CA0E_Pos (8U)
#define ATIMMODE23_IFR_CA0E_Msk (0x1UL << ATIMMODE23_IFR_CA0E_Pos)
#define ATIMMODE23_IFR_CA0E ATIMMODE23_IFR_CA0E_Msk
#define ATIMMODE23_IFR_CB0E_Pos (11U)
#define ATIMMODE23_IFR_CB0E_Msk (0x1UL << ATIMMODE23_IFR_CB0E_Pos)
#define ATIMMODE23_IFR_CB0E ATIMMODE23_IFR_CB0E_Msk
#define ATIMMODE23_IFR_BI_Pos (14U)
#define ATIMMODE23_IFR_BI_Msk (0x1UL << ATIMMODE23_IFR_BI_Pos)
#define ATIMMODE23_IFR_BI ATIMMODE23_IFR_BI_Msk
#define ATIMMODE23_IFR_TI_Pos (15U)
#define ATIMMODE23_IFR_TI_Msk (0x1UL << ATIMMODE23_IFR_TI_Pos)
#define ATIMMODE23_IFR_TI ATIMMODE23_IFR_TI_Msk
#define ATIMMODE23_IFR_OV_Pos (16U)
#define ATIMMODE23_IFR_OV_Msk (0x1UL << ATIMMODE23_IFR_OV_Pos)
#define ATIMMODE23_IFR_OV ATIMMODE23_IFR_OV_Msk
#define ATIMMODE23_IFR_UND_Pos (17U)
#define ATIMMODE23_IFR_UND_Msk (0x1UL << ATIMMODE23_IFR_UND_Pos)
#define ATIMMODE23_IFR_UND ATIMMODE23_IFR_UND_Msk

// ATIMMODE23_ICLR
#define ATIMMODE23_ICLR_UI_Pos (0U)
#define ATIMMODE23_ICLR_UI_Msk (0x1UL << ATIMMODE23_ICLR_UI_Pos)
#define ATIMMODE23_ICLR_UI ATIMMODE23_ICLR_UI_Msk
#define ATIMMODE23_ICLR_CA0_Pos (2U)
#define ATIMMODE23_ICLR_CA0_Msk (0x1UL << ATIMMODE23_ICLR_CA0_Pos)
#define ATIMMODE23_ICLR_CA0 ATIMMODE23_ICLR_CA0_Msk
#define ATIMMODE23_ICLR_CB0_Pos (5U)
#define ATIMMODE23_ICLR_CB0_Msk (0x1UL << ATIMMODE23_ICLR_CB0_Pos)
#define ATIMMODE23_ICLR_CB0 ATIMMODE23_ICLR_CB0_Msk
#define ATIMMODE23_ICLR_CA0E_Pos (8U)
#define ATIMMODE23_ICLR_CA0E_Msk (0x1UL << ATIMMODE23_ICLR_CA0E_Pos)
#define ATIMMODE23_ICLR_CA0E ATIMMODE23_ICLR_CA0E_Msk
#define ATIMMODE23_ICLR_CB0E_Pos (11U)
#define ATIMMODE23_ICLR_CB0E_Msk (0x1UL << ATIMMODE23_ICLR_CB0E_Pos)
#define ATIMMODE23_ICLR_CB0E ATIMMODE23_ICLR_CB0E_Msk
#define ATIMMODE23_ICLR_BI_Pos (14U)
#define ATIMMODE23_ICLR_BI_Msk (0x1UL << ATIMMODE23_ICLR_BI_Pos)
#define ATIMMODE23_ICLR_BI ATIMMODE23_ICLR_BI_Msk
#define ATIMMODE23_ICLR_TI_Pos (15U)
#define ATIMMODE23_ICLR_TI_Msk (0x1UL << ATIMMODE23_ICLR_TI_Pos)
#define ATIMMODE23_ICLR_TI ATIMMODE23_ICLR_TI_Msk
#define ATIMMODE23_ICLR_OV_Pos (16U)
#define ATIMMODE23_ICLR_OV_Msk (0x1UL << ATIMMODE23_ICLR_OV_Pos)
#define ATIMMODE23_ICLR_OV ATIMMODE23_ICLR_OV_Msk
#define ATIMMODE23_ICLR_UND_Pos (17U)
#define ATIMMODE23_ICLR_UND_Msk (0x1UL << ATIMMODE23_ICLR_UND_Pos)
#define ATIMMODE23_ICLR_UND ATIMMODE23_ICLR_UND_Msk

// ATIMMODE23_MSCR
#define ATIMMODE23_MSCR_MMS_Pos (0U)
#define ATIMMODE23_MSCR_MMS_Msk (0x7UL << ATIMMODE23_MSCR_MMS_Pos)
#define ATIMMODE23_MSCR_MMS ATIMMODE23_MSCR_MMS_Msk
#define ATIMMODE23_MSCR_CCDS_Pos (3U)
#define ATIMMODE23_MSCR_CCDS_Msk (0x1UL << ATIMMODE23_MSCR_CCDS_Pos)
#define ATIMMODE23_MSCR_CCDS ATIMMODE23_MSCR_CCDS_Msk
#define ATIMMODE23_MSCR_MSM_Pos (4U)
#define ATIMMODE23_MSCR_MSM_Msk (0x1UL << ATIMMODE23_MSCR_MSM_Pos)
#define ATIMMODE23_MSCR_MSM ATIMMODE23_MSCR_MSM_Msk
#define ATIMMODE23_MSCR_TS_Pos (5U)
#define ATIMMODE23_MSCR_TS_Msk (0x7UL << ATIMMODE23_MSCR_TS_Pos)
#define ATIMMODE23_MSCR_TS ATIMMODE23_MSCR_TS_Msk
#define ATIMMODE23_MSCR_SMS_Pos (8U)
#define ATIMMODE23_MSCR_SMS_Msk (0x7UL << ATIMMODE23_MSCR_SMS_Pos)
#define ATIMMODE23_MSCR_SMS ATIMMODE23_MSCR_SMS_Msk
#define ATIMMODE23_MSCR_IA0S_Pos (11U)
#define ATIMMODE23_MSCR_IA0S_Msk (0x1UL << ATIMMODE23_MSCR_IA0S_Pos)
#define ATIMMODE23_MSCR_IA0S ATIMMODE23_MSCR_IA0S_Msk
#define ATIMMODE23_MSCR_IB0S_Pos (12U)
#define ATIMMODE23_MSCR_IB0S_Msk (0x1UL << ATIMMODE23_MSCR_IB0S_Pos)
#define ATIMMODE23_MSCR_IB0S ATIMMODE23_MSCR_IB0S_Msk

// ATIMMODE23_FLTR
#define ATIMMODE23_FLTR_OCMA0FLTA0_Pos (0U)
#define ATIMMODE23_FLTR_OCMA0FLTA0_Msk (0x7UL << ATIMMODE23_FLTR_OCMA0FLTA0_Pos)
#define ATIMMODE23_FLTR_OCMA0FLTA0 ATIMMODE23_FLTR_OCMA0FLTA0_Msk
#define ATIMMODE23_FLTR_CCPA0_Pos (3U)
#define ATIMMODE23_FLTR_CCPA0_Msk (0x1UL << ATIMMODE23_FLTR_CCPA0_Pos)
#define ATIMMODE23_FLTR_CCPA0 ATIMMODE23_FLTR_CCPA0_Msk
#define ATIMMODE23_FLTR_OCMB0FLTB0_Pos (4U)
#define ATIMMODE23_FLTR_OCMB0FLTB0_Msk (0x7UL << ATIMMODE23_FLTR_OCMB0FLTB0_Pos)
#define ATIMMODE23_FLTR_OCMB0FLTB0 ATIMMODE23_FLTR_OCMB0FLTB0_Msk
#define ATIMMODE23_FLTR_CCPB0_Pos (7U)
#define ATIMMODE23_FLTR_CCPB0_Msk (0x1UL << ATIMMODE23_FLTR_CCPB0_Pos)
#define ATIMMODE23_FLTR_CCPB0 ATIMMODE23_FLTR_CCPB0_Msk
#define ATIMMODE23_FLTR_FLTBK_Pos (24U)
#define ATIMMODE23_FLTR_FLTBK_Msk (0x7UL << ATIMMODE23_FLTR_FLTBK_Pos)
#define ATIMMODE23_FLTR_FLTBK ATIMMODE23_FLTR_FLTBK_Msk
#define ATIMMODE23_FLTR_BKP_Pos (27U)
#define ATIMMODE23_FLTR_BKP_Msk (0x1UL << ATIMMODE23_FLTR_BKP_Pos)
#define ATIMMODE23_FLTR_BKP ATIMMODE23_FLTR_BKP_Msk
#define ATIMMODE23_FLTR_FLTET_Pos (28U)
#define ATIMMODE23_FLTR_FLTET_Msk (0x7UL << ATIMMODE23_FLTR_FLTET_Pos)
#define ATIMMODE23_FLTR_FLTET ATIMMODE23_FLTR_FLTET_Msk
#define ATIMMODE23_FLTR_ETP_Pos (31U)
#define ATIMMODE23_FLTR_ETP_Msk (0x1UL << ATIMMODE23_FLTR_ETP_Pos)
#define ATIMMODE23_FLTR_ETP ATIMMODE23_FLTR_ETP_Msk

