sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// ATIMMODE23_ADTR
#define ATIMMODE23_ADTR_UEVE_Pos (0U)
#define ATIMMODE23_ADTR_UEVE_Msk (0x1UL << ATIMMODE23_ADTR_UEVE_Pos)
#define ATIMMODE23_ADTR_UEVE ATIMMODE23_ADTR_UEVE_Msk
#define ATIMMODE23_ADTR_CMA0E_Pos (1U)
#define ATIMMODE23_ADTR_CMA0E_Msk (0x1UL << ATIMMODE23_ADTR_CMA0E_Pos)
#define ATIMMODE23_ADTR_CMA0E ATIMMODE23_ADTR_CMA0E_Msk
#define ATIMMODE23_ADTR_CMB0E_Pos (4U)
#define ATIMMODE23_ADTR_CMB0E_Msk (0x1UL << ATIMMODE23_ADTR_CMB0E_Pos)
#define ATIMMODE23_ADTR_CMB0E ATIMMODE23_ADTR_CMB0E_Msk
#define ATIMMODE23_ADTR_ADTE_Pos (7U)
#define ATIMMODE23_ADTR_ADTE_Msk (0x1UL << ATIMMODE23_ADTR_ADTE_Pos)
#define ATIMMODE23_ADTR_ADTE ATIMMODE23_ADTR_ADTE_Msk

// ATIMMODE23_CRCH0
#define ATIMMODE23_CRCH0_CFACRABKSA_Pos (0U)
#define ATIMMODE23_CRCH0_CFACRABKSA_Msk (0x3UL << ATIMMODE23_CRCH0_CFACRABKSA_Pos)
#define ATIMMODE23_CRCH0_CFACRABKSA ATIMMODE23_CRCH0_CFACRABKSA_Msk
#define ATIMMODE23_CRCH0_CFBCRBBKSB_Pos (2U)
#define ATIMMODE23_CRCH0_CFBCRBBKSB_Msk (0x3UL << ATIMMODE23_CRCH0_CFBCRBBKSB_Pos)
#define ATIMMODE23_CRCH0_CFBCRBBKSB ATIMMODE23_CRCH0_CFBCRBBKSB_Msk
#define ATIMMODE23_CRCH0_CSA_Pos (4U)
#define ATIMMODE23_CRCH0_CSA_Msk (0x1UL << ATIMMODE23_CRCH0_CSA_Pos)
#define ATIMMODE23_CRCH0_CSA ATIMMODE23_CRCH0_CSA_Msk
#define ATIMMODE23_CRCH0_CSB_Pos (5U)
#define ATIMMODE23_CRCH0_CSB_Msk (0x1UL << ATIMMODE23_CRCH0_CSB_Pos)
#define ATIMMODE23_CRCH0_CSB ATIMMODE23_CRCH0_CSB_Msk
#define ATIMMODE23_CRCH0_BUFEA_Pos (6U)
#define ATIMMODE23_CRCH0_BUFEA_Msk (0x1UL << ATIMMODE23_CRCH0_BUFEA_Pos)
#define ATIMMODE23_CRCH0_BUFEA ATIMMODE23_CRCH0_BUFEA_Msk
#define ATIMMODE23_CRCH0_BUFEB_Pos (7U)
#define ATIMMODE23_CRCH0_BUFEB_Msk (0x1UL << ATIMMODE23_CRCH0_BUFEB_Pos)
#define ATIMMODE23_CRCH0_BUFEB ATIMMODE23_CRCH0_BUFEB_Msk
#define ATIMMODE23_CRCH0_CIEA_Pos (8U)
#define ATIMMODE23_CRCH0_CIEA_Msk (0x1UL << ATIMMODE23_CRCH0_CIEA_Pos)
#define ATIMMODE23_CRCH0_CIEA ATIMMODE23_CRCH0_CIEA_Msk
#define ATIMMODE23_CRCH0_CIEB_Pos (9U)
#define ATIMMODE23_CRCH0_CIEB_Msk (0x1UL << ATIMMODE23_CRCH0_CIEB_Pos)
#define ATIMMODE23_CRCH0_CIEB ATIMMODE23_CRCH0_CIEB_Msk
#define ATIMMODE23_CRCH0_CDEA_Pos (10U)
#define ATIMMODE23_CRCH0_CDEA_Msk (0x1UL << ATIMMODE23_CRCH0_CDEA_Pos)
#define ATIMMODE23_CRCH0_CDEA ATIMMODE23_CRCH0_CDEA_Msk
#define ATIMMODE23_CRCH0_CDEB_Pos (11U)
#define ATIMMODE23_CRCH0_CDEB_Msk (0x1UL << ATIMMODE23_CRCH0_CDEB_Pos)
#define ATIMMODE23_CRCH0_CDEB ATIMMODE23_CRCH0_CDEB_Msk
#define ATIMMODE23_CRCH0_CISB_Pos (12U)
#define ATIMMODE23_CRCH0_CISB_Msk (0x3UL << ATIMMODE23_CRCH0_CISB_Pos)
#define ATIMMODE23_CRCH0_CISB ATIMMODE23_CRCH0_CISB_Msk
#define ATIMMODE23_CRCH0_CCGA_Pos (14U)
#define ATIMMODE23_CRCH0_CCGA_Msk (0x1UL << ATIMMODE23_CRCH0_CCGA_Pos)
#define ATIMMODE23_CRCH0_CCGA ATIMMODE23_CRCH0_CCGA_Msk
#define ATIMMODE23_CRCH0_CCGB_Pos (15U)
#define ATIMMODE23_CRCH0_CCGB_Msk (0x1UL << ATIMMODE23_CRCH0_CCGB_Pos)
#define ATIMMODE23_CRCH0_CCGB ATIMMODE23_CRCH0_CCGB_Msk

// ATIMMODE23_DTR
#define ATIMMODE23_DTR_DTR_Pos (0U)
#define ATIMMODE23_DTR_DTR_Msk (0xFFUL << ATIMMODE23_DTR_DTR_Pos)
#define ATIMMODE23_DTR_DTR ATIMMODE23_DTR_DTR_Msk
#define ATIMMODE23_DTR_BKSEL_Pos (8U)
#define ATIMMODE23_DTR_BKSEL_Msk (0x1UL << ATIMMODE23_DTR_BKSEL_Pos)
#define ATIMMODE23_DTR_BKSEL ATIMMODE23_DTR_BKSEL_Msk
#define ATIMMODE23_DTR_DTEN_Pos (9U)
#define ATIMMODE23_DTR_DTEN_Msk (0x1UL << ATIMMODE23_DTR_DTEN_Pos)
#define ATIMMODE23_DTR_DTEN ATIMMODE23_DTR_DTEN_Msk
#define ATIMMODE23_DTR_BKE_Pos (10U)
#define ATIMMODE23_DTR_BKE_Msk (0x1UL << ATIMMODE23_DTR_BKE_Pos)
#define ATIMMODE23_DTR_BKE ATIMMODE23_DTR_BKE_Msk
#define ATIMMODE23_DTR_AOE_Pos (11U)
#define ATIMMODE23_DTR_AOE_Msk (0x1UL << ATIMMODE23_DTR_AOE_Pos)
#define ATIMMODE23_DTR_AOE ATIMMODE23_DTR_AOE_Msk
#define ATIMMODE23_DTR_MOE_Pos (12U)
#define ATIMMODE23_DTR_MOE_Msk (0x1UL << ATIMMODE23_DTR_MOE_Pos)
#define ATIMMODE23_DTR_MOE ATIMMODE23_DTR_MOE_Msk
#define ATIMMODE23_DTR_SAFEEN_Pos (13U)
#define ATIMMODE23_DTR_SAFEEN_Msk (0x1UL << ATIMMODE23_DTR_SAFEEN_Pos)
#define ATIMMODE23_DTR_SAFEEN ATIMMODE23_DTR_SAFEEN_Msk
#define ATIMMODE23_DTR_VCE_Pos (14U)
#define ATIMMODE23_DTR_VCE_Msk (0x1UL << ATIMMODE23_DTR_VCE_Pos)
#define ATIMMODE23_DTR_VCE ATIMMODE23_DTR_VCE_Msk

// ATIMMODE23_RCR
#define ATIMMODE23_RCR_RCR_Pos (0U)
#define ATIMMODE23_RCR_RCR_Msk (0xFFUL << ATIMMODE23_RCR_RCR_Pos)
#define ATIMMODE23_RCR_RCR ATIMMODE23_RCR_RCR_Msk
#define ATIMMODE23_RCR_OV_Pos (8U)
#define ATIMMODE23_RCR_OV_Msk (0x1UL << ATIMMODE23_RCR_OV_Pos)
#define ATIMMODE23_RCR_OV ATIMMODE23_RCR_OV_Msk
#define ATIMMODE23_RCR_UD_Pos (9U)
#define ATIMMODE23_RCR_UD_Msk (0x1UL << ATIMMODE23_RCR_UD_Pos)
#define ATIMMODE23_RCR_UD ATIMMODE23_RCR_UD_Msk

// ATIMMODE23_CCR0A
#define ATIMMODE23_CCR0A_CCR0A_Pos (0U)
#define ATIMMODE23_CCR0A_CCR0A_Msk (0xFFFFUL << ATIMMODE23_CCR0A_CCR0A_Pos)
#define ATIMMODE23_CCR0A_CCR0A ATIMMODE23_CCR0A_CCR0A_Msk

// ATIMMODE23_CCR0B
#define ATIMMODE23_CCR0B_CCR0B_Pos (0U)
#define ATIMMODE23_CCR0B_CCR0B_Msk (0xFFFFUL << ATIMMODE23_CCR0B_CCR0B_Pos)
#define ATIMMODE23_CCR0B_CCR0B ATIMMODE23_CCR0B_CCR0B_Msk

//********************    Bits Define For Peripheral BTIM    ********************//
// BTIM_ARR
#define BTIM_ARR_ARR_Pos (0U)
#define BTIM_ARR_ARR_Msk (0xFFFFUL << BTIM_ARR_ARR_Pos)
#define BTIM_ARR_ARR BTIM_ARR_ARR_Msk

// BTIM_CNT
#define BTIM_CNT_CNT_Pos (0U)
#define BTIM_CNT_CNT_Msk (0xFFFFUL << BTIM_CNT_CNT_Pos)
#define BTIM_CNT_CNT BTIM_CNT_CNT_Msk

// BTIM_CR
#define BTIM_CR_CEN_Pos (0U)
#define BTIM_CR_CEN_Msk (0x1UL << BTIM_CR_CEN_Pos)
#define BTIM_CR_CEN BTIM_CR_CEN_Msk
#define BTIM_CR_MD_Pos (1U)
#define BTIM_CR_MD_Msk (0x3UL << BTIM_CR_MD_Pos)
#define BTIM_CR_MD BTIM_CR_MD_Msk
#define BTIM_CR_TOGEN_Pos (3U)
#define BTIM_CR_TOGEN_Msk (0x1UL << BTIM_CR_TOGEN_Pos)
#define BTIM_CR_TOGEN BTIM_CR_TOGEN_Msk
#define BTIM_CR_PRS_Pos (4U)
#define BTIM_CR_PRS_Msk (0xFUL << BTIM_CR_PRS_Pos)
#define BTIM_CR_PRS BTIM_CR_PRS_Msk
#define BTIM_CR_OST_Pos (8U)
#define BTIM_CR_OST_Msk (0x1UL << BTIM_CR_OST_Pos)
#define BTIM_CR_OST BTIM_CR_OST_Msk
#define BTIM_CR_TRS_Pos (9U)
#define BTIM_CR_TRS_Msk (0x3UL << BTIM_CR_TRS_Pos)
#define BTIM_CR_TRS BTIM_CR_TRS_Msk
#define BTIM_CR_ETP_Pos (11U)
#define BTIM_CR_ETP_Msk (0x1UL << BTIM_CR_ETP_Pos)
#define BTIM_CR_ETP BTIM_CR_ETP_Msk

