sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// BTIM_IER
#define BTIM_IER_UI_Pos (0U)
#define BTIM_IER_UI_Msk (0x1UL << BTIM_IER_UI_Pos)
#define BTIM_IER_UI BTIM_IER_UI_Msk
#define BTIM_IER_TI_Pos (1U)
#define BTIM_IER_TI_Msk (0x1UL << BTIM_IER_TI_Pos)
#define BTIM_IER_TI BTIM_IER_TI_Msk

// BTIM_IFR
#define BTIM_IFR_UI_Pos (0U)
#define BTIM_IFR_UI_Msk (0x1UL << BTIM_IFR_UI_Pos)
#define BTIM_IFR_UI BTIM_IFR_UI_Msk
#define BTIM_IFR_TI_Pos (1U)
#define BTIM_IFR_TI_Msk (0x1UL << BTIM_IFR_TI_Pos)
#define BTIM_IFR_TI BTIM_IFR_TI_Msk

// BTIM_ICR
#define BTIM_ICR_UI_Pos (0U)
#define BTIM_ICR_UI_Msk (0x1UL << BTIM_ICR_UI_Pos)
#define BTIM_ICR_UI BTIM_ICR_UI_Msk
#define BTIM_ICR_TI_Pos (1U)
#define BTIM_ICR_TI_Msk (0x1UL << BTIM_ICR_TI_Pos)
#define BTIM_ICR_TI BTIM_ICR_TI_Msk

// BTIM_AIFR
#define BTIM_AIFR_UI03_Pos (0U)
#define BTIM_AIFR_UI03_Msk (0x1UL << BTIM_AIFR_UI03_Pos)
#define BTIM_AIFR_UI03 BTIM_AIFR_UI03_Msk
#define BTIM_AIFR_TI03_Pos (1U)
#define BTIM_AIFR_TI03_Msk (0x1UL << BTIM_AIFR_TI03_Pos)
#define BTIM_AIFR_TI03 BTIM_AIFR_TI03_Msk
#define BTIM_AIFR_UI14_Pos (2U)
#define BTIM_AIFR_UI14_Msk (0x1UL << BTIM_AIFR_UI14_Pos)
#define BTIM_AIFR_UI14 BTIM_AIFR_UI14_Msk
#define BTIM_AIFR_TI14_Pos (3U)
#define BTIM_AIFR_TI14_Msk (0x1UL << BTIM_AIFR_TI14_Pos)
#define BTIM_AIFR_TI14 BTIM_AIFR_TI14_Msk
#define BTIM_AIFR_UI25_Pos (4U)
#define BTIM_AIFR_UI25_Msk (0x1UL << BTIM_AIFR_UI25_Pos)
#define BTIM_AIFR_UI25 BTIM_AIFR_UI25_Msk
#define BTIM_AIFR_TI25_Pos (5U)
#define BTIM_AIFR_TI25_Msk (0x1UL << BTIM_AIFR_TI25_Pos)
#define BTIM_AIFR_TI25 BTIM_AIFR_TI25_Msk

// BTIM_AICR
#define BTIM_AICR_UI03_Pos (0U)
#define BTIM_AICR_UI03_Msk (0x1UL << BTIM_AICR_UI03_Pos)
#define BTIM_AICR_UI03 BTIM_AICR_UI03_Msk
#define BTIM_AICR_TI03_Pos (1U)
#define BTIM_AICR_TI03_Msk (0x1UL << BTIM_AICR_TI03_Pos)
#define BTIM_AICR_TI03 BTIM_AICR_TI03_Msk
#define BTIM_AICR_UI14_Pos (2U)
#define BTIM_AICR_UI14_Msk (0x1UL << BTIM_AICR_UI14_Pos)
#define BTIM_AICR_UI14 BTIM_AICR_UI14_Msk
#define BTIM_AICR_TI14_Pos (3U)
#define BTIM_AICR_TI14_Msk (0x1UL << BTIM_AICR_TI14_Pos)
#define BTIM_AICR_TI14 BTIM_AICR_TI14_Msk
#define BTIM_AICR_UI25_Pos (4U)
#define BTIM_AICR_UI25_Msk (0x1UL << BTIM_AICR_UI25_Pos)
#define BTIM_AICR_UI25 BTIM_AICR_UI25_Msk
#define BTIM_AICR_TI25_Pos (5U)
#define BTIM_AICR_TI25_Msk (0x1UL << BTIM_AICR_TI25_Pos)
#define BTIM_AICR_TI25 BTIM_AICR_TI25_Msk

//********************    Bits Define For Peripheral CAN    ********************//
// CAN_CFG_STAT
#define CAN_CFG_STAT_BUSOFF_Pos (0U)
#define CAN_CFG_STAT_BUSOFF_Msk (0x1UL << CAN_CFG_STAT_BUSOFF_Pos)
#define CAN_CFG_STAT_BUSOFF CAN_CFG_STAT_BUSOFF_Msk
#define CAN_CFG_STAT_TACTIVE_Pos (1U)
#define CAN_CFG_STAT_TACTIVE_Msk (0x1UL << CAN_CFG_STAT_TACTIVE_Pos)
#define CAN_CFG_STAT_TACTIVE CAN_CFG_STAT_TACTIVE_Msk
#define CAN_CFG_STAT_RACTIVE_Pos (2U)
#define CAN_CFG_STAT_RACTIVE_Msk (0x1UL << CAN_CFG_STAT_RACTIVE_Pos)
#define CAN_CFG_STAT_RACTIVE CAN_CFG_STAT_RACTIVE_Msk
#define CAN_CFG_STAT_TSSS_Pos (3U)
#define CAN_CFG_STAT_TSSS_Msk (0x1UL << CAN_CFG_STAT_TSSS_Pos)
#define CAN_CFG_STAT_TSSS CAN_CFG_STAT_TSSS_Msk
#define CAN_CFG_STAT_TPSS_Pos (4U)
#define CAN_CFG_STAT_TPSS_Msk (0x1UL << CAN_CFG_STAT_TPSS_Pos)
#define CAN_CFG_STAT_TPSS CAN_CFG_STAT_TPSS_Msk
#define CAN_CFG_STAT_LBMI_Pos (5U)
#define CAN_CFG_STAT_LBMI_Msk (0x1UL << CAN_CFG_STAT_LBMI_Pos)
#define CAN_CFG_STAT_LBMI CAN_CFG_STAT_LBMI_Msk
#define CAN_CFG_STAT_LBME_Pos (6U)
#define CAN_CFG_STAT_LBME_Msk (0x1UL << CAN_CFG_STAT_LBME_Pos)
#define CAN_CFG_STAT_LBME CAN_CFG_STAT_LBME_Msk
#define CAN_CFG_STAT_RESET_Pos (7U)
#define CAN_CFG_STAT_RESET_Msk (0x1UL << CAN_CFG_STAT_RESET_Pos)
#define CAN_CFG_STAT_RESET CAN_CFG_STAT_RESET_Msk

// CAN_TCMD
#define CAN_TCMD_TSA_Pos (0U)
#define CAN_TCMD_TSA_Msk (0x1UL << CAN_TCMD_TSA_Pos)
#define CAN_TCMD_TSA CAN_TCMD_TSA_Msk
#define CAN_TCMD_TSALL_Pos (1U)
#define CAN_TCMD_TSALL_Msk (0x1UL << CAN_TCMD_TSALL_Pos)
#define CAN_TCMD_TSALL CAN_TCMD_TSALL_Msk
#define CAN_TCMD_TSONE_Pos (2U)
#define CAN_TCMD_TSONE_Msk (0x1UL << CAN_TCMD_TSONE_Pos)
#define CAN_TCMD_TSONE CAN_TCMD_TSONE_Msk
#define CAN_TCMD_TPA_Pos (3U)
#define CAN_TCMD_TPA_Msk (0x1UL << CAN_TCMD_TPA_Pos)
#define CAN_TCMD_TPA CAN_TCMD_TPA_Msk
#define CAN_TCMD_TPE_Pos (4U)
#define CAN_TCMD_TPE_Msk (0x1UL << CAN_TCMD_TPE_Pos)
#define CAN_TCMD_TPE CAN_TCMD_TPE_Msk
#define CAN_TCMD_STBY_Pos (5U)
#define CAN_TCMD_STBY_Msk (0x1UL << CAN_TCMD_STBY_Pos)
#define CAN_TCMD_STBY CAN_TCMD_STBY_Msk
#define CAN_TCMD_LOM_Pos (6U)
#define CAN_TCMD_LOM_Msk (0x1UL << CAN_TCMD_LOM_Pos)
#define CAN_TCMD_LOM CAN_TCMD_LOM_Msk
#define CAN_TCMD_TBSEL_Pos (7U)
#define CAN_TCMD_TBSEL_Msk (0x1UL << CAN_TCMD_TBSEL_Pos)
#define CAN_TCMD_TBSEL CAN_TCMD_TBSEL_Msk

// CAN_TCTRL
#define CAN_TCTRL_TSSTAT_Pos (0U)
#define CAN_TCTRL_TSSTAT_Msk (0x3UL << CAN_TCTRL_TSSTAT_Pos)
#define CAN_TCTRL_TSSTAT CAN_TCTRL_TSSTAT_Msk
#define CAN_TCTRL_TTTBM_Pos (4U)
#define CAN_TCTRL_TTTBM_Msk (0x1UL << CAN_TCTRL_TTTBM_Pos)
#define CAN_TCTRL_TTTBM CAN_TCTRL_TTTBM_Msk
#define CAN_TCTRL_TSMODE_Pos (5U)
#define CAN_TCTRL_TSMODE_Msk (0x1UL << CAN_TCTRL_TSMODE_Pos)
#define CAN_TCTRL_TSMODE CAN_TCTRL_TSMODE_Msk
#define CAN_TCTRL_TSNEXT_Pos (6U)
#define CAN_TCTRL_TSNEXT_Msk (0x1UL << CAN_TCTRL_TSNEXT_Pos)
#define CAN_TCTRL_TSNEXT CAN_TCTRL_TSNEXT_Msk

// CAN_RCTRL
#define CAN_RCTRL_RSSTAT_Pos (0U)
#define CAN_RCTRL_RSSTAT_Msk (0x3UL << CAN_RCTRL_RSSTAT_Pos)
#define CAN_RCTRL_RSSTAT CAN_RCTRL_RSSTAT_Msk
#define CAN_RCTRL_RBALL_Pos (3U)
#define CAN_RCTRL_RBALL_Msk (0x1UL << CAN_RCTRL_RBALL_Pos)
#define CAN_RCTRL_RBALL CAN_RCTRL_RBALL_Msk
#define CAN_RCTRL_RREL_Pos (4U)
#define CAN_RCTRL_RREL_Msk (0x1UL << CAN_RCTRL_RREL_Pos)
#define CAN_RCTRL_RREL CAN_RCTRL_RREL_Msk
#define CAN_RCTRL_ROV_Pos (5U)
#define CAN_RCTRL_ROV_Msk (0x1UL << CAN_RCTRL_ROV_Pos)
#define CAN_RCTRL_ROV CAN_RCTRL_ROV_Msk
#define CAN_RCTRL_ROM_Pos (6U)
#define CAN_RCTRL_ROM_Msk (0x1UL << CAN_RCTRL_ROM_Pos)
#define CAN_RCTRL_ROM CAN_RCTRL_ROM_Msk
#define CAN_RCTRL_SACK_Pos (7U)
#define CAN_RCTRL_SACK_Msk (0x1UL << CAN_RCTRL_SACK_Pos)
#define CAN_RCTRL_SACK CAN_RCTRL_SACK_Msk

