sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// CAN_RTIE
#define CAN_RTIE_TSFF_Pos (0U)
#define CAN_RTIE_TSFF_Msk (0x1UL << CAN_RTIE_TSFF_Pos)
#define CAN_RTIE_TSFF CAN_RTIE_TSFF_Msk
#define CAN_RTIE_EIE_Pos (1U)
#define CAN_RTIE_EIE_Msk (0x1UL << CAN_RTIE_EIE_Pos)
#define CAN_RTIE_EIE CAN_RTIE_EIE_Msk
#define CAN_RTIE_TSIE_Pos (2U)
#define CAN_RTIE_TSIE_Msk (0x1UL << CAN_RTIE_TSIE_Pos)
#define CAN_RTIE_TSIE CAN_RTIE_TSIE_Msk
#define CAN_RTIE_TPIE_Pos (3U)
#define CAN_RTIE_TPIE_Msk (0x1UL << CAN_RTIE_TPIE_Pos)
#define CAN_RTIE_TPIE CAN_RTIE_TPIE_Msk
#define CAN_RTIE_RAFIE_Pos (4U)
#define CAN_RTIE_RAFIE_Msk (0x1UL << CAN_RTIE_RAFIE_Pos)
#define CAN_RTIE_RAFIE CAN_RTIE_RAFIE_Msk
#define CAN_RTIE_RFIE_Pos (5U)
#define CAN_RTIE_RFIE_Msk (0x1UL << CAN_RTIE_RFIE_Pos)
#define CAN_RTIE_RFIE CAN_RTIE_RFIE_Msk
#define CAN_RTIE_ROIE_Pos (6U)
#define CAN_RTIE_ROIE_Msk (0x1UL << CAN_RTIE_ROIE_Pos)
#define CAN_RTIE_ROIE CAN_RTIE_ROIE_Msk
#define CAN_RTIE_RIE_Pos (7U)
#define CAN_RTIE_RIE_Msk (0x1UL << CAN_RTIE_RIE_Pos)
#define CAN_RTIE_RIE CAN_RTIE_RIE_Msk

// CAN_RTIF
#define CAN_RTIF_AIF_Pos (0U)
#define CAN_RTIF_AIF_Msk (0x1UL << CAN_RTIF_AIF_Pos)
#define CAN_RTIF_AIF CAN_RTIF_AIF_Msk
#define CAN_RTIF_EIF_Pos (1U)
#define CAN_RTIF_EIF_Msk (0x1UL << CAN_RTIF_EIF_Pos)
#define CAN_RTIF_EIF CAN_RTIF_EIF_Msk
#define CAN_RTIF_TSIF_Pos (2U)
#define CAN_RTIF_TSIF_Msk (0x1UL << CAN_RTIF_TSIF_Pos)
#define CAN_RTIF_TSIF CAN_RTIF_TSIF_Msk
#define CAN_RTIF_TPIF_Pos (3U)
#define CAN_RTIF_TPIF_Msk (0x1UL << CAN_RTIF_TPIF_Pos)
#define CAN_RTIF_TPIF CAN_RTIF_TPIF_Msk
#define CAN_RTIF_RAFIF_Pos (4U)
#define CAN_RTIF_RAFIF_Msk (0x1UL << CAN_RTIF_RAFIF_Pos)
#define CAN_RTIF_RAFIF CAN_RTIF_RAFIF_Msk
#define CAN_RTIF_RFIF_Pos (5U)
#define CAN_RTIF_RFIF_Msk (0x1UL << CAN_RTIF_RFIF_Pos)
#define CAN_RTIF_RFIF CAN_RTIF_RFIF_Msk
#define CAN_RTIF_ROIF_Pos (6U)
#define CAN_RTIF_ROIF_Msk (0x1UL << CAN_RTIF_ROIF_Pos)
#define CAN_RTIF_ROIF CAN_RTIF_ROIF_Msk
#define CAN_RTIF_RIF_Pos (7U)
#define CAN_RTIF_RIF_Msk (0x1UL << CAN_RTIF_RIF_Pos)
#define CAN_RTIF_RIF CAN_RTIF_RIF_Msk

// CAN_ERRINT
#define CAN_ERRINT_BEIF_Pos (0U)
#define CAN_ERRINT_BEIF_Msk (0x1UL << CAN_ERRINT_BEIF_Pos)
#define CAN_ERRINT_BEIF CAN_ERRINT_BEIF_Msk
#define CAN_ERRINT_BEIE_Pos (1U)
#define CAN_ERRINT_BEIE_Msk (0x1UL << CAN_ERRINT_BEIE_Pos)
#define CAN_ERRINT_BEIE CAN_ERRINT_BEIE_Msk
#define CAN_ERRINT_ALIF_Pos (2U)
#define CAN_ERRINT_ALIF_Msk (0x1UL << CAN_ERRINT_ALIF_Pos)
#define CAN_ERRINT_ALIF CAN_ERRINT_ALIF_Msk
#define CAN_ERRINT_ALIE_Pos (3U)
#define CAN_ERRINT_ALIE_Msk (0x1UL << CAN_ERRINT_ALIE_Pos)
#define CAN_ERRINT_ALIE CAN_ERRINT_ALIE_Msk
#define CAN_ERRINT_EPIF_Pos (4U)
#define CAN_ERRINT_EPIF_Msk (0x1UL << CAN_ERRINT_EPIF_Pos)
#define CAN_ERRINT_EPIF CAN_ERRINT_EPIF_Msk
#define CAN_ERRINT_EPIE_Pos (5U)
#define CAN_ERRINT_EPIE_Msk (0x1UL << CAN_ERRINT_EPIE_Pos)
#define CAN_ERRINT_EPIE CAN_ERRINT_EPIE_Msk
#define CAN_ERRINT_EPASS_Pos (6U)
#define CAN_ERRINT_EPASS_Msk (0x1UL << CAN_ERRINT_EPASS_Pos)
#define CAN_ERRINT_EPASS CAN_ERRINT_EPASS_Msk
#define CAN_ERRINT_EWARN_Pos (7U)
#define CAN_ERRINT_EWARN_Msk (0x1UL << CAN_ERRINT_EWARN_Pos)
#define CAN_ERRINT_EWARN CAN_ERRINT_EWARN_Msk

// CAN_LIMIT
#define CAN_LIMIT_EWL_Pos (0U)
#define CAN_LIMIT_EWL_Msk (0xFUL << CAN_LIMIT_EWL_Pos)
#define CAN_LIMIT_EWL CAN_LIMIT_EWL_Msk
#define CAN_LIMIT_AFWL_Pos (4U)
#define CAN_LIMIT_AFWL_Msk (0xFUL << CAN_LIMIT_AFWL_Pos)
#define CAN_LIMIT_AFWL CAN_LIMIT_AFWL_Msk

// CAN_BT
#define CAN_BT_SEG_1_Pos (0U)
#define CAN_BT_SEG_1_Msk (0xFFUL << CAN_BT_SEG_1_Pos)
#define CAN_BT_SEG_1 CAN_BT_SEG_1_Msk
#define CAN_BT_SEG_2_Pos (8U)
#define CAN_BT_SEG_2_Msk (0x7FUL << CAN_BT_SEG_2_Pos)
#define CAN_BT_SEG_2 CAN_BT_SEG_2_Msk
#define CAN_BT_SJW_Pos (16U)
#define CAN_BT_SJW_Msk (0x7FUL << CAN_BT_SJW_Pos)
#define CAN_BT_SJW CAN_BT_SJW_Msk
#define CAN_BT_PRESC_Pos (24U)
#define CAN_BT_PRESC_Msk (0xFFUL << CAN_BT_PRESC_Pos)
#define CAN_BT_PRESC CAN_BT_PRESC_Msk

// CAN_EALCAP
#define CAN_EALCAP_ALC_Pos (0U)
#define CAN_EALCAP_ALC_Msk (0x1FUL << CAN_EALCAP_ALC_Pos)
#define CAN_EALCAP_ALC CAN_EALCAP_ALC_Msk
#define CAN_EALCAP_KOER_Pos (5U)
#define CAN_EALCAP_KOER_Msk (0x7UL << CAN_EALCAP_KOER_Pos)
#define CAN_EALCAP_KOER CAN_EALCAP_KOER_Msk

// CAN_ACFCTRL
#define CAN_ACFCTRL_ACFADR_Pos (0U)
#define CAN_ACFCTRL_ACFADR_Msk (0xFUL << CAN_ACFCTRL_ACFADR_Pos)
#define CAN_ACFCTRL_ACFADR CAN_ACFCTRL_ACFADR_Msk
#define CAN_ACFCTRL_SELMASK_Pos (5U)
#define CAN_ACFCTRL_SELMASK_Msk (0x1UL << CAN_ACFCTRL_SELMASK_Pos)
#define CAN_ACFCTRL_SELMASK CAN_ACFCTRL_SELMASK_Msk

// CAN_ACFEN
#define CAN_ACFEN_AE_1_Pos (0U)
#define CAN_ACFEN_AE_1_Msk (0x1UL << CAN_ACFEN_AE_1_Pos)
#define CAN_ACFEN_AE_1 CAN_ACFEN_AE_1_Msk
#define CAN_ACFEN_AE_2_Pos (1U)
#define CAN_ACFEN_AE_2_Msk (0x1UL << CAN_ACFEN_AE_2_Pos)
#define CAN_ACFEN_AE_2 CAN_ACFEN_AE_2_Msk
#define CAN_ACFEN_AE_3_Pos (2U)
#define CAN_ACFEN_AE_3_Msk (0x1UL << CAN_ACFEN_AE_3_Pos)
#define CAN_ACFEN_AE_3 CAN_ACFEN_AE_3_Msk
#define CAN_ACFEN_AE_4_Pos (3U)
#define CAN_ACFEN_AE_4_Msk (0x1UL << CAN_ACFEN_AE_4_Pos)
#define CAN_ACFEN_AE_4 CAN_ACFEN_AE_4_Msk
#define CAN_ACFEN_AE_5_Pos (4U)
#define CAN_ACFEN_AE_5_Msk (0x1UL << CAN_ACFEN_AE_5_Pos)
#define CAN_ACFEN_AE_5 CAN_ACFEN_AE_5_Msk
#define CAN_ACFEN_AE_6_Pos (5U)
#define CAN_ACFEN_AE_6_Msk (0x1UL << CAN_ACFEN_AE_6_Pos)
#define CAN_ACFEN_AE_6 CAN_ACFEN_AE_6_Msk
#define CAN_ACFEN_AE_7_Pos (6U)
#define CAN_ACFEN_AE_7_Msk (0x1UL << CAN_ACFEN_AE_7_Pos)
#define CAN_ACFEN_AE_7 CAN_ACFEN_AE_7_Msk
#define CAN_ACFEN_AE_8_Pos (7U)
#define CAN_ACFEN_AE_8_Msk (0x1UL << CAN_ACFEN_AE_8_Pos)
#define CAN_ACFEN_AE_8 CAN_ACFEN_AE_8_Msk

// CAN_ACF
#define CAN_ACF_ACODE_AMASK_Pos (0U)
#define CAN_ACF_ACODE_AMASK_Msk (0x1FFFFFFFUL << CAN_ACF_ACODE_AMASK_Pos)
#define CAN_ACF_ACODE_AMASK CAN_ACF_ACODE_AMASK_Msk
#define CAN_ACF_AIDE_Pos (29U)
#define CAN_ACF_AIDE_Msk (0x1UL << CAN_ACF_AIDE_Pos)
#define CAN_ACF_AIDE CAN_ACF_AIDE_Msk
#define CAN_ACF_AIDEE_Pos (30U)
#define CAN_ACF_AIDEE_Msk (0x1UL << CAN_ACF_AIDEE_Pos)
#define CAN_ACF_AIDEE CAN_ACF_AIDEE_Msk

// CAN_TBSLOT
#define CAN_TBSLOT_TBPTR_Pos (0U)
#define CAN_TBSLOT_TBPTR_Msk (0x7UL << CAN_TBSLOT_TBPTR_Pos)
#define CAN_TBSLOT_TBPTR CAN_TBSLOT_TBPTR_Msk
#define CAN_TBSLOT_TBF_Pos (6U)
#define CAN_TBSLOT_TBF_Msk (0x1UL << CAN_TBSLOT_TBF_Pos)
#define CAN_TBSLOT_TBF CAN_TBSLOT_TBF_Msk
#define CAN_TBSLOT_TBE_Pos (7U)
#define CAN_TBSLOT_TBE_Msk (0x1UL << CAN_TBSLOT_TBE_Pos)
#define CAN_TBSLOT_TBE CAN_TBSLOT_TBE_Msk

// CAN_TTCFG
#define CAN_TTCFG_TTEN_Pos (0U)
#define CAN_TTCFG_TTEN_Msk (0x1UL << CAN_TTCFG_TTEN_Pos)
#define CAN_TTCFG_TTEN CAN_TTCFG_TTEN_Msk
#define CAN_TTCFG_T_PRESC_Pos (1U)
#define CAN_TTCFG_T_PRESC_Msk (0x3UL << CAN_TTCFG_T_PRESC_Pos)
#define CAN_TTCFG_T_PRESC CAN_TTCFG_T_PRESC_Msk
#define CAN_TTCFG_TTIF_Pos (3U)
#define CAN_TTCFG_TTIF_Msk (0x1UL << CAN_TTCFG_TTIF_Pos)
#define CAN_TTCFG_TTIF CAN_TTCFG_TTIF_Msk
#define CAN_TTCFG_TTIE_Pos (4U)
#define CAN_TTCFG_TTIE_Msk (0x1UL << CAN_TTCFG_TTIE_Pos)
#define CAN_TTCFG_TTIE CAN_TTCFG_TTIE_Msk
#define CAN_TTCFG_TEIF_Pos (5U)
#define CAN_TTCFG_TEIF_Msk (0x1UL << CAN_TTCFG_TEIF_Pos)
#define CAN_TTCFG_TEIF CAN_TTCFG_TEIF_Msk
#define CAN_TTCFG_WTIF_Pos (6U)
#define CAN_TTCFG_WTIF_Msk (0x1UL << CAN_TTCFG_WTIF_Pos)
#define CAN_TTCFG_WTIF CAN_TTCFG_WTIF_Msk
#define CAN_TTCFG_WTIE_Pos (7U)
#define CAN_TTCFG_WTIE_Msk (0x1UL << CAN_TTCFG_WTIE_Pos)
#define CAN_TTCFG_WTIE CAN_TTCFG_WTIE_Msk

// CAN_REF_MSG
#define CAN_REF_MSG_REF_ID_Pos (0U)
#define CAN_REF_MSG_REF_ID_Msk (0x1FFFFFFFUL << CAN_REF_MSG_REF_ID_Pos)
#define CAN_REF_MSG_REF_ID CAN_REF_MSG_REF_ID_Msk
#define CAN_REF_MSG_REF_IDE_Pos (31U)
#define CAN_REF_MSG_REF_IDE_Msk (0x1UL << CAN_REF_MSG_REF_IDE_Pos)
#define CAN_REF_MSG_REF_IDE CAN_REF_MSG_REF_IDE_Msk

// CAN_TRG_CFG
#define CAN_TRG_CFG_TTPTR_Pos (0U)
#define CAN_TRG_CFG_TTPTR_Msk (0x7UL << CAN_TRG_CFG_TTPTR_Pos)
#define CAN_TRG_CFG_TTPTR CAN_TRG_CFG_TTPTR_Msk
#define CAN_TRG_CFG_TTYPE_Pos (8U)
#define CAN_TRG_CFG_TTYPE_Msk (0x7UL << CAN_TRG_CFG_TTYPE_Pos)
#define CAN_TRG_CFG_TTYPE CAN_TRG_CFG_TTYPE_Msk
#define CAN_TRG_CFG_TEW_Pos (12U)
#define CAN_TRG_CFG_TEW_Msk (0xFUL << CAN_TRG_CFG_TEW_Pos)
#define CAN_TRG_CFG_TEW CAN_TRG_CFG_TEW_Msk

//********************    Bits Define For Peripheral CRC    ********************//
// CRC_CSR
#define CRC_CSR_CODE_Pos (0U)
#define CRC_CSR_CODE_Msk (0x1UL << CRC_CSR_CODE_Pos)
#define CRC_CSR_CODE CRC_CSR_CODE_Msk
#define CRC_CSR_FLAG_Pos (1U)
#define CRC_CSR_FLAG_Msk (0x1UL << CRC_CSR_FLAG_Pos)
#define CRC_CSR_FLAG CRC_CSR_FLAG_Msk

// CRC_RESULT
#define CRC_RESULT_RESULT_Pos (0U)
#define CRC_RESULT_RESULT_Msk (0xFFFFFFFFUL << CRC_RESULT_RESULT_Pos)
#define CRC_RESULT_RESULT CRC_RESULT_RESULT_Msk

