sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// CRC_DATA
#define CRC_DATA_DATA_Pos (0U)
#define CRC_DATA_DATA_Msk (0xFFFFFFFFUL << CRC_DATA_DATA_Pos)
#define CRC_DATA_DATA CRC_DATA_DATA_Msk

//********************    Bits Define For Peripheral CTRIM    ********************//
// CTRIM_ARR
#define CTRIM_ARR_ARR_Pos (0U)
#define CTRIM_ARR_ARR_Msk (0xFFFFUL << CTRIM_ARR_ARR_Pos)
#define CTRIM_ARR_ARR CTRIM_ARR_ARR_Msk

// CTRIM_CNT
#define CTRIM_CNT_CNT_Pos (0U)
#define CTRIM_CNT_CNT_Msk (0xFFFFUL << CTRIM_CNT_CNT_Pos)
#define CTRIM_CNT_CNT CTRIM_CNT_CNT_Msk

// CTRIM_CR0
#define CTRIM_CR0_STEP_Pos (0U)
#define CTRIM_CR0_STEP_Msk (0x7UL << CTRIM_CR0_STEP_Pos)
#define CTRIM_CR0_STEP CTRIM_CR0_STEP_Msk
#define CTRIM_CR0_ETRFLT_Pos (4U)
#define CTRIM_CR0_ETRFLT_Msk (0x7UL << CTRIM_CR0_ETRFLT_Pos)
#define CTRIM_CR0_ETRFLT CTRIM_CR0_ETRFLT_Msk
#define CTRIM_CR0_SRC_Pos (8U)
#define CTRIM_CR0_SRC_Msk (0x7UL << CTRIM_CR0_SRC_Pos)
#define CTRIM_CR0_SRC CTRIM_CR0_SRC_Msk

// CTRIM_CR1
#define CTRIM_CR1_EN_Pos (0U)
#define CTRIM_CR1_EN_Msk (0x1UL << CTRIM_CR1_EN_Pos)
#define CTRIM_CR1_EN CTRIM_CR1_EN_Msk
#define CTRIM_CR1_MD_Pos (1U)
#define CTRIM_CR1_MD_Msk (0x3UL << CTRIM_CR1_MD_Pos)
#define CTRIM_CR1_MD CTRIM_CR1_MD_Msk
#define CTRIM_CR1_AUTO_Pos (3U)
#define CTRIM_CR1_AUTO_Msk (0x1UL << CTRIM_CR1_AUTO_Pos)
#define CTRIM_CR1_AUTO CTRIM_CR1_AUTO_Msk
#define CTRIM_CR1_PRS_Pos (4U)
#define CTRIM_CR1_PRS_Msk (0xFUL << CTRIM_CR1_PRS_Pos)
#define CTRIM_CR1_PRS CTRIM_CR1_PRS_Msk
#define CTRIM_CR1_OST_Pos (8U)
#define CTRIM_CR1_OST_Msk (0x1UL << CTRIM_CR1_OST_Pos)
#define CTRIM_CR1_OST CTRIM_CR1_OST_Msk
#define CTRIM_CR1_MDRCH_Pos (9U)
#define CTRIM_CR1_MDRCH_Msk (0x3UL << CTRIM_CR1_MDRCH_Pos)
#define CTRIM_CR1_MDRCH CTRIM_CR1_MDRCH_Msk

// CTRIM_IER
#define CTRIM_IER_UD_Pos (0U)
#define CTRIM_IER_UD_Msk (0x1UL << CTRIM_IER_UD_Pos)
#define CTRIM_IER_UD CTRIM_IER_UD_Msk
#define CTRIM_IER_END_Pos (1U)
#define CTRIM_IER_END_Msk (0x1UL << CTRIM_IER_END_Pos)
#define CTRIM_IER_END CTRIM_IER_END_Msk
#define CTRIM_IER_PS_Pos (2U)
#define CTRIM_IER_PS_Msk (0x1UL << CTRIM_IER_PS_Pos)
#define CTRIM_IER_PS CTRIM_IER_PS_Msk
#define CTRIM_IER_MISS_Pos (3U)
#define CTRIM_IER_MISS_Msk (0x1UL << CTRIM_IER_MISS_Pos)
#define CTRIM_IER_MISS CTRIM_IER_MISS_Msk
#define CTRIM_IER_OV_Pos (4U)
#define CTRIM_IER_OV_Msk (0x1UL << CTRIM_IER_OV_Pos)
#define CTRIM_IER_OV CTRIM_IER_OV_Msk
#define CTRIM_IER_OK_Pos (5U)
#define CTRIM_IER_OK_Msk (0x1UL << CTRIM_IER_OK_Pos)
#define CTRIM_IER_OK CTRIM_IER_OK_Msk

// CTRIM_ISR
#define CTRIM_ISR_UD_Pos (0U)
#define CTRIM_ISR_UD_Msk (0x1UL << CTRIM_ISR_UD_Pos)
#define CTRIM_ISR_UD CTRIM_ISR_UD_Msk
#define CTRIM_ISR_END_Pos (1U)
#define CTRIM_ISR_END_Msk (0x1UL << CTRIM_ISR_END_Pos)
#define CTRIM_ISR_END CTRIM_ISR_END_Msk
#define CTRIM_ISR_PS_Pos (2U)
#define CTRIM_ISR_PS_Msk (0x1UL << CTRIM_ISR_PS_Pos)
#define CTRIM_ISR_PS CTRIM_ISR_PS_Msk
#define CTRIM_ISR_MISS_Pos (3U)
#define CTRIM_ISR_MISS_Msk (0x1UL << CTRIM_ISR_MISS_Pos)
#define CTRIM_ISR_MISS CTRIM_ISR_MISS_Msk
#define CTRIM_ISR_OV_Pos (4U)
#define CTRIM_ISR_OV_Msk (0x1UL << CTRIM_ISR_OV_Pos)
#define CTRIM_ISR_OV CTRIM_ISR_OV_Msk
#define CTRIM_ISR_OK_Pos (5U)
#define CTRIM_ISR_OK_Msk (0x1UL << CTRIM_ISR_OK_Pos)
#define CTRIM_ISR_OK CTRIM_ISR_OK_Msk
#define CTRIM_ISR_DIR_Pos (6U)
#define CTRIM_ISR_DIR_Msk (0x1UL << CTRIM_ISR_DIR_Pos)
#define CTRIM_ISR_DIR CTRIM_ISR_DIR_Msk

// CTRIM_ICR
#define CTRIM_ICR_UD_Pos (0U)
#define CTRIM_ICR_UD_Msk (0x1UL << CTRIM_ICR_UD_Pos)
#define CTRIM_ICR_UD CTRIM_ICR_UD_Msk
#define CTRIM_ICR_END_Pos (1U)
#define CTRIM_ICR_END_Msk (0x1UL << CTRIM_ICR_END_Pos)
#define CTRIM_ICR_END CTRIM_ICR_END_Msk
#define CTRIM_ICR_PS_Pos (2U)
#define CTRIM_ICR_PS_Msk (0x1UL << CTRIM_ICR_PS_Pos)
#define CTRIM_ICR_PS CTRIM_ICR_PS_Msk
#define CTRIM_ICR_MISS_Pos (3U)
#define CTRIM_ICR_MISS_Msk (0x1UL << CTRIM_ICR_MISS_Pos)
#define CTRIM_ICR_MISS CTRIM_ICR_MISS_Msk
#define CTRIM_ICR_OV_Pos (4U)
#define CTRIM_ICR_OV_Msk (0x1UL << CTRIM_ICR_OV_Pos)
#define CTRIM_ICR_OV CTRIM_ICR_OV_Msk
#define CTRIM_ICR_OK_Pos (5U)
#define CTRIM_ICR_OK_Msk (0x1UL << CTRIM_ICR_OK_Pos)
#define CTRIM_ICR_OK CTRIM_ICR_OK_Msk

// CTRIM_FCAP
#define CTRIM_FCAP_FCAP_Pos (0U)
#define CTRIM_FCAP_FCAP_Msk (0xFFFFUL << CTRIM_FCAP_FCAP_Pos)
#define CTRIM_FCAP_FCAP CTRIM_FCAP_FCAP_Msk

// CTRIM_TVAL
#define CTRIM_TVAL_TVAL_Pos (0U)
#define CTRIM_TVAL_TVAL_Msk (0xFFFFUL << CTRIM_TVAL_TVAL_Pos)
#define CTRIM_TVAL_TVAL CTRIM_TVAL_TVAL_Msk

// CTRIM_FLIM
#define CTRIM_FLIM_FLIM_Pos (0U)
#define CTRIM_FLIM_FLIM_Msk (0xFFFUL << CTRIM_FLIM_FLIM_Pos)
#define CTRIM_FLIM_FLIM CTRIM_FLIM_FLIM_Msk

//********************    Bits Define For Peripheral DMAC    ********************//
// DMAC_CONF
#define DMAC_CONF_HALT_Pos (24U)
#define DMAC_CONF_HALT_Msk (0xFUL << DMAC_CONF_HALT_Pos)
#define DMAC_CONF_HALT DMAC_CONF_HALT_Msk
#define DMAC_CONF_PRIO_Pos (28U)
#define DMAC_CONF_PRIO_Msk (0x1UL << DMAC_CONF_PRIO_Pos)
#define DMAC_CONF_PRIO DMAC_CONF_PRIO_Msk
#define DMAC_CONF_EN_Pos (31U)
#define DMAC_CONF_EN_Msk (0x1UL << DMAC_CONF_EN_Pos)
#define DMAC_CONF_EN DMAC_CONF_EN_Msk

// DMAC_CONFA0
#define DMAC_CONFA0_TC_Pos (0U)
#define DMAC_CONFA0_TC_Msk (0xFFFFUL << DMAC_CONFA0_TC_Pos)
#define DMAC_CONFA0_TC DMAC_CONFA0_TC_Msk
#define DMAC_CONFA0_BC_Pos (16U)
#define DMAC_CONFA0_BC_Msk (0xFUL << DMAC_CONFA0_BC_Pos)
#define DMAC_CONFA0_BC DMAC_CONFA0_BC_Msk
#define DMAC_CONFA0_TRISEL_Pos (22U)
#define DMAC_CONFA0_TRISEL_Msk (0x7FUL << DMAC_CONFA0_TRISEL_Pos)
#define DMAC_CONFA0_TRISEL DMAC_CONFA0_TRISEL_Msk
#define DMAC_CONFA0_ST_Pos (29U)
#define DMAC_CONFA0_ST_Msk (0x1UL << DMAC_CONFA0_ST_Pos)
#define DMAC_CONFA0_ST DMAC_CONFA0_ST_Msk
#define DMAC_CONFA0_PAS_Pos (30U)
#define DMAC_CONFA0_PAS_Msk (0x1UL << DMAC_CONFA0_PAS_Pos)
#define DMAC_CONFA0_PAS DMAC_CONFA0_PAS_Msk
#define DMAC_CONFA0_ENS_Pos (31U)
#define DMAC_CONFA0_ENS_Msk (0x1UL << DMAC_CONFA0_ENS_Pos)
#define DMAC_CONFA0_ENS DMAC_CONFA0_ENS_Msk

// DMAC_CONFB0
#define DMAC_CONFB0_MSK_Pos (0U)
#define DMAC_CONFB0_MSK_Msk (0x1UL << DMAC_CONFB0_MSK_Pos)
#define DMAC_CONFB0_MSK DMAC_CONFB0_MSK_Msk
#define DMAC_CONFB0_STAT_Pos (16U)
#define DMAC_CONFB0_STAT_Msk (0x7UL << DMAC_CONFB0_STAT_Pos)
#define DMAC_CONFB0_STAT DMAC_CONFB0_STAT_Msk
#define DMAC_CONFB0_FISIE_Pos (19U)
#define DMAC_CONFB0_FISIE_Msk (0x1UL << DMAC_CONFB0_FISIE_Pos)
#define DMAC_CONFB0_FISIE DMAC_CONFB0_FISIE_Msk
#define DMAC_CONFB0_ERRIE_Pos (20U)
#define DMAC_CONFB0_ERRIE_Msk (0x1UL << DMAC_CONFB0_ERRIE_Pos)
#define DMAC_CONFB0_ERRIE DMAC_CONFB0_ERRIE_Msk
#define DMAC_CONFB0_RD_Pos (21U)
#define DMAC_CONFB0_RD_Msk (0x1UL << DMAC_CONFB0_RD_Pos)
#define DMAC_CONFB0_RD DMAC_CONFB0_RD_Msk
#define DMAC_CONFB0_RS_Pos (22U)
#define DMAC_CONFB0_RS_Msk (0x1UL << DMAC_CONFB0_RS_Pos)
#define DMAC_CONFB0_RS DMAC_CONFB0_RS_Msk
#define DMAC_CONFB0_RC_Pos (23U)
#define DMAC_CONFB0_RC_Msk (0x1UL << DMAC_CONFB0_RC_Pos)
#define DMAC_CONFB0_RC DMAC_CONFB0_RC_Msk
#define DMAC_CONFB0_FD_Pos (24U)
#define DMAC_CONFB0_FD_Msk (0x1UL << DMAC_CONFB0_FD_Pos)
#define DMAC_CONFB0_FD DMAC_CONFB0_FD_Msk
#define DMAC_CONFB0_FS_Pos (25U)
#define DMAC_CONFB0_FS_Msk (0x1UL << DMAC_CONFB0_FS_Pos)
#define DMAC_CONFB0_FS DMAC_CONFB0_FS_Msk
#define DMAC_CONFB0_WIDTH_Pos (26U)
#define DMAC_CONFB0_WIDTH_Msk (0x3UL << DMAC_CONFB0_WIDTH_Pos)
#define DMAC_CONFB0_WIDTH DMAC_CONFB0_WIDTH_Msk
#define DMAC_CONFB0_MODE_Pos (28U)
#define DMAC_CONFB0_MODE_Msk (0x3UL << DMAC_CONFB0_MODE_Pos)
#define DMAC_CONFB0_MODE DMAC_CONFB0_MODE_Msk

// DMAC_SRCADR0
#define DMAC_SRCADR0_SRCADR_Pos (0U)
#define DMAC_SRCADR0_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR0_SRCADR_Pos)
#define DMAC_SRCADR0_SRCADR DMAC_SRCADR0_SRCADR_Msk

