sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// DMAC_DSTADR0
#define DMAC_DSTADR0_DSTADR_Pos (0U)
#define DMAC_DSTADR0_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR0_DSTADR_Pos)
#define DMAC_DSTADR0_DSTADR DMAC_DSTADR0_DSTADR_Msk

// DMAC_CONFA1
#define DMAC_CONFA1_TC_Pos (0U)
#define DMAC_CONFA1_TC_Msk (0xFFFFUL << DMAC_CONFA1_TC_Pos)
#define DMAC_CONFA1_TC DMAC_CONFA1_TC_Msk
#define DMAC_CONFA1_BC_Pos (16U)
#define DMAC_CONFA1_BC_Msk (0xFUL << DMAC_CONFA1_BC_Pos)
#define DMAC_CONFA1_BC DMAC_CONFA1_BC_Msk
#define DMAC_CONFA1_TRISEL_Pos (22U)
#define DMAC_CONFA1_TRISEL_Msk (0x7FUL << DMAC_CONFA1_TRISEL_Pos)
#define DMAC_CONFA1_TRISEL DMAC_CONFA1_TRISEL_Msk
#define DMAC_CONFA1_ST_Pos (29U)
#define DMAC_CONFA1_ST_Msk (0x1UL << DMAC_CONFA1_ST_Pos)
#define DMAC_CONFA1_ST DMAC_CONFA1_ST_Msk
#define DMAC_CONFA1_PAS_Pos (30U)
#define DMAC_CONFA1_PAS_Msk (0x1UL << DMAC_CONFA1_PAS_Pos)
#define DMAC_CONFA1_PAS DMAC_CONFA1_PAS_Msk
#define DMAC_CONFA1_ENS_Pos (31U)
#define DMAC_CONFA1_ENS_Msk (0x1UL << DMAC_CONFA1_ENS_Pos)
#define DMAC_CONFA1_ENS DMAC_CONFA1_ENS_Msk

// DMAC_CONFB1
#define DMAC_CONFB1_MSK_Pos (0U)
#define DMAC_CONFB1_MSK_Msk (0x1UL << DMAC_CONFB1_MSK_Pos)
#define DMAC_CONFB1_MSK DMAC_CONFB1_MSK_Msk
#define DMAC_CONFB1_STAT_Pos (16U)
#define DMAC_CONFB1_STAT_Msk (0x7UL << DMAC_CONFB1_STAT_Pos)
#define DMAC_CONFB1_STAT DMAC_CONFB1_STAT_Msk
#define DMAC_CONFB1_FISIE_Pos (19U)
#define DMAC_CONFB1_FISIE_Msk (0x1UL << DMAC_CONFB1_FISIE_Pos)
#define DMAC_CONFB1_FISIE DMAC_CONFB1_FISIE_Msk
#define DMAC_CONFB1_ERRIE_Pos (20U)
#define DMAC_CONFB1_ERRIE_Msk (0x1UL << DMAC_CONFB1_ERRIE_Pos)
#define DMAC_CONFB1_ERRIE DMAC_CONFB1_ERRIE_Msk
#define DMAC_CONFB1_RD_Pos (21U)
#define DMAC_CONFB1_RD_Msk (0x1UL << DMAC_CONFB1_RD_Pos)
#define DMAC_CONFB1_RD DMAC_CONFB1_RD_Msk
#define DMAC_CONFB1_RS_Pos (22U)
#define DMAC_CONFB1_RS_Msk (0x1UL << DMAC_CONFB1_RS_Pos)
#define DMAC_CONFB1_RS DMAC_CONFB1_RS_Msk
#define DMAC_CONFB1_RC_Pos (23U)
#define DMAC_CONFB1_RC_Msk (0x1UL << DMAC_CONFB1_RC_Pos)
#define DMAC_CONFB1_RC DMAC_CONFB1_RC_Msk
#define DMAC_CONFB1_FD_Pos (24U)
#define DMAC_CONFB1_FD_Msk (0x1UL << DMAC_CONFB1_FD_Pos)
#define DMAC_CONFB1_FD DMAC_CONFB1_FD_Msk
#define DMAC_CONFB1_FS_Pos (25U)
#define DMAC_CONFB1_FS_Msk (0x1UL << DMAC_CONFB1_FS_Pos)
#define DMAC_CONFB1_FS DMAC_CONFB1_FS_Msk
#define DMAC_CONFB1_WIDTH_Pos (26U)
#define DMAC_CONFB1_WIDTH_Msk (0x3UL << DMAC_CONFB1_WIDTH_Pos)
#define DMAC_CONFB1_WIDTH DMAC_CONFB1_WIDTH_Msk
#define DMAC_CONFB1_MODE_Pos (28U)
#define DMAC_CONFB1_MODE_Msk (0x3UL << DMAC_CONFB1_MODE_Pos)
#define DMAC_CONFB1_MODE DMAC_CONFB1_MODE_Msk

// DMAC_SRCADR1
#define DMAC_SRCADR1_SRCADR_Pos (0U)
#define DMAC_SRCADR1_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR1_SRCADR_Pos)
#define DMAC_SRCADR1_SRCADR DMAC_SRCADR1_SRCADR_Msk

// DMAC_DSTADR1
#define DMAC_DSTADR1_DSTADR_Pos (0U)
#define DMAC_DSTADR1_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR1_DSTADR_Pos)
#define DMAC_DSTADR1_DSTADR DMAC_DSTADR1_DSTADR_Msk

// DMAC_CONFA2
#define DMAC_CONFA2_TC_Pos (0U)
#define DMAC_CONFA2_TC_Msk (0xFFFFUL << DMAC_CONFA2_TC_Pos)
#define DMAC_CONFA2_TC DMAC_CONFA2_TC_Msk
#define DMAC_CONFA2_BC_Pos (16U)
#define DMAC_CONFA2_BC_Msk (0xFUL << DMAC_CONFA2_BC_Pos)
#define DMAC_CONFA2_BC DMAC_CONFA2_BC_Msk
#define DMAC_CONFA2_TRISEL_Pos (22U)
#define DMAC_CONFA2_TRISEL_Msk (0x7FUL << DMAC_CONFA2_TRISEL_Pos)
#define DMAC_CONFA2_TRISEL DMAC_CONFA2_TRISEL_Msk
#define DMAC_CONFA2_ST_Pos (29U)
#define DMAC_CONFA2_ST_Msk (0x1UL << DMAC_CONFA2_ST_Pos)
#define DMAC_CONFA2_ST DMAC_CONFA2_ST_Msk
#define DMAC_CONFA2_PAS_Pos (30U)
#define DMAC_CONFA2_PAS_Msk (0x1UL << DMAC_CONFA2_PAS_Pos)
#define DMAC_CONFA2_PAS DMAC_CONFA2_PAS_Msk
#define DMAC_CONFA2_ENS_Pos (31U)
#define DMAC_CONFA2_ENS_Msk (0x1UL << DMAC_CONFA2_ENS_Pos)
#define DMAC_CONFA2_ENS DMAC_CONFA2_ENS_Msk

// DMAC_CONFB2
#define DMAC_CONFB2_MSK_Pos (0U)
#define DMAC_CONFB2_MSK_Msk (0x1UL << DMAC_CONFB2_MSK_Pos)
#define DMAC_CONFB2_MSK DMAC_CONFB2_MSK_Msk
#define DMAC_CONFB2_STAT_Pos (16U)
#define DMAC_CONFB2_STAT_Msk (0x7UL << DMAC_CONFB2_STAT_Pos)
#define DMAC_CONFB2_STAT DMAC_CONFB2_STAT_Msk
#define DMAC_CONFB2_FISIE_Pos (19U)
#define DMAC_CONFB2_FISIE_Msk (0x1UL << DMAC_CONFB2_FISIE_Pos)
#define DMAC_CONFB2_FISIE DMAC_CONFB2_FISIE_Msk
#define DMAC_CONFB2_ERRIE_Pos (20U)
#define DMAC_CONFB2_ERRIE_Msk (0x1UL << DMAC_CONFB2_ERRIE_Pos)
#define DMAC_CONFB2_ERRIE DMAC_CONFB2_ERRIE_Msk
#define DMAC_CONFB2_RD_Pos (21U)
#define DMAC_CONFB2_RD_Msk (0x1UL << DMAC_CONFB2_RD_Pos)
#define DMAC_CONFB2_RD DMAC_CONFB2_RD_Msk
#define DMAC_CONFB2_RS_Pos (22U)
#define DMAC_CONFB2_RS_Msk (0x1UL << DMAC_CONFB2_RS_Pos)
#define DMAC_CONFB2_RS DMAC_CONFB2_RS_Msk
#define DMAC_CONFB2_RC_Pos (23U)
#define DMAC_CONFB2_RC_Msk (0x1UL << DMAC_CONFB2_RC_Pos)
#define DMAC_CONFB2_RC DMAC_CONFB2_RC_Msk
#define DMAC_CONFB2_FD_Pos (24U)
#define DMAC_CONFB2_FD_Msk (0x1UL << DMAC_CONFB2_FD_Pos)
#define DMAC_CONFB2_FD DMAC_CONFB2_FD_Msk
#define DMAC_CONFB2_FS_Pos (25U)
#define DMAC_CONFB2_FS_Msk (0x1UL << DMAC_CONFB2_FS_Pos)
#define DMAC_CONFB2_FS DMAC_CONFB2_FS_Msk
#define DMAC_CONFB2_WIDTH_Pos (26U)
#define DMAC_CONFB2_WIDTH_Msk (0x3UL << DMAC_CONFB2_WIDTH_Pos)
#define DMAC_CONFB2_WIDTH DMAC_CONFB2_WIDTH_Msk
#define DMAC_CONFB2_MODE_Pos (28U)
#define DMAC_CONFB2_MODE_Msk (0x3UL << DMAC_CONFB2_MODE_Pos)
#define DMAC_CONFB2_MODE DMAC_CONFB2_MODE_Msk

// DMAC_SRCADR2
#define DMAC_SRCADR2_SRCADR_Pos (0U)
#define DMAC_SRCADR2_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR2_SRCADR_Pos)
#define DMAC_SRCADR2_SRCADR DMAC_SRCADR2_SRCADR_Msk

// DMAC_DSTADR2
#define DMAC_DSTADR2_DSTADR_Pos (0U)
#define DMAC_DSTADR2_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR2_DSTADR_Pos)
#define DMAC_DSTADR2_DSTADR DMAC_DSTADR2_DSTADR_Msk

// DMAC_CONFA3
#define DMAC_CONFA3_TC_Pos (0U)
#define DMAC_CONFA3_TC_Msk (0xFFFFUL << DMAC_CONFA3_TC_Pos)
#define DMAC_CONFA3_TC DMAC_CONFA3_TC_Msk
#define DMAC_CONFA3_BC_Pos (16U)
#define DMAC_CONFA3_BC_Msk (0xFUL << DMAC_CONFA3_BC_Pos)
#define DMAC_CONFA3_BC DMAC_CONFA3_BC_Msk
#define DMAC_CONFA3_TRISEL_Pos (22U)
#define DMAC_CONFA3_TRISEL_Msk (0x7FUL << DMAC_CONFA3_TRISEL_Pos)
#define DMAC_CONFA3_TRISEL DMAC_CONFA3_TRISEL_Msk
#define DMAC_CONFA3_ST_Pos (29U)
#define DMAC_CONFA3_ST_Msk (0x1UL << DMAC_CONFA3_ST_Pos)
#define DMAC_CONFA3_ST DMAC_CONFA3_ST_Msk
#define DMAC_CONFA3_PAS_Pos (30U)
#define DMAC_CONFA3_PAS_Msk (0x1UL << DMAC_CONFA3_PAS_Pos)
#define DMAC_CONFA3_PAS DMAC_CONFA3_PAS_Msk
#define DMAC_CONFA3_ENS_Pos (31U)
#define DMAC_CONFA3_ENS_Msk (0x1UL << DMAC_CONFA3_ENS_Pos)
#define DMAC_CONFA3_ENS DMAC_CONFA3_ENS_Msk

// DMAC_CONFB3
#define DMAC_CONFB3_MSK_Pos (0U)
#define DMAC_CONFB3_MSK_Msk (0x1UL << DMAC_CONFB3_MSK_Pos)
#define DMAC_CONFB3_MSK DMAC_CONFB3_MSK_Msk
#define DMAC_CONFB3_STAT_Pos (16U)
#define DMAC_CONFB3_STAT_Msk (0x7UL << DMAC_CONFB3_STAT_Pos)
#define DMAC_CONFB3_STAT DMAC_CONFB3_STAT_Msk
#define DMAC_CONFB3_FISIE_Pos (19U)
#define DMAC_CONFB3_FISIE_Msk (0x1UL << DMAC_CONFB3_FISIE_Pos)
#define DMAC_CONFB3_FISIE DMAC_CONFB3_FISIE_Msk
#define DMAC_CONFB3_ERRIE_Pos (20U)
#define DMAC_CONFB3_ERRIE_Msk (0x1UL << DMAC_CONFB3_ERRIE_Pos)
#define DMAC_CONFB3_ERRIE DMAC_CONFB3_ERRIE_Msk
#define DMAC_CONFB3_RD_Pos (21U)
#define DMAC_CONFB3_RD_Msk (0x1UL << DMAC_CONFB3_RD_Pos)
#define DMAC_CONFB3_RD DMAC_CONFB3_RD_Msk
#define DMAC_CONFB3_RS_Pos (22U)
#define DMAC_CONFB3_RS_Msk (0x1UL << DMAC_CONFB3_RS_Pos)
#define DMAC_CONFB3_RS DMAC_CONFB3_RS_Msk
#define DMAC_CONFB3_RC_Pos (23U)
#define DMAC_CONFB3_RC_Msk (0x1UL << DMAC_CONFB3_RC_Pos)
#define DMAC_CONFB3_RC DMAC_CONFB3_RC_Msk
#define DMAC_CONFB3_FD_Pos (24U)
#define DMAC_CONFB3_FD_Msk (0x1UL << DMAC_CONFB3_FD_Pos)
#define DMAC_CONFB3_FD DMAC_CONFB3_FD_Msk
#define DMAC_CONFB3_FS_Pos (25U)
#define DMAC_CONFB3_FS_Msk (0x1UL << DMAC_CONFB3_FS_Pos)
#define DMAC_CONFB3_FS DMAC_CONFB3_FS_Msk
#define DMAC_CONFB3_WIDTH_Pos (26U)
#define DMAC_CONFB3_WIDTH_Msk (0x3UL << DMAC_CONFB3_WIDTH_Pos)
#define DMAC_CONFB3_WIDTH DMAC_CONFB3_WIDTH_Msk
#define DMAC_CONFB3_MODE_Pos (28U)
#define DMAC_CONFB3_MODE_Msk (0x3UL << DMAC_CONFB3_MODE_Pos)
#define DMAC_CONFB3_MODE DMAC_CONFB3_MODE_Msk

// DMAC_SRCADR3
#define DMAC_SRCADR3_SRCADR_Pos (0U)
#define DMAC_SRCADR3_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR3_SRCADR_Pos)
#define DMAC_SRCADR3_SRCADR DMAC_SRCADR3_SRCADR_Msk

// DMAC_DSTADR3
#define DMAC_DSTADR3_DSTADR_Pos (0U)
#define DMAC_DSTADR3_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR3_DSTADR_Pos)
#define DMAC_DSTADR3_DSTADR DMAC_DSTADR3_DSTADR_Msk

// DMAC_CONFA4
#define DMAC_CONFA4_TC_Pos (0U)
#define DMAC_CONFA4_TC_Msk (0xFFFFUL << DMAC_CONFA4_TC_Pos)
#define DMAC_CONFA4_TC DMAC_CONFA4_TC_Msk
#define DMAC_CONFA4_BC_Pos (16U)
#define DMAC_CONFA4_BC_Msk (0xFUL << DMAC_CONFA4_BC_Pos)
#define DMAC_CONFA4_BC DMAC_CONFA4_BC_Msk
#define DMAC_CONFA4_TRISEL_Pos (22U)
#define DMAC_CONFA4_TRISEL_Msk (0x7FUL << DMAC_CONFA4_TRISEL_Pos)
#define DMAC_CONFA4_TRISEL DMAC_CONFA4_TRISEL_Msk
#define DMAC_CONFA4_ST_Pos (29U)
#define DMAC_CONFA4_ST_Msk (0x1UL << DMAC_CONFA4_ST_Pos)
#define DMAC_CONFA4_ST DMAC_CONFA4_ST_Msk
#define DMAC_CONFA4_PAS_Pos (30U)
#define DMAC_CONFA4_PAS_Msk (0x1UL << DMAC_CONFA4_PAS_Pos)
#define DMAC_CONFA4_PAS DMAC_CONFA4_PAS_Msk
#define DMAC_CONFA4_ENS_Pos (31U)
#define DMAC_CONFA4_ENS_Msk (0x1UL << DMAC_CONFA4_ENS_Pos)
#define DMAC_CONFA4_ENS DMAC_CONFA4_ENS_Msk

