sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// DMAC_CONFB4
#define DMAC_CONFB4_MSK_Pos (0U)
#define DMAC_CONFB4_MSK_Msk (0x1UL << DMAC_CONFB4_MSK_Pos)
#define DMAC_CONFB4_MSK DMAC_CONFB4_MSK_Msk
#define DMAC_CONFB4_STAT_Pos (16U)
#define DMAC_CONFB4_STAT_Msk (0x7UL << DMAC_CONFB4_STAT_Pos)
#define DMAC_CONFB4_STAT DMAC_CONFB4_STAT_Msk
#define DMAC_CONFB4_FISIE_Pos (19U)
#define DMAC_CONFB4_FISIE_Msk (0x1UL << DMAC_CONFB4_FISIE_Pos)
#define DMAC_CONFB4_FISIE DMAC_CONFB4_FISIE_Msk
#define DMAC_CONFB4_ERRIE_Pos (20U)
#define DMAC_CONFB4_ERRIE_Msk (0x1UL << DMAC_CONFB4_ERRIE_Pos)
#define DMAC_CONFB4_ERRIE DMAC_CONFB4_ERRIE_Msk
#define DMAC_CONFB4_RD_Pos (21U)
#define DMAC_CONFB4_RD_Msk (0x1UL << DMAC_CONFB4_RD_Pos)
#define DMAC_CONFB4_RD DMAC_CONFB4_RD_Msk
#define DMAC_CONFB4_RS_Pos (22U)
#define DMAC_CONFB4_RS_Msk (0x1UL << DMAC_CONFB4_RS_Pos)
#define DMAC_CONFB4_RS DMAC_CONFB4_RS_Msk
#define DMAC_CONFB4_RC_Pos (23U)
#define DMAC_CONFB4_RC_Msk (0x1UL << DMAC_CONFB4_RC_Pos)
#define DMAC_CONFB4_RC DMAC_CONFB4_RC_Msk
#define DMAC_CONFB4_FD_Pos (24U)
#define DMAC_CONFB4_FD_Msk (0x1UL << DMAC_CONFB4_FD_Pos)
#define DMAC_CONFB4_FD DMAC_CONFB4_FD_Msk
#define DMAC_CONFB4_FS_Pos (25U)
#define DMAC_CONFB4_FS_Msk (0x1UL << DMAC_CONFB4_FS_Pos)
#define DMAC_CONFB4_FS DMAC_CONFB4_FS_Msk
#define DMAC_CONFB4_WIDTH_Pos (26U)
#define DMAC_CONFB4_WIDTH_Msk (0x3UL << DMAC_CONFB4_WIDTH_Pos)
#define DMAC_CONFB4_WIDTH DMAC_CONFB4_WIDTH_Msk
#define DMAC_CONFB4_MODE_Pos (28U)
#define DMAC_CONFB4_MODE_Msk (0x3UL << DMAC_CONFB4_MODE_Pos)
#define DMAC_CONFB4_MODE DMAC_CONFB4_MODE_Msk

// DMAC_SRCADR4
#define DMAC_SRCADR4_SRCADR_Pos (0U)
#define DMAC_SRCADR4_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR4_SRCADR_Pos)
#define DMAC_SRCADR4_SRCADR DMAC_SRCADR4_SRCADR_Msk

// DMAC_DSTADR4
#define DMAC_DSTADR4_DSTADR_Pos (0U)
#define DMAC_DSTADR4_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR4_DSTADR_Pos)
#define DMAC_DSTADR4_DSTADR DMAC_DSTADR4_DSTADR_Msk

// DMAC_CONFA5
#define DMAC_CONFA5_TC_Pos (0U)
#define DMAC_CONFA5_TC_Msk (0xFFFFUL << DMAC_CONFA5_TC_Pos)
#define DMAC_CONFA5_TC DMAC_CONFA5_TC_Msk
#define DMAC_CONFA5_BC_Pos (16U)
#define DMAC_CONFA5_BC_Msk (0xFUL << DMAC_CONFA5_BC_Pos)
#define DMAC_CONFA5_BC DMAC_CONFA5_BC_Msk
#define DMAC_CONFA5_TRISEL_Pos (22U)
#define DMAC_CONFA5_TRISEL_Msk (0x7FUL << DMAC_CONFA5_TRISEL_Pos)
#define DMAC_CONFA5_TRISEL DMAC_CONFA5_TRISEL_Msk
#define DMAC_CONFA5_ST_Pos (29U)
#define DMAC_CONFA5_ST_Msk (0x1UL << DMAC_CONFA5_ST_Pos)
#define DMAC_CONFA5_ST DMAC_CONFA5_ST_Msk
#define DMAC_CONFA5_PAS_Pos (30U)
#define DMAC_CONFA5_PAS_Msk (0x1UL << DMAC_CONFA5_PAS_Pos)
#define DMAC_CONFA5_PAS DMAC_CONFA5_PAS_Msk
#define DMAC_CONFA5_ENS_Pos (31U)
#define DMAC_CONFA5_ENS_Msk (0x1UL << DMAC_CONFA5_ENS_Pos)
#define DMAC_CONFA5_ENS DMAC_CONFA5_ENS_Msk

// DMAC_CONFB5
#define DMAC_CONFB5_MSK_Pos (0U)
#define DMAC_CONFB5_MSK_Msk (0x1UL << DMAC_CONFB5_MSK_Pos)
#define DMAC_CONFB5_MSK DMAC_CONFB5_MSK_Msk
#define DMAC_CONFB5_STAT_Pos (16U)
#define DMAC_CONFB5_STAT_Msk (0x7UL << DMAC_CONFB5_STAT_Pos)
#define DMAC_CONFB5_STAT DMAC_CONFB5_STAT_Msk
#define DMAC_CONFB5_FISIE_Pos (19U)
#define DMAC_CONFB5_FISIE_Msk (0x1UL << DMAC_CONFB5_FISIE_Pos)
#define DMAC_CONFB5_FISIE DMAC_CONFB5_FISIE_Msk
#define DMAC_CONFB5_ERRIE_Pos (20U)
#define DMAC_CONFB5_ERRIE_Msk (0x1UL << DMAC_CONFB5_ERRIE_Pos)
#define DMAC_CONFB5_ERRIE DMAC_CONFB5_ERRIE_Msk
#define DMAC_CONFB5_RD_Pos (21U)
#define DMAC_CONFB5_RD_Msk (0x1UL << DMAC_CONFB5_RD_Pos)
#define DMAC_CONFB5_RD DMAC_CONFB5_RD_Msk
#define DMAC_CONFB5_RS_Pos (22U)
#define DMAC_CONFB5_RS_Msk (0x1UL << DMAC_CONFB5_RS_Pos)
#define DMAC_CONFB5_RS DMAC_CONFB5_RS_Msk
#define DMAC_CONFB5_RC_Pos (23U)
#define DMAC_CONFB5_RC_Msk (0x1UL << DMAC_CONFB5_RC_Pos)
#define DMAC_CONFB5_RC DMAC_CONFB5_RC_Msk
#define DMAC_CONFB5_FD_Pos (24U)
#define DMAC_CONFB5_FD_Msk (0x1UL << DMAC_CONFB5_FD_Pos)
#define DMAC_CONFB5_FD DMAC_CONFB5_FD_Msk
#define DMAC_CONFB5_FS_Pos (25U)
#define DMAC_CONFB5_FS_Msk (0x1UL << DMAC_CONFB5_FS_Pos)
#define DMAC_CONFB5_FS DMAC_CONFB5_FS_Msk
#define DMAC_CONFB5_WIDTH_Pos (26U)
#define DMAC_CONFB5_WIDTH_Msk (0x3UL << DMAC_CONFB5_WIDTH_Pos)
#define DMAC_CONFB5_WIDTH DMAC_CONFB5_WIDTH_Msk
#define DMAC_CONFB5_MODE_Pos (28U)
#define DMAC_CONFB5_MODE_Msk (0x3UL << DMAC_CONFB5_MODE_Pos)
#define DMAC_CONFB5_MODE DMAC_CONFB5_MODE_Msk

// DMAC_SRCADR5
#define DMAC_SRCADR5_SRCADR_Pos (0U)
#define DMAC_SRCADR5_SRCADR_Msk (0xFFFFFFFFUL << DMAC_SRCADR5_SRCADR_Pos)
#define DMAC_SRCADR5_SRCADR DMAC_SRCADR5_SRCADR_Msk

// DMAC_DSTADR5
#define DMAC_DSTADR5_DSTADR_Pos (0U)
#define DMAC_DSTADR5_DSTADR_Msk (0xFFFFFFFFUL << DMAC_DSTADR5_DSTADR_Pos)
#define DMAC_DSTADR5_DSTADR DMAC_DSTADR5_DSTADR_Msk

//********************    Bits Define For Peripheral EAU    ********************//
// EAU_CSR
#define EAU_CSR_MODE_Pos (0U)
#define EAU_CSR_MODE_Msk (0x3UL << EAU_CSR_MODE_Pos)
#define EAU_CSR_MODE EAU_CSR_MODE_Msk
#define EAU_CSR_OVR_Pos (2U)
#define EAU_CSR_OVR_Msk (0x1UL << EAU_CSR_OVR_Pos)
#define EAU_CSR_OVR EAU_CSR_OVR_Msk
#define EAU_CSR_ZERO_Pos (3U)
#define EAU_CSR_ZERO_Msk (0x1UL << EAU_CSR_ZERO_Pos)
#define EAU_CSR_ZERO EAU_CSR_ZERO_Msk
#define EAU_CSR_BUSY_Pos (4U)
#define EAU_CSR_BUSY_Msk (0x1UL << EAU_CSR_BUSY_Pos)
#define EAU_CSR_BUSY EAU_CSR_BUSY_Msk

// EAU_DIVIDEND
#define EAU_DIVIDEND_DIVIDEND_Pos (0U)
#define EAU_DIVIDEND_DIVIDEND_Msk (0xFFFFFFFFUL << EAU_DIVIDEND_DIVIDEND_Pos)
#define EAU_DIVIDEND_DIVIDEND EAU_DIVIDEND_DIVIDEND_Msk

// EAU_DIVISOR
#define EAU_DIVISOR_DIVISOR_Pos (0U)
#define EAU_DIVISOR_DIVISOR_Msk (0xFFFFFFFFUL << EAU_DIVISOR_DIVISOR_Pos)
#define EAU_DIVISOR_DIVISOR EAU_DIVISOR_DIVISOR_Msk

// EAU_QUOTIENT
#define EAU_QUOTIENT_QUOTIENT_Pos (0U)
#define EAU_QUOTIENT_QUOTIENT_Msk (0xFFFFFFFFUL << EAU_QUOTIENT_QUOTIENT_Pos)
#define EAU_QUOTIENT_QUOTIENT EAU_QUOTIENT_QUOTIENT_Msk

// EAU_REMAINDER
#define EAU_REMAINDER_REMAINDER_Pos (0U)
#define EAU_REMAINDER_REMAINDER_Msk (0xFFFFFFFFUL << EAU_REMAINDER_REMAINDER_Pos)
#define EAU_REMAINDER_REMAINDER EAU_REMAINDER_REMAINDER_Msk

