sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
//********************    Bits Define For Peripheral FLASH    ********************//
// FLASH_CR
#define FLASH_CR_OP_Pos (0U)
#define FLASH_CR_OP_Msk (0x7UL << FLASH_CR_OP_Pos)
#define FLASH_CR_OP FLASH_CR_OP_Msk
#define FLASH_CR_FWUP_Pos (4U)
#define FLASH_CR_FWUP_Msk (0x1UL << FLASH_CR_FWUP_Pos)
#define FLASH_CR_FWUP FLASH_CR_FWUP_Msk
#define FLASH_CR_ROMD_Pos (5U)
#define FLASH_CR_ROMD_Msk (0x1UL << FLASH_CR_ROMD_Pos)
#define FLASH_CR_ROMD FLASH_CR_ROMD_Msk
#define FLASH_CR_DPSTBEN_Pos (7U)
#define FLASH_CR_DPSTBEN_Msk (0x1UL << FLASH_CR_DPSTBEN_Pos)
#define FLASH_CR_DPSTBEN FLASH_CR_DPSTBEN_Msk

// FLASH_WAIT
#define FLASH_WAIT_WAIT_Pos (0U)
#define FLASH_WAIT_WAIT_Msk (0x7UL << FLASH_WAIT_WAIT_Pos)
#define FLASH_WAIT_WAIT FLASH_WAIT_WAIT_Msk

// FLASH_LOCKST
#define FLASH_LOCKST_STATE_Pos (0U)
#define FLASH_LOCKST_STATE_Msk (0x3UL << FLASH_LOCKST_STATE_Pos)
#define FLASH_LOCKST_STATE FLASH_LOCKST_STATE_Msk

// FLASH_IER
#define FLASH_IER_PC_Pos (0U)
#define FLASH_IER_PC_Msk (0x1UL << FLASH_IER_PC_Pos)
#define FLASH_IER_PC FLASH_IER_PC_Msk
#define FLASH_IER_PROT_Pos (1U)
#define FLASH_IER_PROT_Msk (0x1UL << FLASH_IER_PROT_Pos)
#define FLASH_IER_PROT FLASH_IER_PROT_Msk

// FLASH_IFR
#define FLASH_IFR_PC_Pos (0U)
#define FLASH_IFR_PC_Msk (0x1UL << FLASH_IFR_PC_Pos)
#define FLASH_IFR_PC FLASH_IFR_PC_Msk
#define FLASH_IFR_PROT_Pos (1U)
#define FLASH_IFR_PROT_Msk (0x1UL << FLASH_IFR_PROT_Pos)
#define FLASH_IFR_PROT FLASH_IFR_PROT_Msk
#define FLASH_IFR_BUSY_Pos (4U)
#define FLASH_IFR_BUSY_Msk (0x1UL << FLASH_IFR_BUSY_Pos)
#define FLASH_IFR_BUSY FLASH_IFR_BUSY_Msk
#define FLASH_IFR_CFDONE_Pos (5U)
#define FLASH_IFR_CFDONE_Msk (0x1UL << FLASH_IFR_CFDONE_Pos)
#define FLASH_IFR_CFDONE FLASH_IFR_CFDONE_Msk

// FLASH_ICR
#define FLASH_ICR_PC_Pos (0U)
#define FLASH_ICR_PC_Msk (0x1UL << FLASH_ICR_PC_Pos)
#define FLASH_ICR_PC FLASH_ICR_PC_Msk
#define FLASH_ICR_PROT_Pos (1U)
#define FLASH_ICR_PROT_Msk (0x1UL << FLASH_ICR_PROT_Pos)
#define FLASH_ICR_PROT FLASH_ICR_PROT_Msk

// FLASH_BYPASS
#define FLASH_BYPASS_BYSEQ_Pos (0U)
#define FLASH_BYPASS_BYSEQ_Msk (0xFFFFUL << FLASH_BYPASS_BYSEQ_Pos)
#define FLASH_BYPASS_BYSEQ FLASH_BYPASS_BYSEQ_Msk

// FLASH_SLOCK0
#define FLASH_SLOCK0_SLOCK_Pos (0U)
#define FLASH_SLOCK0_SLOCK_Msk (0xFFFFFFFFUL << FLASH_SLOCK0_SLOCK_Pos)
#define FLASH_SLOCK0_SLOCK FLASH_SLOCK0_SLOCK_Msk

// FLASH_SLOCK1
#define FLASH_SLOCK1_SLOCK_Pos (0U)
#define FLASH_SLOCK1_SLOCK_Msk (0xFFFFFFFFUL << FLASH_SLOCK1_SLOCK_Pos)
#define FLASH_SLOCK1_SLOCK FLASH_SLOCK1_SLOCK_Msk

//********************    Bits Define For Peripheral GPIO    ********************//
// GPIO_ADS
#define GPIO_ADS_PIN0_Pos (0U)
#define GPIO_ADS_PIN0_Msk (0x1UL << GPIO_ADS_PIN0_Pos)
#define GPIO_ADS_PIN0 GPIO_ADS_PIN0_Msk
#define GPIO_ADS_PIN1_Pos (1U)
#define GPIO_ADS_PIN1_Msk (0x1UL << GPIO_ADS_PIN1_Pos)
#define GPIO_ADS_PIN1 GPIO_ADS_PIN1_Msk
#define GPIO_ADS_PIN2_Pos (2U)
#define GPIO_ADS_PIN2_Msk (0x1UL << GPIO_ADS_PIN2_Pos)
#define GPIO_ADS_PIN2 GPIO_ADS_PIN2_Msk
#define GPIO_ADS_PIN3_Pos (3U)
#define GPIO_ADS_PIN3_Msk (0x1UL << GPIO_ADS_PIN3_Pos)
#define GPIO_ADS_PIN3 GPIO_ADS_PIN3_Msk
#define GPIO_ADS_PIN4_Pos (4U)
#define GPIO_ADS_PIN4_Msk (0x1UL << GPIO_ADS_PIN4_Pos)
#define GPIO_ADS_PIN4 GPIO_ADS_PIN4_Msk
#define GPIO_ADS_PIN5_Pos (5U)
#define GPIO_ADS_PIN5_Msk (0x1UL << GPIO_ADS_PIN5_Pos)
#define GPIO_ADS_PIN5 GPIO_ADS_PIN5_Msk
#define GPIO_ADS_PIN6_Pos (6U)
#define GPIO_ADS_PIN6_Msk (0x1UL << GPIO_ADS_PIN6_Pos)
#define GPIO_ADS_PIN6 GPIO_ADS_PIN6_Msk
#define GPIO_ADS_PIN7_Pos (7U)
#define GPIO_ADS_PIN7_Msk (0x1UL << GPIO_ADS_PIN7_Pos)
#define GPIO_ADS_PIN7 GPIO_ADS_PIN7_Msk
#define GPIO_ADS_PIN8_Pos (8U)
#define GPIO_ADS_PIN8_Msk (0x1UL << GPIO_ADS_PIN8_Pos)
#define GPIO_ADS_PIN8 GPIO_ADS_PIN8_Msk
#define GPIO_ADS_PIN9_Pos (9U)
#define GPIO_ADS_PIN9_Msk (0x1UL << GPIO_ADS_PIN9_Pos)
#define GPIO_ADS_PIN9 GPIO_ADS_PIN9_Msk
#define GPIO_ADS_PIN10_Pos (10U)
#define GPIO_ADS_PIN10_Msk (0x1UL << GPIO_ADS_PIN10_Pos)
#define GPIO_ADS_PIN10 GPIO_ADS_PIN10_Msk
#define GPIO_ADS_PIN11_Pos (11U)
#define GPIO_ADS_PIN11_Msk (0x1UL << GPIO_ADS_PIN11_Pos)
#define GPIO_ADS_PIN11 GPIO_ADS_PIN11_Msk
#define GPIO_ADS_PIN12_Pos (12U)
#define GPIO_ADS_PIN12_Msk (0x1UL << GPIO_ADS_PIN12_Pos)
#define GPIO_ADS_PIN12 GPIO_ADS_PIN12_Msk
#define GPIO_ADS_PIN13_Pos (13U)
#define GPIO_ADS_PIN13_Msk (0x1UL << GPIO_ADS_PIN13_Pos)
#define GPIO_ADS_PIN13 GPIO_ADS_PIN13_Msk
#define GPIO_ADS_PIN14_Pos (14U)
#define GPIO_ADS_PIN14_Msk (0x1UL << GPIO_ADS_PIN14_Pos)
#define GPIO_ADS_PIN14 GPIO_ADS_PIN14_Msk
#define GPIO_ADS_PIN15_Pos (15U)
#define GPIO_ADS_PIN15_Msk (0x1UL << GPIO_ADS_PIN15_Pos)
#define GPIO_ADS_PIN15 GPIO_ADS_PIN15_Msk

// GPIO_DIR
#define GPIO_DIR_PIN0_Pos (0U)
#define GPIO_DIR_PIN0_Msk (0x1UL << GPIO_DIR_PIN0_Pos)
#define GPIO_DIR_PIN0 GPIO_DIR_PIN0_Msk
#define GPIO_DIR_PIN1_Pos (1U)
#define GPIO_DIR_PIN1_Msk (0x1UL << GPIO_DIR_PIN1_Pos)
#define GPIO_DIR_PIN1 GPIO_DIR_PIN1_Msk
#define GPIO_DIR_PIN2_Pos (2U)
#define GPIO_DIR_PIN2_Msk (0x1UL << GPIO_DIR_PIN2_Pos)
#define GPIO_DIR_PIN2 GPIO_DIR_PIN2_Msk
#define GPIO_DIR_PIN3_Pos (3U)
#define GPIO_DIR_PIN3_Msk (0x1UL << GPIO_DIR_PIN3_Pos)
#define GPIO_DIR_PIN3 GPIO_DIR_PIN3_Msk
#define GPIO_DIR_PIN4_Pos (4U)
#define GPIO_DIR_PIN4_Msk (0x1UL << GPIO_DIR_PIN4_Pos)
#define GPIO_DIR_PIN4 GPIO_DIR_PIN4_Msk
#define GPIO_DIR_PIN5_Pos (5U)
#define GPIO_DIR_PIN5_Msk (0x1UL << GPIO_DIR_PIN5_Pos)
#define GPIO_DIR_PIN5 GPIO_DIR_PIN5_Msk
#define GPIO_DIR_PIN6_Pos (6U)
#define GPIO_DIR_PIN6_Msk (0x1UL << GPIO_DIR_PIN6_Pos)
#define GPIO_DIR_PIN6 GPIO_DIR_PIN6_Msk
#define GPIO_DIR_PIN7_Pos (7U)
#define GPIO_DIR_PIN7_Msk (0x1UL << GPIO_DIR_PIN7_Pos)
#define GPIO_DIR_PIN7 GPIO_DIR_PIN7_Msk
#define GPIO_DIR_PIN8_Pos (8U)
#define GPIO_DIR_PIN8_Msk (0x1UL << GPIO_DIR_PIN8_Pos)
#define GPIO_DIR_PIN8 GPIO_DIR_PIN8_Msk
#define GPIO_DIR_PIN9_Pos (9U)
#define GPIO_DIR_PIN9_Msk (0x1UL << GPIO_DIR_PIN9_Pos)
#define GPIO_DIR_PIN9 GPIO_DIR_PIN9_Msk
#define GPIO_DIR_PIN10_Pos (10U)
#define GPIO_DIR_PIN10_Msk (0x1UL << GPIO_DIR_PIN10_Pos)
#define GPIO_DIR_PIN10 GPIO_DIR_PIN10_Msk
#define GPIO_DIR_PIN11_Pos (11U)
#define GPIO_DIR_PIN11_Msk (0x1UL << GPIO_DIR_PIN11_Pos)
#define GPIO_DIR_PIN11 GPIO_DIR_PIN11_Msk
#define GPIO_DIR_PIN12_Pos (12U)
#define GPIO_DIR_PIN12_Msk (0x1UL << GPIO_DIR_PIN12_Pos)
#define GPIO_DIR_PIN12 GPIO_DIR_PIN12_Msk
#define GPIO_DIR_PIN13_Pos (13U)
#define GPIO_DIR_PIN13_Msk (0x1UL << GPIO_DIR_PIN13_Pos)
#define GPIO_DIR_PIN13 GPIO_DIR_PIN13_Msk
#define GPIO_DIR_PIN14_Pos (14U)
#define GPIO_DIR_PIN14_Msk (0x1UL << GPIO_DIR_PIN14_Pos)
#define GPIO_DIR_PIN14 GPIO_DIR_PIN14_Msk
#define GPIO_DIR_PIN15_Pos (15U)
#define GPIO_DIR_PIN15_Msk (0x1UL << GPIO_DIR_PIN15_Pos)
#define GPIO_DIR_PIN15 GPIO_DIR_PIN15_Msk

