sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// GPIO_OPENDRAIN
#define GPIO_OPENDRAIN_PIN0_Pos (0U)
#define GPIO_OPENDRAIN_PIN0_Msk (0x1UL << GPIO_OPENDRAIN_PIN0_Pos)
#define GPIO_OPENDRAIN_PIN0 GPIO_OPENDRAIN_PIN0_Msk
#define GPIO_OPENDRAIN_PIN1_Pos (1U)
#define GPIO_OPENDRAIN_PIN1_Msk (0x1UL << GPIO_OPENDRAIN_PIN1_Pos)
#define GPIO_OPENDRAIN_PIN1 GPIO_OPENDRAIN_PIN1_Msk
#define GPIO_OPENDRAIN_PIN2_Pos (2U)
#define GPIO_OPENDRAIN_PIN2_Msk (0x1UL << GPIO_OPENDRAIN_PIN2_Pos)
#define GPIO_OPENDRAIN_PIN2 GPIO_OPENDRAIN_PIN2_Msk
#define GPIO_OPENDRAIN_PIN3_Pos (3U)
#define GPIO_OPENDRAIN_PIN3_Msk (0x1UL << GPIO_OPENDRAIN_PIN3_Pos)
#define GPIO_OPENDRAIN_PIN3 GPIO_OPENDRAIN_PIN3_Msk
#define GPIO_OPENDRAIN_PIN4_Pos (4U)
#define GPIO_OPENDRAIN_PIN4_Msk (0x1UL << GPIO_OPENDRAIN_PIN4_Pos)
#define GPIO_OPENDRAIN_PIN4 GPIO_OPENDRAIN_PIN4_Msk
#define GPIO_OPENDRAIN_PIN5_Pos (5U)
#define GPIO_OPENDRAIN_PIN5_Msk (0x1UL << GPIO_OPENDRAIN_PIN5_Pos)
#define GPIO_OPENDRAIN_PIN5 GPIO_OPENDRAIN_PIN5_Msk
#define GPIO_OPENDRAIN_PIN6_Pos (6U)
#define GPIO_OPENDRAIN_PIN6_Msk (0x1UL << GPIO_OPENDRAIN_PIN6_Pos)
#define GPIO_OPENDRAIN_PIN6 GPIO_OPENDRAIN_PIN6_Msk
#define GPIO_OPENDRAIN_PIN7_Pos (7U)
#define GPIO_OPENDRAIN_PIN7_Msk (0x1UL << GPIO_OPENDRAIN_PIN7_Pos)
#define GPIO_OPENDRAIN_PIN7 GPIO_OPENDRAIN_PIN7_Msk
#define GPIO_OPENDRAIN_PIN8_Pos (8U)
#define GPIO_OPENDRAIN_PIN8_Msk (0x1UL << GPIO_OPENDRAIN_PIN8_Pos)
#define GPIO_OPENDRAIN_PIN8 GPIO_OPENDRAIN_PIN8_Msk
#define GPIO_OPENDRAIN_PIN9_Pos (9U)
#define GPIO_OPENDRAIN_PIN9_Msk (0x1UL << GPIO_OPENDRAIN_PIN9_Pos)
#define GPIO_OPENDRAIN_PIN9 GPIO_OPENDRAIN_PIN9_Msk
#define GPIO_OPENDRAIN_PIN10_Pos (10U)
#define GPIO_OPENDRAIN_PIN10_Msk (0x1UL << GPIO_OPENDRAIN_PIN10_Pos)
#define GPIO_OPENDRAIN_PIN10 GPIO_OPENDRAIN_PIN10_Msk
#define GPIO_OPENDRAIN_PIN11_Pos (11U)
#define GPIO_OPENDRAIN_PIN11_Msk (0x1UL << GPIO_OPENDRAIN_PIN11_Pos)
#define GPIO_OPENDRAIN_PIN11 GPIO_OPENDRAIN_PIN11_Msk
#define GPIO_OPENDRAIN_PIN12_Pos (12U)
#define GPIO_OPENDRAIN_PIN12_Msk (0x1UL << GPIO_OPENDRAIN_PIN12_Pos)
#define GPIO_OPENDRAIN_PIN12 GPIO_OPENDRAIN_PIN12_Msk
#define GPIO_OPENDRAIN_PIN13_Pos (13U)
#define GPIO_OPENDRAIN_PIN13_Msk (0x1UL << GPIO_OPENDRAIN_PIN13_Pos)
#define GPIO_OPENDRAIN_PIN13 GPIO_OPENDRAIN_PIN13_Msk
#define GPIO_OPENDRAIN_PIN14_Pos (14U)
#define GPIO_OPENDRAIN_PIN14_Msk (0x1UL << GPIO_OPENDRAIN_PIN14_Pos)
#define GPIO_OPENDRAIN_PIN14 GPIO_OPENDRAIN_PIN14_Msk
#define GPIO_OPENDRAIN_PIN15_Pos (15U)
#define GPIO_OPENDRAIN_PIN15_Msk (0x1UL << GPIO_OPENDRAIN_PIN15_Pos)
#define GPIO_OPENDRAIN_PIN15 GPIO_OPENDRAIN_PIN15_Msk

// GPIO_DRIVER
#define GPIO_DRIVER_PIN0_Pos (0U)
#define GPIO_DRIVER_PIN0_Msk (0x1UL << GPIO_DRIVER_PIN0_Pos)
#define GPIO_DRIVER_PIN0 GPIO_DRIVER_PIN0_Msk
#define GPIO_DRIVER_PIN1_Pos (1U)
#define GPIO_DRIVER_PIN1_Msk (0x1UL << GPIO_DRIVER_PIN1_Pos)
#define GPIO_DRIVER_PIN1 GPIO_DRIVER_PIN1_Msk
#define GPIO_DRIVER_PIN2_Pos (2U)
#define GPIO_DRIVER_PIN2_Msk (0x1UL << GPIO_DRIVER_PIN2_Pos)
#define GPIO_DRIVER_PIN2 GPIO_DRIVER_PIN2_Msk
#define GPIO_DRIVER_PIN3_Pos (3U)
#define GPIO_DRIVER_PIN3_Msk (0x1UL << GPIO_DRIVER_PIN3_Pos)
#define GPIO_DRIVER_PIN3 GPIO_DRIVER_PIN3_Msk
#define GPIO_DRIVER_PIN4_Pos (4U)
#define GPIO_DRIVER_PIN4_Msk (0x1UL << GPIO_DRIVER_PIN4_Pos)
#define GPIO_DRIVER_PIN4 GPIO_DRIVER_PIN4_Msk
#define GPIO_DRIVER_PIN5_Pos (5U)
#define GPIO_DRIVER_PIN5_Msk (0x1UL << GPIO_DRIVER_PIN5_Pos)
#define GPIO_DRIVER_PIN5 GPIO_DRIVER_PIN5_Msk
#define GPIO_DRIVER_PIN6_Pos (6U)
#define GPIO_DRIVER_PIN6_Msk (0x1UL << GPIO_DRIVER_PIN6_Pos)
#define GPIO_DRIVER_PIN6 GPIO_DRIVER_PIN6_Msk
#define GPIO_DRIVER_PIN7_Pos (7U)
#define GPIO_DRIVER_PIN7_Msk (0x1UL << GPIO_DRIVER_PIN7_Pos)
#define GPIO_DRIVER_PIN7 GPIO_DRIVER_PIN7_Msk
#define GPIO_DRIVER_PIN8_Pos (8U)
#define GPIO_DRIVER_PIN8_Msk (0x1UL << GPIO_DRIVER_PIN8_Pos)
#define GPIO_DRIVER_PIN8 GPIO_DRIVER_PIN8_Msk
#define GPIO_DRIVER_PIN9_Pos (9U)
#define GPIO_DRIVER_PIN9_Msk (0x1UL << GPIO_DRIVER_PIN9_Pos)
#define GPIO_DRIVER_PIN9 GPIO_DRIVER_PIN9_Msk
#define GPIO_DRIVER_PIN10_Pos (10U)
#define GPIO_DRIVER_PIN10_Msk (0x1UL << GPIO_DRIVER_PIN10_Pos)
#define GPIO_DRIVER_PIN10 GPIO_DRIVER_PIN10_Msk
#define GPIO_DRIVER_PIN11_Pos (11U)
#define GPIO_DRIVER_PIN11_Msk (0x1UL << GPIO_DRIVER_PIN11_Pos)
#define GPIO_DRIVER_PIN11 GPIO_DRIVER_PIN11_Msk
#define GPIO_DRIVER_PIN12_Pos (12U)
#define GPIO_DRIVER_PIN12_Msk (0x1UL << GPIO_DRIVER_PIN12_Pos)
#define GPIO_DRIVER_PIN12 GPIO_DRIVER_PIN12_Msk
#define GPIO_DRIVER_PIN13_Pos (13U)
#define GPIO_DRIVER_PIN13_Msk (0x1UL << GPIO_DRIVER_PIN13_Pos)
#define GPIO_DRIVER_PIN13 GPIO_DRIVER_PIN13_Msk
#define GPIO_DRIVER_PIN14_Pos (14U)
#define GPIO_DRIVER_PIN14_Msk (0x1UL << GPIO_DRIVER_PIN14_Pos)
#define GPIO_DRIVER_PIN14 GPIO_DRIVER_PIN14_Msk
#define GPIO_DRIVER_PIN15_Pos (15U)
#define GPIO_DRIVER_PIN15_Msk (0x1UL << GPIO_DRIVER_PIN15_Pos)
#define GPIO_DRIVER_PIN15 GPIO_DRIVER_PIN15_Msk

// GPIO_PUPD
#define GPIO_PUPD_PUPIN0_Pos (0U)
#define GPIO_PUPD_PUPIN0_Msk (0x1UL << GPIO_PUPD_PUPIN0_Pos)
#define GPIO_PUPD_PUPIN0 GPIO_PUPD_PUPIN0_Msk
#define GPIO_PUPD_PUPIN1_Pos (1U)
#define GPIO_PUPD_PUPIN1_Msk (0x1UL << GPIO_PUPD_PUPIN1_Pos)
#define GPIO_PUPD_PUPIN1 GPIO_PUPD_PUPIN1_Msk
#define GPIO_PUPD_PUPIN2_Pos (2U)
#define GPIO_PUPD_PUPIN2_Msk (0x1UL << GPIO_PUPD_PUPIN2_Pos)
#define GPIO_PUPD_PUPIN2 GPIO_PUPD_PUPIN2_Msk
#define GPIO_PUPD_PUPIN3_Pos (3U)
#define GPIO_PUPD_PUPIN3_Msk (0x1UL << GPIO_PUPD_PUPIN3_Pos)
#define GPIO_PUPD_PUPIN3 GPIO_PUPD_PUPIN3_Msk
#define GPIO_PUPD_PUPIN4_Pos (4U)
#define GPIO_PUPD_PUPIN4_Msk (0x1UL << GPIO_PUPD_PUPIN4_Pos)
#define GPIO_PUPD_PUPIN4 GPIO_PUPD_PUPIN4_Msk
#define GPIO_PUPD_PUPIN5_Pos (5U)
#define GPIO_PUPD_PUPIN5_Msk (0x1UL << GPIO_PUPD_PUPIN5_Pos)
#define GPIO_PUPD_PUPIN5 GPIO_PUPD_PUPIN5_Msk
#define GPIO_PUPD_PUPIN6_Pos (6U)
#define GPIO_PUPD_PUPIN6_Msk (0x1UL << GPIO_PUPD_PUPIN6_Pos)
#define GPIO_PUPD_PUPIN6 GPIO_PUPD_PUPIN6_Msk
#define GPIO_PUPD_PUPIN7_Pos (7U)
#define GPIO_PUPD_PUPIN7_Msk (0x1UL << GPIO_PUPD_PUPIN7_Pos)
#define GPIO_PUPD_PUPIN7 GPIO_PUPD_PUPIN7_Msk
#define GPIO_PUPD_PUPIN8_Pos (8U)
#define GPIO_PUPD_PUPIN8_Msk (0x1UL << GPIO_PUPD_PUPIN8_Pos)
#define GPIO_PUPD_PUPIN8 GPIO_PUPD_PUPIN8_Msk
#define GPIO_PUPD_PUPIN9_Pos (9U)
#define GPIO_PUPD_PUPIN9_Msk (0x1UL << GPIO_PUPD_PUPIN9_Pos)
#define GPIO_PUPD_PUPIN9 GPIO_PUPD_PUPIN9_Msk
#define GPIO_PUPD_PUPIN10_Pos (10U)
#define GPIO_PUPD_PUPIN10_Msk (0x1UL << GPIO_PUPD_PUPIN10_Pos)
#define GPIO_PUPD_PUPIN10 GPIO_PUPD_PUPIN10_Msk
#define GPIO_PUPD_PUPIN11_Pos (11U)
#define GPIO_PUPD_PUPIN11_Msk (0x1UL << GPIO_PUPD_PUPIN11_Pos)
#define GPIO_PUPD_PUPIN11 GPIO_PUPD_PUPIN11_Msk
#define GPIO_PUPD_PUPIN12_Pos (12U)
#define GPIO_PUPD_PUPIN12_Msk (0x1UL << GPIO_PUPD_PUPIN12_Pos)
#define GPIO_PUPD_PUPIN12 GPIO_PUPD_PUPIN12_Msk
#define GPIO_PUPD_PUPIN13_Pos (13U)
#define GPIO_PUPD_PUPIN13_Msk (0x1UL << GPIO_PUPD_PUPIN13_Pos)
#define GPIO_PUPD_PUPIN13 GPIO_PUPD_PUPIN13_Msk
#define GPIO_PUPD_PUPIN14_Pos (14U)
#define GPIO_PUPD_PUPIN14_Msk (0x1UL << GPIO_PUPD_PUPIN14_Pos)
#define GPIO_PUPD_PUPIN14 GPIO_PUPD_PUPIN14_Msk
#define GPIO_PUPD_PUPIN15_Pos (15U)
#define GPIO_PUPD_PUPIN15_Msk (0x1UL << GPIO_PUPD_PUPIN15_Pos)
#define GPIO_PUPD_PUPIN15 GPIO_PUPD_PUPIN15_Msk
#define GPIO_PUPD_PDPIN0_Pos (16U)
#define GPIO_PUPD_PDPIN0_Msk (0x1UL << GPIO_PUPD_PDPIN0_Pos)
#define GPIO_PUPD_PDPIN0 GPIO_PUPD_PDPIN0_Msk
#define GPIO_PUPD_PDPIN1_Pos (17U)
#define GPIO_PUPD_PDPIN1_Msk (0x1UL << GPIO_PUPD_PDPIN1_Pos)
#define GPIO_PUPD_PDPIN1 GPIO_PUPD_PDPIN1_Msk
#define GPIO_PUPD_PDPIN2_Pos (18U)
#define GPIO_PUPD_PDPIN2_Msk (0x1UL << GPIO_PUPD_PDPIN2_Pos)
#define GPIO_PUPD_PDPIN2 GPIO_PUPD_PDPIN2_Msk
#define GPIO_PUPD_PDPIN3_Pos (19U)
#define GPIO_PUPD_PDPIN3_Msk (0x1UL << GPIO_PUPD_PDPIN3_Pos)
#define GPIO_PUPD_PDPIN3 GPIO_PUPD_PDPIN3_Msk
#define GPIO_PUPD_PDPIN4_Pos (20U)
#define GPIO_PUPD_PDPIN4_Msk (0x1UL << GPIO_PUPD_PDPIN4_Pos)
#define GPIO_PUPD_PDPIN4 GPIO_PUPD_PDPIN4_Msk
#define GPIO_PUPD_PDPIN5_Pos (21U)
#define GPIO_PUPD_PDPIN5_Msk (0x1UL << GPIO_PUPD_PDPIN5_Pos)
#define GPIO_PUPD_PDPIN5 GPIO_PUPD_PDPIN5_Msk
#define GPIO_PUPD_PDPIN6_Pos (22U)
#define GPIO_PUPD_PDPIN6_Msk (0x1UL << GPIO_PUPD_PDPIN6_Pos)
#define GPIO_PUPD_PDPIN6 GPIO_PUPD_PDPIN6_Msk
#define GPIO_PUPD_PDPIN7_Pos (23U)
#define GPIO_PUPD_PDPIN7_Msk (0x1UL << GPIO_PUPD_PDPIN7_Pos)
#define GPIO_PUPD_PDPIN7 GPIO_PUPD_PDPIN7_Msk
#define GPIO_PUPD_PDPIN8_Pos (24U)
#define GPIO_PUPD_PDPIN8_Msk (0x1UL << GPIO_PUPD_PDPIN8_Pos)
#define GPIO_PUPD_PDPIN8 GPIO_PUPD_PDPIN8_Msk
#define GPIO_PUPD_PDPIN9_Pos (25U)
#define GPIO_PUPD_PDPIN9_Msk (0x1UL << GPIO_PUPD_PDPIN9_Pos)
#define GPIO_PUPD_PDPIN9 GPIO_PUPD_PDPIN9_Msk
#define GPIO_PUPD_PDPIN10_Pos (26U)
#define GPIO_PUPD_PDPIN10_Msk (0x1UL << GPIO_PUPD_PDPIN10_Pos)
#define GPIO_PUPD_PDPIN10 GPIO_PUPD_PDPIN10_Msk
#define GPIO_PUPD_PDPIN11_Pos (27U)
#define GPIO_PUPD_PDPIN11_Msk (0x1UL << GPIO_PUPD_PDPIN11_Pos)
#define GPIO_PUPD_PDPIN11 GPIO_PUPD_PDPIN11_Msk
#define GPIO_PUPD_PDPIN12_Pos (28U)
#define GPIO_PUPD_PDPIN12_Msk (0x1UL << GPIO_PUPD_PDPIN12_Pos)
#define GPIO_PUPD_PDPIN12 GPIO_PUPD_PDPIN12_Msk
#define GPIO_PUPD_PDPIN13_Pos (29U)
#define GPIO_PUPD_PDPIN13_Msk (0x1UL << GPIO_PUPD_PDPIN13_Pos)
#define GPIO_PUPD_PDPIN13 GPIO_PUPD_PDPIN13_Msk
#define GPIO_PUPD_PDPIN14_Pos (30U)
#define GPIO_PUPD_PDPIN14_Msk (0x1UL << GPIO_PUPD_PDPIN14_Pos)
#define GPIO_PUPD_PDPIN14 GPIO_PUPD_PDPIN14_Msk
#define GPIO_PUPD_PDPIN15_Pos (31U)
#define GPIO_PUPD_PDPIN15_Msk (0x1UL << GPIO_PUPD_PDPIN15_Pos)
#define GPIO_PUPD_PDPIN15 GPIO_PUPD_PDPIN15_Msk

// GPIO_IN
#define GPIO_IN_PIN0_Pos (0U)
#define GPIO_IN_PIN0_Msk (0x1UL << GPIO_IN_PIN0_Pos)
#define GPIO_IN_PIN0 GPIO_IN_PIN0_Msk
#define GPIO_IN_PIN1_Pos (1U)
#define GPIO_IN_PIN1_Msk (0x1UL << GPIO_IN_PIN1_Pos)
#define GPIO_IN_PIN1 GPIO_IN_PIN1_Msk
#define GPIO_IN_PIN2_Pos (2U)
#define GPIO_IN_PIN2_Msk (0x1UL << GPIO_IN_PIN2_Pos)
#define GPIO_IN_PIN2 GPIO_IN_PIN2_Msk
#define GPIO_IN_PIN3_Pos (3U)
#define GPIO_IN_PIN3_Msk (0x1UL << GPIO_IN_PIN3_Pos)
#define GPIO_IN_PIN3 GPIO_IN_PIN3_Msk
#define GPIO_IN_PIN4_Pos (4U)
#define GPIO_IN_PIN4_Msk (0x1UL << GPIO_IN_PIN4_Pos)
#define GPIO_IN_PIN4 GPIO_IN_PIN4_Msk
#define GPIO_IN_PIN5_Pos (5U)
#define GPIO_IN_PIN5_Msk (0x1UL << GPIO_IN_PIN5_Pos)
#define GPIO_IN_PIN5 GPIO_IN_PIN5_Msk
#define GPIO_IN_PIN6_Pos (6U)
#define GPIO_IN_PIN6_Msk (0x1UL << GPIO_IN_PIN6_Pos)
#define GPIO_IN_PIN6 GPIO_IN_PIN6_Msk
#define GPIO_IN_PIN7_Pos (7U)
#define GPIO_IN_PIN7_Msk (0x1UL << GPIO_IN_PIN7_Pos)
#define GPIO_IN_PIN7 GPIO_IN_PIN7_Msk
#define GPIO_IN_PIN8_Pos (8U)
#define GPIO_IN_PIN8_Msk (0x1UL << GPIO_IN_PIN8_Pos)
#define GPIO_IN_PIN8 GPIO_IN_PIN8_Msk
#define GPIO_IN_PIN9_Pos (9U)
#define GPIO_IN_PIN9_Msk (0x1UL << GPIO_IN_PIN9_Pos)
#define GPIO_IN_PIN9 GPIO_IN_PIN9_Msk
#define GPIO_IN_PIN10_Pos (10U)
#define GPIO_IN_PIN10_Msk (0x1UL << GPIO_IN_PIN10_Pos)
#define GPIO_IN_PIN10 GPIO_IN_PIN10_Msk
#define GPIO_IN_PIN11_Pos (11U)
#define GPIO_IN_PIN11_Msk (0x1UL << GPIO_IN_PIN11_Pos)
#define GPIO_IN_PIN11 GPIO_IN_PIN11_Msk
#define GPIO_IN_PIN12_Pos (12U)
#define GPIO_IN_PIN12_Msk (0x1UL << GPIO_IN_PIN12_Pos)
#define GPIO_IN_PIN12 GPIO_IN_PIN12_Msk
#define GPIO_IN_PIN13_Pos (13U)
#define GPIO_IN_PIN13_Msk (0x1UL << GPIO_IN_PIN13_Pos)
#define GPIO_IN_PIN13 GPIO_IN_PIN13_Msk
#define GPIO_IN_PIN14_Pos (14U)
#define GPIO_IN_PIN14_Msk (0x1UL << GPIO_IN_PIN14_Pos)
#define GPIO_IN_PIN14 GPIO_IN_PIN14_Msk
#define GPIO_IN_PIN15_Pos (15U)
#define GPIO_IN_PIN15_Msk (0x1UL << GPIO_IN_PIN15_Pos)
#define GPIO_IN_PIN15 GPIO_IN_PIN15_Msk

// GPIO_OUT
#define GPIO_OUT_PIN0_Pos (0U)
#define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos)
#define GPIO_OUT_PIN0 GPIO_OUT_PIN0_Msk
#define GPIO_OUT_PIN1_Pos (1U)
#define GPIO_OUT_PIN1_Msk (0x1UL << GPIO_OUT_PIN1_Pos)
#define GPIO_OUT_PIN1 GPIO_OUT_PIN1_Msk
#define GPIO_OUT_PIN2_Pos (2U)
#define GPIO_OUT_PIN2_Msk (0x1UL << GPIO_OUT_PIN2_Pos)
#define GPIO_OUT_PIN2 GPIO_OUT_PIN2_Msk
#define GPIO_OUT_PIN3_Pos (3U)
#define GPIO_OUT_PIN3_Msk (0x1UL << GPIO_OUT_PIN3_Pos)
#define GPIO_OUT_PIN3 GPIO_OUT_PIN3_Msk
#define GPIO_OUT_PIN4_Pos (4U)
#define GPIO_OUT_PIN4_Msk (0x1UL << GPIO_OUT_PIN4_Pos)
#define GPIO_OUT_PIN4 GPIO_OUT_PIN4_Msk
#define GPIO_OUT_PIN5_Pos (5U)
#define GPIO_OUT_PIN5_Msk (0x1UL << GPIO_OUT_PIN5_Pos)
#define GPIO_OUT_PIN5 GPIO_OUT_PIN5_Msk
#define GPIO_OUT_PIN6_Pos (6U)
#define GPIO_OUT_PIN6_Msk (0x1UL << GPIO_OUT_PIN6_Pos)
#define GPIO_OUT_PIN6 GPIO_OUT_PIN6_Msk
#define GPIO_OUT_PIN7_Pos (7U)
#define GPIO_OUT_PIN7_Msk (0x1UL << GPIO_OUT_PIN7_Pos)
#define GPIO_OUT_PIN7 GPIO_OUT_PIN7_Msk
#define GPIO_OUT_PIN8_Pos (8U)
#define GPIO_OUT_PIN8_Msk (0x1UL << GPIO_OUT_PIN8_Pos)
#define GPIO_OUT_PIN8 GPIO_OUT_PIN8_Msk
#define GPIO_OUT_PIN9_Pos (9U)
#define GPIO_OUT_PIN9_Msk (0x1UL << GPIO_OUT_PIN9_Pos)
#define GPIO_OUT_PIN9 GPIO_OUT_PIN9_Msk
#define GPIO_OUT_PIN10_Pos (10U)
#define GPIO_OUT_PIN10_Msk (0x1UL << GPIO_OUT_PIN10_Pos)
#define GPIO_OUT_PIN10 GPIO_OUT_PIN10_Msk
#define GPIO_OUT_PIN11_Pos (11U)
#define GPIO_OUT_PIN11_Msk (0x1UL << GPIO_OUT_PIN11_Pos)
#define GPIO_OUT_PIN11 GPIO_OUT_PIN11_Msk
#define GPIO_OUT_PIN12_Pos (12U)
#define GPIO_OUT_PIN12_Msk (0x1UL << GPIO_OUT_PIN12_Pos)
#define GPIO_OUT_PIN12 GPIO_OUT_PIN12_Msk
#define GPIO_OUT_PIN13_Pos (13U)
#define GPIO_OUT_PIN13_Msk (0x1UL << GPIO_OUT_PIN13_Pos)
#define GPIO_OUT_PIN13 GPIO_OUT_PIN13_Msk
#define GPIO_OUT_PIN14_Pos (14U)
#define GPIO_OUT_PIN14_Msk (0x1UL << GPIO_OUT_PIN14_Pos)
#define GPIO_OUT_PIN14 GPIO_OUT_PIN14_Msk
#define GPIO_OUT_PIN15_Pos (15U)
#define GPIO_OUT_PIN15_Msk (0x1UL << GPIO_OUT_PIN15_Pos)
#define GPIO_OUT_PIN15 GPIO_OUT_PIN15_Msk

