sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// GPIO_BRR
#define GPIO_BRR_PIN0_Pos (0U)
#define GPIO_BRR_PIN0_Msk (0x1UL << GPIO_BRR_PIN0_Pos)
#define GPIO_BRR_PIN0 GPIO_BRR_PIN0_Msk
#define GPIO_BRR_PIN1_Pos (1U)
#define GPIO_BRR_PIN1_Msk (0x1UL << GPIO_BRR_PIN1_Pos)
#define GPIO_BRR_PIN1 GPIO_BRR_PIN1_Msk
#define GPIO_BRR_PIN2_Pos (2U)
#define GPIO_BRR_PIN2_Msk (0x1UL << GPIO_BRR_PIN2_Pos)
#define GPIO_BRR_PIN2 GPIO_BRR_PIN2_Msk
#define GPIO_BRR_PIN3_Pos (3U)
#define GPIO_BRR_PIN3_Msk (0x1UL << GPIO_BRR_PIN3_Pos)
#define GPIO_BRR_PIN3 GPIO_BRR_PIN3_Msk
#define GPIO_BRR_PIN4_Pos (4U)
#define GPIO_BRR_PIN4_Msk (0x1UL << GPIO_BRR_PIN4_Pos)
#define GPIO_BRR_PIN4 GPIO_BRR_PIN4_Msk
#define GPIO_BRR_PIN5_Pos (5U)
#define GPIO_BRR_PIN5_Msk (0x1UL << GPIO_BRR_PIN5_Pos)
#define GPIO_BRR_PIN5 GPIO_BRR_PIN5_Msk
#define GPIO_BRR_PIN6_Pos (6U)
#define GPIO_BRR_PIN6_Msk (0x1UL << GPIO_BRR_PIN6_Pos)
#define GPIO_BRR_PIN6 GPIO_BRR_PIN6_Msk
#define GPIO_BRR_PIN7_Pos (7U)
#define GPIO_BRR_PIN7_Msk (0x1UL << GPIO_BRR_PIN7_Pos)
#define GPIO_BRR_PIN7 GPIO_BRR_PIN7_Msk
#define GPIO_BRR_PIN8_Pos (8U)
#define GPIO_BRR_PIN8_Msk (0x1UL << GPIO_BRR_PIN8_Pos)
#define GPIO_BRR_PIN8 GPIO_BRR_PIN8_Msk
#define GPIO_BRR_PIN9_Pos (9U)
#define GPIO_BRR_PIN9_Msk (0x1UL << GPIO_BRR_PIN9_Pos)
#define GPIO_BRR_PIN9 GPIO_BRR_PIN9_Msk
#define GPIO_BRR_PIN10_Pos (10U)
#define GPIO_BRR_PIN10_Msk (0x1UL << GPIO_BRR_PIN10_Pos)
#define GPIO_BRR_PIN10 GPIO_BRR_PIN10_Msk
#define GPIO_BRR_PIN11_Pos (11U)
#define GPIO_BRR_PIN11_Msk (0x1UL << GPIO_BRR_PIN11_Pos)
#define GPIO_BRR_PIN11 GPIO_BRR_PIN11_Msk
#define GPIO_BRR_PIN12_Pos (12U)
#define GPIO_BRR_PIN12_Msk (0x1UL << GPIO_BRR_PIN12_Pos)
#define GPIO_BRR_PIN12 GPIO_BRR_PIN12_Msk
#define GPIO_BRR_PIN13_Pos (13U)
#define GPIO_BRR_PIN13_Msk (0x1UL << GPIO_BRR_PIN13_Pos)
#define GPIO_BRR_PIN13 GPIO_BRR_PIN13_Msk
#define GPIO_BRR_PIN14_Pos (14U)
#define GPIO_BRR_PIN14_Msk (0x1UL << GPIO_BRR_PIN14_Pos)
#define GPIO_BRR_PIN14 GPIO_BRR_PIN14_Msk
#define GPIO_BRR_PIN15_Pos (15U)
#define GPIO_BRR_PIN15_Msk (0x1UL << GPIO_BRR_PIN15_Pos)
#define GPIO_BRR_PIN15 GPIO_BRR_PIN15_Msk

// GPIO_BSRR
#define GPIO_BSRR_BSPIN0_Pos (0U)
#define GPIO_BSRR_BSPIN0_Msk (0x1UL << GPIO_BSRR_BSPIN0_Pos)
#define GPIO_BSRR_BSPIN0 GPIO_BSRR_BSPIN0_Msk
#define GPIO_BSRR_BSPIN1_Pos (1U)
#define GPIO_BSRR_BSPIN1_Msk (0x1UL << GPIO_BSRR_BSPIN1_Pos)
#define GPIO_BSRR_BSPIN1 GPIO_BSRR_BSPIN1_Msk
#define GPIO_BSRR_BSPIN2_Pos (2U)
#define GPIO_BSRR_BSPIN2_Msk (0x1UL << GPIO_BSRR_BSPIN2_Pos)
#define GPIO_BSRR_BSPIN2 GPIO_BSRR_BSPIN2_Msk
#define GPIO_BSRR_BSPIN3_Pos (3U)
#define GPIO_BSRR_BSPIN3_Msk (0x1UL << GPIO_BSRR_BSPIN3_Pos)
#define GPIO_BSRR_BSPIN3 GPIO_BSRR_BSPIN3_Msk
#define GPIO_BSRR_BSPIN4_Pos (4U)
#define GPIO_BSRR_BSPIN4_Msk (0x1UL << GPIO_BSRR_BSPIN4_Pos)
#define GPIO_BSRR_BSPIN4 GPIO_BSRR_BSPIN4_Msk
#define GPIO_BSRR_BSPIN5_Pos (5U)
#define GPIO_BSRR_BSPIN5_Msk (0x1UL << GPIO_BSRR_BSPIN5_Pos)
#define GPIO_BSRR_BSPIN5 GPIO_BSRR_BSPIN5_Msk
#define GPIO_BSRR_BSPIN6_Pos (6U)
#define GPIO_BSRR_BSPIN6_Msk (0x1UL << GPIO_BSRR_BSPIN6_Pos)
#define GPIO_BSRR_BSPIN6 GPIO_BSRR_BSPIN6_Msk
#define GPIO_BSRR_BSPIN7_Pos (7U)
#define GPIO_BSRR_BSPIN7_Msk (0x1UL << GPIO_BSRR_BSPIN7_Pos)
#define GPIO_BSRR_BSPIN7 GPIO_BSRR_BSPIN7_Msk
#define GPIO_BSRR_BSPIN8_Pos (8U)
#define GPIO_BSRR_BSPIN8_Msk (0x1UL << GPIO_BSRR_BSPIN8_Pos)
#define GPIO_BSRR_BSPIN8 GPIO_BSRR_BSPIN8_Msk
#define GPIO_BSRR_BSPIN9_Pos (9U)
#define GPIO_BSRR_BSPIN9_Msk (0x1UL << GPIO_BSRR_BSPIN9_Pos)
#define GPIO_BSRR_BSPIN9 GPIO_BSRR_BSPIN9_Msk
#define GPIO_BSRR_BSPIN10_Pos (10U)
#define GPIO_BSRR_BSPIN10_Msk (0x1UL << GPIO_BSRR_BSPIN10_Pos)
#define GPIO_BSRR_BSPIN10 GPIO_BSRR_BSPIN10_Msk
#define GPIO_BSRR_BSPIN11_Pos (11U)
#define GPIO_BSRR_BSPIN11_Msk (0x1UL << GPIO_BSRR_BSPIN11_Pos)
#define GPIO_BSRR_BSPIN11 GPIO_BSRR_BSPIN11_Msk
#define GPIO_BSRR_BSPIN12_Pos (12U)
#define GPIO_BSRR_BSPIN12_Msk (0x1UL << GPIO_BSRR_BSPIN12_Pos)
#define GPIO_BSRR_BSPIN12 GPIO_BSRR_BSPIN12_Msk
#define GPIO_BSRR_BSPIN13_Pos (13U)
#define GPIO_BSRR_BSPIN13_Msk (0x1UL << GPIO_BSRR_BSPIN13_Pos)
#define GPIO_BSRR_BSPIN13 GPIO_BSRR_BSPIN13_Msk
#define GPIO_BSRR_BSPIN14_Pos (14U)
#define GPIO_BSRR_BSPIN14_Msk (0x1UL << GPIO_BSRR_BSPIN14_Pos)
#define GPIO_BSRR_BSPIN14 GPIO_BSRR_BSPIN14_Msk
#define GPIO_BSRR_BSPIN15_Pos (15U)
#define GPIO_BSRR_BSPIN15_Msk (0x1UL << GPIO_BSRR_BSPIN15_Pos)
#define GPIO_BSRR_BSPIN15 GPIO_BSRR_BSPIN15_Msk
#define GPIO_BSRR_BRPIN0_Pos (16U)
#define GPIO_BSRR_BRPIN0_Msk (0x1UL << GPIO_BSRR_BRPIN0_Pos)
#define GPIO_BSRR_BRPIN0 GPIO_BSRR_BRPIN0_Msk
#define GPIO_BSRR_BRPIN1_Pos (17U)
#define GPIO_BSRR_BRPIN1_Msk (0x1UL << GPIO_BSRR_BRPIN1_Pos)
#define GPIO_BSRR_BRPIN1 GPIO_BSRR_BRPIN1_Msk
#define GPIO_BSRR_BRPIN2_Pos (18U)
#define GPIO_BSRR_BRPIN2_Msk (0x1UL << GPIO_BSRR_BRPIN2_Pos)
#define GPIO_BSRR_BRPIN2 GPIO_BSRR_BRPIN2_Msk
#define GPIO_BSRR_BRPIN3_Pos (19U)
#define GPIO_BSRR_BRPIN3_Msk (0x1UL << GPIO_BSRR_BRPIN3_Pos)
#define GPIO_BSRR_BRPIN3 GPIO_BSRR_BRPIN3_Msk
#define GPIO_BSRR_BRPIN4_Pos (20U)
#define GPIO_BSRR_BRPIN4_Msk (0x1UL << GPIO_BSRR_BRPIN4_Pos)
#define GPIO_BSRR_BRPIN4 GPIO_BSRR_BRPIN4_Msk
#define GPIO_BSRR_BRPIN5_Pos (21U)
#define GPIO_BSRR_BRPIN5_Msk (0x1UL << GPIO_BSRR_BRPIN5_Pos)
#define GPIO_BSRR_BRPIN5 GPIO_BSRR_BRPIN5_Msk
#define GPIO_BSRR_BRPIN6_Pos (22U)
#define GPIO_BSRR_BRPIN6_Msk (0x1UL << GPIO_BSRR_BRPIN6_Pos)
#define GPIO_BSRR_BRPIN6 GPIO_BSRR_BRPIN6_Msk
#define GPIO_BSRR_BRPIN7_Pos (23U)
#define GPIO_BSRR_BRPIN7_Msk (0x1UL << GPIO_BSRR_BRPIN7_Pos)
#define GPIO_BSRR_BRPIN7 GPIO_BSRR_BRPIN7_Msk
#define GPIO_BSRR_BRPIN8_Pos (24U)
#define GPIO_BSRR_BRPIN8_Msk (0x1UL << GPIO_BSRR_BRPIN8_Pos)
#define GPIO_BSRR_BRPIN8 GPIO_BSRR_BRPIN8_Msk
#define GPIO_BSRR_BRPIN9_Pos (25U)
#define GPIO_BSRR_BRPIN9_Msk (0x1UL << GPIO_BSRR_BRPIN9_Pos)
#define GPIO_BSRR_BRPIN9 GPIO_BSRR_BRPIN9_Msk
#define GPIO_BSRR_BRPIN10_Pos (26U)
#define GPIO_BSRR_BRPIN10_Msk (0x1UL << GPIO_BSRR_BRPIN10_Pos)
#define GPIO_BSRR_BRPIN10 GPIO_BSRR_BRPIN10_Msk
#define GPIO_BSRR_BRPIN11_Pos (27U)
#define GPIO_BSRR_BRPIN11_Msk (0x1UL << GPIO_BSRR_BRPIN11_Pos)
#define GPIO_BSRR_BRPIN11 GPIO_BSRR_BRPIN11_Msk
#define GPIO_BSRR_BRPIN12_Pos (28U)
#define GPIO_BSRR_BRPIN12_Msk (0x1UL << GPIO_BSRR_BRPIN12_Pos)
#define GPIO_BSRR_BRPIN12 GPIO_BSRR_BRPIN12_Msk
#define GPIO_BSRR_BRPIN13_Pos (29U)
#define GPIO_BSRR_BRPIN13_Msk (0x1UL << GPIO_BSRR_BRPIN13_Pos)
#define GPIO_BSRR_BRPIN13 GPIO_BSRR_BRPIN13_Msk
#define GPIO_BSRR_BRPIN14_Pos (30U)
#define GPIO_BSRR_BRPIN14_Msk (0x1UL << GPIO_BSRR_BRPIN14_Pos)
#define GPIO_BSRR_BRPIN14 GPIO_BSRR_BRPIN14_Msk
#define GPIO_BSRR_BRPIN15_Pos (31U)
#define GPIO_BSRR_BRPIN15_Msk (0x1UL << GPIO_BSRR_BRPIN15_Pos)
#define GPIO_BSRR_BRPIN15 GPIO_BSRR_BRPIN15_Msk

// GPIO_AFRL
#define GPIO_AFRL_AFSEL0_Pos (0U)
#define GPIO_AFRL_AFSEL0_Msk (0xFUL << GPIO_AFRL_AFSEL0_Pos)
#define GPIO_AFRL_AFSEL0 GPIO_AFRL_AFSEL0_Msk
#define GPIO_AFRL_AFSEL1_Pos (4U)
#define GPIO_AFRL_AFSEL1_Msk (0xFUL << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL1 GPIO_AFRL_AFSEL1_Msk
#define GPIO_AFRL_AFSEL2_Pos (8U)
#define GPIO_AFRL_AFSEL2_Msk (0xFUL << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL2 GPIO_AFRL_AFSEL2_Msk
#define GPIO_AFRL_AFSEL3_Pos (12U)
#define GPIO_AFRL_AFSEL3_Msk (0xFUL << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL3 GPIO_AFRL_AFSEL3_Msk
#define GPIO_AFRL_AFSEL4_Pos (16U)
#define GPIO_AFRL_AFSEL4_Msk (0xFUL << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL4 GPIO_AFRL_AFSEL4_Msk
#define GPIO_AFRL_AFSEL5_Pos (20U)
#define GPIO_AFRL_AFSEL5_Msk (0xFUL << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL5 GPIO_AFRL_AFSEL5_Msk
#define GPIO_AFRL_AFSEL6_Pos (24U)
#define GPIO_AFRL_AFSEL6_Msk (0xFUL << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL6 GPIO_AFRL_AFSEL6_Msk
#define GPIO_AFRL_AFSEL7_Pos (28U)
#define GPIO_AFRL_AFSEL7_Msk (0xFUL << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL7 GPIO_AFRL_AFSEL7_Msk

