sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// GPIO_AFRH
#define GPIO_AFRH_AFSEL8_Pos (0U)
#define GPIO_AFRH_AFSEL8_Msk (0xFUL << GPIO_AFRH_AFSEL8_Pos)
#define GPIO_AFRH_AFSEL8 GPIO_AFRH_AFSEL8_Msk
#define GPIO_AFRH_AFSEL9_Pos (4U)
#define GPIO_AFRH_AFSEL9_Msk (0xFUL << GPIO_AFRH_AFSEL9_Pos)
#define GPIO_AFRH_AFSEL9 GPIO_AFRH_AFSEL9_Msk
#define GPIO_AFRH_AFSEL10_Pos (8U)
#define GPIO_AFRH_AFSEL10_Msk (0xFUL << GPIO_AFRH_AFSEL10_Pos)
#define GPIO_AFRH_AFSEL10 GPIO_AFRH_AFSEL10_Msk
#define GPIO_AFRH_AFSEL11_Pos (12U)
#define GPIO_AFRH_AFSEL11_Msk (0xFUL << GPIO_AFRH_AFSEL11_Pos)
#define GPIO_AFRH_AFSEL11 GPIO_AFRH_AFSEL11_Msk
#define GPIO_AFRH_AFSEL12_Pos (16U)
#define GPIO_AFRH_AFSEL12_Msk (0xFUL << GPIO_AFRH_AFSEL12_Pos)
#define GPIO_AFRH_AFSEL12 GPIO_AFRH_AFSEL12_Msk
#define GPIO_AFRH_AFSEL13_Pos (20U)
#define GPIO_AFRH_AFSEL13_Msk (0xFUL << GPIO_AFRH_AFSEL13_Pos)
#define GPIO_AFRH_AFSEL13 GPIO_AFRH_AFSEL13_Msk
#define GPIO_AFRH_AFSEL14_Pos (24U)
#define GPIO_AFRH_AFSEL14_Msk (0xFUL << GPIO_AFRH_AFSEL14_Pos)
#define GPIO_AFRH_AFSEL14 GPIO_AFRH_AFSEL14_Msk
#define GPIO_AFRH_AFSEL15_Pos (28U)
#define GPIO_AFRH_AFSEL15_Msk (0xFUL << GPIO_AFRH_AFSEL15_Pos)
#define GPIO_AFRH_AFSEL15 GPIO_AFRH_AFSEL15_Msk

// GPIO_HIGHIE
#define GPIO_HIGHIE_PIN0_Pos (0U)
#define GPIO_HIGHIE_PIN0_Msk (0x1UL << GPIO_HIGHIE_PIN0_Pos)
#define GPIO_HIGHIE_PIN0 GPIO_HIGHIE_PIN0_Msk
#define GPIO_HIGHIE_PIN1_Pos (1U)
#define GPIO_HIGHIE_PIN1_Msk (0x1UL << GPIO_HIGHIE_PIN1_Pos)
#define GPIO_HIGHIE_PIN1 GPIO_HIGHIE_PIN1_Msk
#define GPIO_HIGHIE_PIN2_Pos (2U)
#define GPIO_HIGHIE_PIN2_Msk (0x1UL << GPIO_HIGHIE_PIN2_Pos)
#define GPIO_HIGHIE_PIN2 GPIO_HIGHIE_PIN2_Msk
#define GPIO_HIGHIE_PIN3_Pos (3U)
#define GPIO_HIGHIE_PIN3_Msk (0x1UL << GPIO_HIGHIE_PIN3_Pos)
#define GPIO_HIGHIE_PIN3 GPIO_HIGHIE_PIN3_Msk
#define GPIO_HIGHIE_PIN4_Pos (4U)
#define GPIO_HIGHIE_PIN4_Msk (0x1UL << GPIO_HIGHIE_PIN4_Pos)
#define GPIO_HIGHIE_PIN4 GPIO_HIGHIE_PIN4_Msk
#define GPIO_HIGHIE_PIN5_Pos (5U)
#define GPIO_HIGHIE_PIN5_Msk (0x1UL << GPIO_HIGHIE_PIN5_Pos)
#define GPIO_HIGHIE_PIN5 GPIO_HIGHIE_PIN5_Msk
#define GPIO_HIGHIE_PIN6_Pos (6U)
#define GPIO_HIGHIE_PIN6_Msk (0x1UL << GPIO_HIGHIE_PIN6_Pos)
#define GPIO_HIGHIE_PIN6 GPIO_HIGHIE_PIN6_Msk
#define GPIO_HIGHIE_PIN7_Pos (7U)
#define GPIO_HIGHIE_PIN7_Msk (0x1UL << GPIO_HIGHIE_PIN7_Pos)
#define GPIO_HIGHIE_PIN7 GPIO_HIGHIE_PIN7_Msk
#define GPIO_HIGHIE_PIN8_Pos (8U)
#define GPIO_HIGHIE_PIN8_Msk (0x1UL << GPIO_HIGHIE_PIN8_Pos)
#define GPIO_HIGHIE_PIN8 GPIO_HIGHIE_PIN8_Msk
#define GPIO_HIGHIE_PIN9_Pos (9U)
#define GPIO_HIGHIE_PIN9_Msk (0x1UL << GPIO_HIGHIE_PIN9_Pos)
#define GPIO_HIGHIE_PIN9 GPIO_HIGHIE_PIN9_Msk
#define GPIO_HIGHIE_PIN10_Pos (10U)
#define GPIO_HIGHIE_PIN10_Msk (0x1UL << GPIO_HIGHIE_PIN10_Pos)
#define GPIO_HIGHIE_PIN10 GPIO_HIGHIE_PIN10_Msk
#define GPIO_HIGHIE_PIN11_Pos (11U)
#define GPIO_HIGHIE_PIN11_Msk (0x1UL << GPIO_HIGHIE_PIN11_Pos)
#define GPIO_HIGHIE_PIN11 GPIO_HIGHIE_PIN11_Msk
#define GPIO_HIGHIE_PIN12_Pos (12U)
#define GPIO_HIGHIE_PIN12_Msk (0x1UL << GPIO_HIGHIE_PIN12_Pos)
#define GPIO_HIGHIE_PIN12 GPIO_HIGHIE_PIN12_Msk
#define GPIO_HIGHIE_PIN13_Pos (13U)
#define GPIO_HIGHIE_PIN13_Msk (0x1UL << GPIO_HIGHIE_PIN13_Pos)
#define GPIO_HIGHIE_PIN13 GPIO_HIGHIE_PIN13_Msk
#define GPIO_HIGHIE_PIN14_Pos (14U)
#define GPIO_HIGHIE_PIN14_Msk (0x1UL << GPIO_HIGHIE_PIN14_Pos)
#define GPIO_HIGHIE_PIN14 GPIO_HIGHIE_PIN14_Msk
#define GPIO_HIGHIE_PIN15_Pos (15U)
#define GPIO_HIGHIE_PIN15_Msk (0x1UL << GPIO_HIGHIE_PIN15_Pos)
#define GPIO_HIGHIE_PIN15 GPIO_HIGHIE_PIN15_Msk

// GPIO_LOWIE
#define GPIO_LOWIE_PIN0_Pos (0U)
#define GPIO_LOWIE_PIN0_Msk (0x1UL << GPIO_LOWIE_PIN0_Pos)
#define GPIO_LOWIE_PIN0 GPIO_LOWIE_PIN0_Msk
#define GPIO_LOWIE_PIN1_Pos (1U)
#define GPIO_LOWIE_PIN1_Msk (0x1UL << GPIO_LOWIE_PIN1_Pos)
#define GPIO_LOWIE_PIN1 GPIO_LOWIE_PIN1_Msk
#define GPIO_LOWIE_PIN2_Pos (2U)
#define GPIO_LOWIE_PIN2_Msk (0x1UL << GPIO_LOWIE_PIN2_Pos)
#define GPIO_LOWIE_PIN2 GPIO_LOWIE_PIN2_Msk
#define GPIO_LOWIE_PIN3_Pos (3U)
#define GPIO_LOWIE_PIN3_Msk (0x1UL << GPIO_LOWIE_PIN3_Pos)
#define GPIO_LOWIE_PIN3 GPIO_LOWIE_PIN3_Msk
#define GPIO_LOWIE_PIN4_Pos (4U)
#define GPIO_LOWIE_PIN4_Msk (0x1UL << GPIO_LOWIE_PIN4_Pos)
#define GPIO_LOWIE_PIN4 GPIO_LOWIE_PIN4_Msk
#define GPIO_LOWIE_PIN5_Pos (5U)
#define GPIO_LOWIE_PIN5_Msk (0x1UL << GPIO_LOWIE_PIN5_Pos)
#define GPIO_LOWIE_PIN5 GPIO_LOWIE_PIN5_Msk
#define GPIO_LOWIE_PIN6_Pos (6U)
#define GPIO_LOWIE_PIN6_Msk (0x1UL << GPIO_LOWIE_PIN6_Pos)
#define GPIO_LOWIE_PIN6 GPIO_LOWIE_PIN6_Msk
#define GPIO_LOWIE_PIN7_Pos (7U)
#define GPIO_LOWIE_PIN7_Msk (0x1UL << GPIO_LOWIE_PIN7_Pos)
#define GPIO_LOWIE_PIN7 GPIO_LOWIE_PIN7_Msk
#define GPIO_LOWIE_PIN8_Pos (8U)
#define GPIO_LOWIE_PIN8_Msk (0x1UL << GPIO_LOWIE_PIN8_Pos)
#define GPIO_LOWIE_PIN8 GPIO_LOWIE_PIN8_Msk
#define GPIO_LOWIE_PIN9_Pos (9U)
#define GPIO_LOWIE_PIN9_Msk (0x1UL << GPIO_LOWIE_PIN9_Pos)
#define GPIO_LOWIE_PIN9 GPIO_LOWIE_PIN9_Msk
#define GPIO_LOWIE_PIN10_Pos (10U)
#define GPIO_LOWIE_PIN10_Msk (0x1UL << GPIO_LOWIE_PIN10_Pos)
#define GPIO_LOWIE_PIN10 GPIO_LOWIE_PIN10_Msk
#define GPIO_LOWIE_PIN11_Pos (11U)
#define GPIO_LOWIE_PIN11_Msk (0x1UL << GPIO_LOWIE_PIN11_Pos)
#define GPIO_LOWIE_PIN11 GPIO_LOWIE_PIN11_Msk
#define GPIO_LOWIE_PIN12_Pos (12U)
#define GPIO_LOWIE_PIN12_Msk (0x1UL << GPIO_LOWIE_PIN12_Pos)
#define GPIO_LOWIE_PIN12 GPIO_LOWIE_PIN12_Msk
#define GPIO_LOWIE_PIN13_Pos (13U)
#define GPIO_LOWIE_PIN13_Msk (0x1UL << GPIO_LOWIE_PIN13_Pos)
#define GPIO_LOWIE_PIN13 GPIO_LOWIE_PIN13_Msk
#define GPIO_LOWIE_PIN14_Pos (14U)
#define GPIO_LOWIE_PIN14_Msk (0x1UL << GPIO_LOWIE_PIN14_Pos)
#define GPIO_LOWIE_PIN14 GPIO_LOWIE_PIN14_Msk
#define GPIO_LOWIE_PIN15_Pos (15U)
#define GPIO_LOWIE_PIN15_Msk (0x1UL << GPIO_LOWIE_PIN15_Pos)
#define GPIO_LOWIE_PIN15 GPIO_LOWIE_PIN15_Msk

// GPIO_RISEIE
#define GPIO_RISEIE_PIN0_Pos (0U)
#define GPIO_RISEIE_PIN0_Msk (0x1UL << GPIO_RISEIE_PIN0_Pos)
#define GPIO_RISEIE_PIN0 GPIO_RISEIE_PIN0_Msk
#define GPIO_RISEIE_PIN1_Pos (1U)
#define GPIO_RISEIE_PIN1_Msk (0x1UL << GPIO_RISEIE_PIN1_Pos)
#define GPIO_RISEIE_PIN1 GPIO_RISEIE_PIN1_Msk
#define GPIO_RISEIE_PIN2_Pos (2U)
#define GPIO_RISEIE_PIN2_Msk (0x1UL << GPIO_RISEIE_PIN2_Pos)
#define GPIO_RISEIE_PIN2 GPIO_RISEIE_PIN2_Msk
#define GPIO_RISEIE_PIN3_Pos (3U)
#define GPIO_RISEIE_PIN3_Msk (0x1UL << GPIO_RISEIE_PIN3_Pos)
#define GPIO_RISEIE_PIN3 GPIO_RISEIE_PIN3_Msk
#define GPIO_RISEIE_PIN4_Pos (4U)
#define GPIO_RISEIE_PIN4_Msk (0x1UL << GPIO_RISEIE_PIN4_Pos)
#define GPIO_RISEIE_PIN4 GPIO_RISEIE_PIN4_Msk
#define GPIO_RISEIE_PIN5_Pos (5U)
#define GPIO_RISEIE_PIN5_Msk (0x1UL << GPIO_RISEIE_PIN5_Pos)
#define GPIO_RISEIE_PIN5 GPIO_RISEIE_PIN5_Msk
#define GPIO_RISEIE_PIN6_Pos (6U)
#define GPIO_RISEIE_PIN6_Msk (0x1UL << GPIO_RISEIE_PIN6_Pos)
#define GPIO_RISEIE_PIN6 GPIO_RISEIE_PIN6_Msk
#define GPIO_RISEIE_PIN7_Pos (7U)
#define GPIO_RISEIE_PIN7_Msk (0x1UL << GPIO_RISEIE_PIN7_Pos)
#define GPIO_RISEIE_PIN7 GPIO_RISEIE_PIN7_Msk
#define GPIO_RISEIE_PIN8_Pos (8U)
#define GPIO_RISEIE_PIN8_Msk (0x1UL << GPIO_RISEIE_PIN8_Pos)
#define GPIO_RISEIE_PIN8 GPIO_RISEIE_PIN8_Msk
#define GPIO_RISEIE_PIN9_Pos (9U)
#define GPIO_RISEIE_PIN9_Msk (0x1UL << GPIO_RISEIE_PIN9_Pos)
#define GPIO_RISEIE_PIN9 GPIO_RISEIE_PIN9_Msk
#define GPIO_RISEIE_PIN10_Pos (10U)
#define GPIO_RISEIE_PIN10_Msk (0x1UL << GPIO_RISEIE_PIN10_Pos)
#define GPIO_RISEIE_PIN10 GPIO_RISEIE_PIN10_Msk
#define GPIO_RISEIE_PIN11_Pos (11U)
#define GPIO_RISEIE_PIN11_Msk (0x1UL << GPIO_RISEIE_PIN11_Pos)
#define GPIO_RISEIE_PIN11 GPIO_RISEIE_PIN11_Msk
#define GPIO_RISEIE_PIN12_Pos (12U)
#define GPIO_RISEIE_PIN12_Msk (0x1UL << GPIO_RISEIE_PIN12_Pos)
#define GPIO_RISEIE_PIN12 GPIO_RISEIE_PIN12_Msk
#define GPIO_RISEIE_PIN13_Pos (13U)
#define GPIO_RISEIE_PIN13_Msk (0x1UL << GPIO_RISEIE_PIN13_Pos)
#define GPIO_RISEIE_PIN13 GPIO_RISEIE_PIN13_Msk
#define GPIO_RISEIE_PIN14_Pos (14U)
#define GPIO_RISEIE_PIN14_Msk (0x1UL << GPIO_RISEIE_PIN14_Pos)
#define GPIO_RISEIE_PIN14 GPIO_RISEIE_PIN14_Msk
#define GPIO_RISEIE_PIN15_Pos (15U)
#define GPIO_RISEIE_PIN15_Msk (0x1UL << GPIO_RISEIE_PIN15_Pos)
#define GPIO_RISEIE_PIN15 GPIO_RISEIE_PIN15_Msk

