sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// GPIO_FALLIE
#define GPIO_FALLIE_PIN0_Pos (0U)
#define GPIO_FALLIE_PIN0_Msk (0x1UL << GPIO_FALLIE_PIN0_Pos)
#define GPIO_FALLIE_PIN0 GPIO_FALLIE_PIN0_Msk
#define GPIO_FALLIE_PIN1_Pos (1U)
#define GPIO_FALLIE_PIN1_Msk (0x1UL << GPIO_FALLIE_PIN1_Pos)
#define GPIO_FALLIE_PIN1 GPIO_FALLIE_PIN1_Msk
#define GPIO_FALLIE_PIN2_Pos (2U)
#define GPIO_FALLIE_PIN2_Msk (0x1UL << GPIO_FALLIE_PIN2_Pos)
#define GPIO_FALLIE_PIN2 GPIO_FALLIE_PIN2_Msk
#define GPIO_FALLIE_PIN3_Pos (3U)
#define GPIO_FALLIE_PIN3_Msk (0x1UL << GPIO_FALLIE_PIN3_Pos)
#define GPIO_FALLIE_PIN3 GPIO_FALLIE_PIN3_Msk
#define GPIO_FALLIE_PIN4_Pos (4U)
#define GPIO_FALLIE_PIN4_Msk (0x1UL << GPIO_FALLIE_PIN4_Pos)
#define GPIO_FALLIE_PIN4 GPIO_FALLIE_PIN4_Msk
#define GPIO_FALLIE_PIN5_Pos (5U)
#define GPIO_FALLIE_PIN5_Msk (0x1UL << GPIO_FALLIE_PIN5_Pos)
#define GPIO_FALLIE_PIN5 GPIO_FALLIE_PIN5_Msk
#define GPIO_FALLIE_PIN6_Pos (6U)
#define GPIO_FALLIE_PIN6_Msk (0x1UL << GPIO_FALLIE_PIN6_Pos)
#define GPIO_FALLIE_PIN6 GPIO_FALLIE_PIN6_Msk
#define GPIO_FALLIE_PIN7_Pos (7U)
#define GPIO_FALLIE_PIN7_Msk (0x1UL << GPIO_FALLIE_PIN7_Pos)
#define GPIO_FALLIE_PIN7 GPIO_FALLIE_PIN7_Msk
#define GPIO_FALLIE_PIN8_Pos (8U)
#define GPIO_FALLIE_PIN8_Msk (0x1UL << GPIO_FALLIE_PIN8_Pos)
#define GPIO_FALLIE_PIN8 GPIO_FALLIE_PIN8_Msk
#define GPIO_FALLIE_PIN9_Pos (9U)
#define GPIO_FALLIE_PIN9_Msk (0x1UL << GPIO_FALLIE_PIN9_Pos)
#define GPIO_FALLIE_PIN9 GPIO_FALLIE_PIN9_Msk
#define GPIO_FALLIE_PIN10_Pos (10U)
#define GPIO_FALLIE_PIN10_Msk (0x1UL << GPIO_FALLIE_PIN10_Pos)
#define GPIO_FALLIE_PIN10 GPIO_FALLIE_PIN10_Msk
#define GPIO_FALLIE_PIN11_Pos (11U)
#define GPIO_FALLIE_PIN11_Msk (0x1UL << GPIO_FALLIE_PIN11_Pos)
#define GPIO_FALLIE_PIN11 GPIO_FALLIE_PIN11_Msk
#define GPIO_FALLIE_PIN12_Pos (12U)
#define GPIO_FALLIE_PIN12_Msk (0x1UL << GPIO_FALLIE_PIN12_Pos)
#define GPIO_FALLIE_PIN12 GPIO_FALLIE_PIN12_Msk
#define GPIO_FALLIE_PIN13_Pos (13U)
#define GPIO_FALLIE_PIN13_Msk (0x1UL << GPIO_FALLIE_PIN13_Pos)
#define GPIO_FALLIE_PIN13 GPIO_FALLIE_PIN13_Msk
#define GPIO_FALLIE_PIN14_Pos (14U)
#define GPIO_FALLIE_PIN14_Msk (0x1UL << GPIO_FALLIE_PIN14_Pos)
#define GPIO_FALLIE_PIN14 GPIO_FALLIE_PIN14_Msk
#define GPIO_FALLIE_PIN15_Pos (15U)
#define GPIO_FALLIE_PIN15_Msk (0x1UL << GPIO_FALLIE_PIN15_Pos)
#define GPIO_FALLIE_PIN15 GPIO_FALLIE_PIN15_Msk

// GPIO_IFR
#define GPIO_IFR_PIN0_Pos (0U)
#define GPIO_IFR_PIN0_Msk (0x1UL << GPIO_IFR_PIN0_Pos)
#define GPIO_IFR_PIN0 GPIO_IFR_PIN0_Msk
#define GPIO_IFR_PIN1_Pos (1U)
#define GPIO_IFR_PIN1_Msk (0x1UL << GPIO_IFR_PIN1_Pos)
#define GPIO_IFR_PIN1 GPIO_IFR_PIN1_Msk
#define GPIO_IFR_PIN2_Pos (2U)
#define GPIO_IFR_PIN2_Msk (0x1UL << GPIO_IFR_PIN2_Pos)
#define GPIO_IFR_PIN2 GPIO_IFR_PIN2_Msk
#define GPIO_IFR_PIN3_Pos (3U)
#define GPIO_IFR_PIN3_Msk (0x1UL << GPIO_IFR_PIN3_Pos)
#define GPIO_IFR_PIN3 GPIO_IFR_PIN3_Msk
#define GPIO_IFR_PIN4_Pos (4U)
#define GPIO_IFR_PIN4_Msk (0x1UL << GPIO_IFR_PIN4_Pos)
#define GPIO_IFR_PIN4 GPIO_IFR_PIN4_Msk
#define GPIO_IFR_PIN5_Pos (5U)
#define GPIO_IFR_PIN5_Msk (0x1UL << GPIO_IFR_PIN5_Pos)
#define GPIO_IFR_PIN5 GPIO_IFR_PIN5_Msk
#define GPIO_IFR_PIN6_Pos (6U)
#define GPIO_IFR_PIN6_Msk (0x1UL << GPIO_IFR_PIN6_Pos)
#define GPIO_IFR_PIN6 GPIO_IFR_PIN6_Msk
#define GPIO_IFR_PIN7_Pos (7U)
#define GPIO_IFR_PIN7_Msk (0x1UL << GPIO_IFR_PIN7_Pos)
#define GPIO_IFR_PIN7 GPIO_IFR_PIN7_Msk
#define GPIO_IFR_PIN8_Pos (8U)
#define GPIO_IFR_PIN8_Msk (0x1UL << GPIO_IFR_PIN8_Pos)
#define GPIO_IFR_PIN8 GPIO_IFR_PIN8_Msk
#define GPIO_IFR_PIN9_Pos (9U)
#define GPIO_IFR_PIN9_Msk (0x1UL << GPIO_IFR_PIN9_Pos)
#define GPIO_IFR_PIN9 GPIO_IFR_PIN9_Msk
#define GPIO_IFR_PIN10_Pos (10U)
#define GPIO_IFR_PIN10_Msk (0x1UL << GPIO_IFR_PIN10_Pos)
#define GPIO_IFR_PIN10 GPIO_IFR_PIN10_Msk
#define GPIO_IFR_PIN11_Pos (11U)
#define GPIO_IFR_PIN11_Msk (0x1UL << GPIO_IFR_PIN11_Pos)
#define GPIO_IFR_PIN11 GPIO_IFR_PIN11_Msk
#define GPIO_IFR_PIN12_Pos (12U)
#define GPIO_IFR_PIN12_Msk (0x1UL << GPIO_IFR_PIN12_Pos)
#define GPIO_IFR_PIN12 GPIO_IFR_PIN12_Msk
#define GPIO_IFR_PIN13_Pos (13U)
#define GPIO_IFR_PIN13_Msk (0x1UL << GPIO_IFR_PIN13_Pos)
#define GPIO_IFR_PIN13 GPIO_IFR_PIN13_Msk
#define GPIO_IFR_PIN14_Pos (14U)
#define GPIO_IFR_PIN14_Msk (0x1UL << GPIO_IFR_PIN14_Pos)
#define GPIO_IFR_PIN14 GPIO_IFR_PIN14_Msk
#define GPIO_IFR_PIN15_Pos (15U)
#define GPIO_IFR_PIN15_Msk (0x1UL << GPIO_IFR_PIN15_Pos)
#define GPIO_IFR_PIN15 GPIO_IFR_PIN15_Msk

// GPIO_ICR
#define GPIO_ICR_PIN0_Pos (0U)
#define GPIO_ICR_PIN0_Msk (0x1UL << GPIO_ICR_PIN0_Pos)
#define GPIO_ICR_PIN0 GPIO_ICR_PIN0_Msk
#define GPIO_ICR_PIN1_Pos (1U)
#define GPIO_ICR_PIN1_Msk (0x1UL << GPIO_ICR_PIN1_Pos)
#define GPIO_ICR_PIN1 GPIO_ICR_PIN1_Msk
#define GPIO_ICR_PIN2_Pos (2U)
#define GPIO_ICR_PIN2_Msk (0x1UL << GPIO_ICR_PIN2_Pos)
#define GPIO_ICR_PIN2 GPIO_ICR_PIN2_Msk
#define GPIO_ICR_PIN3_Pos (3U)
#define GPIO_ICR_PIN3_Msk (0x1UL << GPIO_ICR_PIN3_Pos)
#define GPIO_ICR_PIN3 GPIO_ICR_PIN3_Msk
#define GPIO_ICR_PIN4_Pos (4U)
#define GPIO_ICR_PIN4_Msk (0x1UL << GPIO_ICR_PIN4_Pos)
#define GPIO_ICR_PIN4 GPIO_ICR_PIN4_Msk
#define GPIO_ICR_PIN5_Pos (5U)
#define GPIO_ICR_PIN5_Msk (0x1UL << GPIO_ICR_PIN5_Pos)
#define GPIO_ICR_PIN5 GPIO_ICR_PIN5_Msk
#define GPIO_ICR_PIN6_Pos (6U)
#define GPIO_ICR_PIN6_Msk (0x1UL << GPIO_ICR_PIN6_Pos)
#define GPIO_ICR_PIN6 GPIO_ICR_PIN6_Msk
#define GPIO_ICR_PIN7_Pos (7U)
#define GPIO_ICR_PIN7_Msk (0x1UL << GPIO_ICR_PIN7_Pos)
#define GPIO_ICR_PIN7 GPIO_ICR_PIN7_Msk
#define GPIO_ICR_PIN8_Pos (8U)
#define GPIO_ICR_PIN8_Msk (0x1UL << GPIO_ICR_PIN8_Pos)
#define GPIO_ICR_PIN8 GPIO_ICR_PIN8_Msk
#define GPIO_ICR_PIN9_Pos (9U)
#define GPIO_ICR_PIN9_Msk (0x1UL << GPIO_ICR_PIN9_Pos)
#define GPIO_ICR_PIN9 GPIO_ICR_PIN9_Msk
#define GPIO_ICR_PIN10_Pos (10U)
#define GPIO_ICR_PIN10_Msk (0x1UL << GPIO_ICR_PIN10_Pos)
#define GPIO_ICR_PIN10 GPIO_ICR_PIN10_Msk
#define GPIO_ICR_PIN11_Pos (11U)
#define GPIO_ICR_PIN11_Msk (0x1UL << GPIO_ICR_PIN11_Pos)
#define GPIO_ICR_PIN11 GPIO_ICR_PIN11_Msk
#define GPIO_ICR_PIN12_Pos (12U)
#define GPIO_ICR_PIN12_Msk (0x1UL << GPIO_ICR_PIN12_Pos)
#define GPIO_ICR_PIN12 GPIO_ICR_PIN12_Msk
#define GPIO_ICR_PIN13_Pos (13U)
#define GPIO_ICR_PIN13_Msk (0x1UL << GPIO_ICR_PIN13_Pos)
#define GPIO_ICR_PIN13 GPIO_ICR_PIN13_Msk
#define GPIO_ICR_PIN14_Pos (14U)
#define GPIO_ICR_PIN14_Msk (0x1UL << GPIO_ICR_PIN14_Pos)
#define GPIO_ICR_PIN14 GPIO_ICR_PIN14_Msk
#define GPIO_ICR_PIN15_Pos (15U)
#define GPIO_ICR_PIN15_Msk (0x1UL << GPIO_ICR_PIN15_Pos)
#define GPIO_ICR_PIN15 GPIO_ICR_PIN15_Msk

