sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
//********************    Bits Define For Peripheral GPIOAUX    ********************//
// GPIOAUX_CR0
#define GPIOAUX_CR0_PCLKDIV_Pos (0U)
#define GPIOAUX_CR0_PCLKDIV_Msk (0x7UL << GPIOAUX_CR0_PCLKDIV_Pos)
#define GPIOAUX_CR0_PCLKDIV GPIOAUX_CR0_PCLKDIV_Msk
#define GPIOAUX_CR0_MCODIV_Pos (8U)
#define GPIOAUX_CR0_MCODIV_Msk (0x7UL << GPIOAUX_CR0_MCODIV_Pos)
#define GPIOAUX_CR0_MCODIV GPIOAUX_CR0_MCODIV_Msk
#define GPIOAUX_CR0_MCOSEL_Pos (12U)
#define GPIOAUX_CR0_MCOSEL_Msk (0x7UL << GPIOAUX_CR0_MCOSEL_Pos)
#define GPIOAUX_CR0_MCOSEL GPIOAUX_CR0_MCOSEL_Msk

// GPIOAUX_CR1
#define GPIOAUX_CR1_ATIM0ETR_Pos (0U)
#define GPIOAUX_CR1_ATIM0ETR_Msk (0x7UL << GPIOAUX_CR1_ATIM0ETR_Pos)
#define GPIOAUX_CR1_ATIM0ETR GPIOAUX_CR1_ATIM0ETR_Msk
#define GPIOAUX_CR1_CTIM0ETR_Pos (4U)
#define GPIOAUX_CR1_CTIM0ETR_Msk (0x7UL << GPIOAUX_CR1_CTIM0ETR_Pos)
#define GPIOAUX_CR1_CTIM0ETR GPIOAUX_CR1_CTIM0ETR_Msk
#define GPIOAUX_CR1_CTIM1ETR_Pos (8U)
#define GPIOAUX_CR1_CTIM1ETR_Msk (0x7UL << GPIOAUX_CR1_CTIM1ETR_Pos)
#define GPIOAUX_CR1_CTIM1ETR GPIOAUX_CR1_CTIM1ETR_Msk
#define GPIOAUX_CR1_ATIM3ETR_Pos (12U)
#define GPIOAUX_CR1_ATIM3ETR_Msk (0x7UL << GPIOAUX_CR1_ATIM3ETR_Pos)
#define GPIOAUX_CR1_ATIM3ETR GPIOAUX_CR1_ATIM3ETR_Msk

// GPIOAUX_CR2
#define GPIOAUX_CR2_ATIM0CAP0_Pos (0U)
#define GPIOAUX_CR2_ATIM0CAP0_Msk (0x7UL << GPIOAUX_CR2_ATIM0CAP0_Pos)
#define GPIOAUX_CR2_ATIM0CAP0 GPIOAUX_CR2_ATIM0CAP0_Msk
#define GPIOAUX_CR2_CTIM0CAP3_Pos (4U)
#define GPIOAUX_CR2_CTIM0CAP3_Msk (0x7UL << GPIOAUX_CR2_CTIM0CAP3_Pos)
#define GPIOAUX_CR2_CTIM0CAP3 GPIOAUX_CR2_CTIM0CAP3_Msk
#define GPIOAUX_CR2_CTIM1CAP3_Pos (8U)
#define GPIOAUX_CR2_CTIM1CAP3_Msk (0x7UL << GPIOAUX_CR2_CTIM1CAP3_Pos)
#define GPIOAUX_CR2_CTIM1CAP3 GPIOAUX_CR2_CTIM1CAP3_Msk
#define GPIOAUX_CR2_ATIM3CAP3_Pos (12U)
#define GPIOAUX_CR2_ATIM3CAP3_Msk (0x7UL << GPIOAUX_CR2_ATIM3CAP3_Pos)
#define GPIOAUX_CR2_ATIM3CAP3 GPIOAUX_CR2_ATIM3CAP3_Msk

//********************    Bits Define For Peripheral GTIM    ********************//
// GTIM_ARR
#define GTIM_ARR_ARR_Pos (0U)
#define GTIM_ARR_ARR_Msk (0xFFFFUL << GTIM_ARR_ARR_Pos)
#define GTIM_ARR_ARR GTIM_ARR_ARR_Msk

// GTIM_CNT
#define GTIM_CNT_CNT_Pos (0U)
#define GTIM_CNT_CNT_Msk (0xFFFFUL << GTIM_CNT_CNT_Pos)
#define GTIM_CNT_CNT GTIM_CNT_CNT_Msk

// GTIM_CMMR
#define GTIM_CMMR_CC0M_Pos (0U)
#define GTIM_CMMR_CC0M_Msk (0x7UL << GTIM_CMMR_CC0M_Pos)
#define GTIM_CMMR_CC0M GTIM_CMMR_CC0M_Msk
#define GTIM_CMMR_CC1M_Pos (4U)
#define GTIM_CMMR_CC1M_Msk (0x7UL << GTIM_CMMR_CC1M_Pos)
#define GTIM_CMMR_CC1M GTIM_CMMR_CC1M_Msk
#define GTIM_CMMR_CC2M_Pos (8U)
#define GTIM_CMMR_CC2M_Msk (0x7UL << GTIM_CMMR_CC2M_Pos)
#define GTIM_CMMR_CC2M GTIM_CMMR_CC2M_Msk
#define GTIM_CMMR_CC3M_Pos (12U)
#define GTIM_CMMR_CC3M_Msk (0x7UL << GTIM_CMMR_CC3M_Pos)
#define GTIM_CMMR_CC3M GTIM_CMMR_CC3M_Msk

// GTIM_CR1
#define GTIM_CR1_ETRFLT_Pos (4U)
#define GTIM_CR1_ETRFLT_Msk (0x7UL << GTIM_CR1_ETRFLT_Pos)
#define GTIM_CR1_ETRFLT GTIM_CR1_ETRFLT_Msk

// GTIM_CR0
#define GTIM_CR0_CEN_Pos (0U)
#define GTIM_CR0_CEN_Msk (0x1UL << GTIM_CR0_CEN_Pos)
#define GTIM_CR0_CEN GTIM_CR0_CEN_Msk
#define GTIM_CR0_MD_Pos (1U)
#define GTIM_CR0_MD_Msk (0x3UL << GTIM_CR0_MD_Pos)
#define GTIM_CR0_MD GTIM_CR0_MD_Msk
#define GTIM_CR0_TOGEN_Pos (3U)
#define GTIM_CR0_TOGEN_Msk (0x1UL << GTIM_CR0_TOGEN_Pos)
#define GTIM_CR0_TOGEN GTIM_CR0_TOGEN_Msk
#define GTIM_CR0_PRS_Pos (4U)
#define GTIM_CR0_PRS_Msk (0xFUL << GTIM_CR0_PRS_Pos)
#define GTIM_CR0_PRS GTIM_CR0_PRS_Msk
#define GTIM_CR0_OST_Pos (8U)
#define GTIM_CR0_OST_Msk (0x1UL << GTIM_CR0_OST_Pos)
#define GTIM_CR0_OST GTIM_CR0_OST_Msk
#define GTIM_CR0_TRS_Pos (9U)
#define GTIM_CR0_TRS_Msk (0x3UL << GTIM_CR0_TRS_Pos)
#define GTIM_CR0_TRS GTIM_CR0_TRS_Msk
#define GTIM_CR0_ETP_Pos (11U)
#define GTIM_CR0_ETP_Msk (0x1UL << GTIM_CR0_ETP_Pos)
#define GTIM_CR0_ETP GTIM_CR0_ETP_Msk

// GTIM_IER
#define GTIM_IER_UI_Pos (0U)
#define GTIM_IER_UI_Msk (0x1UL << GTIM_IER_UI_Pos)
#define GTIM_IER_UI GTIM_IER_UI_Msk
#define GTIM_IER_TI_Pos (1U)
#define GTIM_IER_TI_Msk (0x1UL << GTIM_IER_TI_Pos)
#define GTIM_IER_TI GTIM_IER_TI_Msk
#define GTIM_IER_CC0_Pos (2U)
#define GTIM_IER_CC0_Msk (0x1UL << GTIM_IER_CC0_Pos)
#define GTIM_IER_CC0 GTIM_IER_CC0_Msk
#define GTIM_IER_CC1_Pos (3U)
#define GTIM_IER_CC1_Msk (0x1UL << GTIM_IER_CC1_Pos)
#define GTIM_IER_CC1 GTIM_IER_CC1_Msk
#define GTIM_IER_CC2_Pos (4U)
#define GTIM_IER_CC2_Msk (0x1UL << GTIM_IER_CC2_Pos)
#define GTIM_IER_CC2 GTIM_IER_CC2_Msk
#define GTIM_IER_CC3_Pos (5U)
#define GTIM_IER_CC3_Msk (0x1UL << GTIM_IER_CC3_Pos)
#define GTIM_IER_CC3 GTIM_IER_CC3_Msk
#define GTIM_IER_DCC0_Pos (6U)
#define GTIM_IER_DCC0_Msk (0x1UL << GTIM_IER_DCC0_Pos)
#define GTIM_IER_DCC0 GTIM_IER_DCC0_Msk
#define GTIM_IER_DCC1_Pos (7U)
#define GTIM_IER_DCC1_Msk (0x1UL << GTIM_IER_DCC1_Pos)
#define GTIM_IER_DCC1 GTIM_IER_DCC1_Msk
#define GTIM_IER_DCC2_Pos (8U)
#define GTIM_IER_DCC2_Msk (0x1UL << GTIM_IER_DCC2_Pos)
#define GTIM_IER_DCC2 GTIM_IER_DCC2_Msk
#define GTIM_IER_DCC3_Pos (9U)
#define GTIM_IER_DCC3_Msk (0x1UL << GTIM_IER_DCC3_Pos)
#define GTIM_IER_DCC3 GTIM_IER_DCC3_Msk
#define GTIM_IER_OVTRAD_Pos (10U)
#define GTIM_IER_OVTRAD_Msk (0x1UL << GTIM_IER_OVTRAD_Pos)
#define GTIM_IER_OVTRAD GTIM_IER_OVTRAD_Msk
#define GTIM_IER_C0TRAD_Pos (11U)
#define GTIM_IER_C0TRAD_Msk (0x1UL << GTIM_IER_C0TRAD_Pos)
#define GTIM_IER_C0TRAD GTIM_IER_C0TRAD_Msk

// GTIM_IFR
#define GTIM_IFR_UI_Pos (0U)
#define GTIM_IFR_UI_Msk (0x1UL << GTIM_IFR_UI_Pos)
#define GTIM_IFR_UI GTIM_IFR_UI_Msk
#define GTIM_IFR_TI_Pos (1U)
#define GTIM_IFR_TI_Msk (0x1UL << GTIM_IFR_TI_Pos)
#define GTIM_IFR_TI GTIM_IFR_TI_Msk
#define GTIM_IFR_CC0_Pos (2U)
#define GTIM_IFR_CC0_Msk (0x1UL << GTIM_IFR_CC0_Pos)
#define GTIM_IFR_CC0 GTIM_IFR_CC0_Msk
#define GTIM_IFR_CC1_Pos (3U)
#define GTIM_IFR_CC1_Msk (0x1UL << GTIM_IFR_CC1_Pos)
#define GTIM_IFR_CC1 GTIM_IFR_CC1_Msk
#define GTIM_IFR_CC2_Pos (4U)
#define GTIM_IFR_CC2_Msk (0x1UL << GTIM_IFR_CC2_Pos)
#define GTIM_IFR_CC2 GTIM_IFR_CC2_Msk
#define GTIM_IFR_CC3_Pos (5U)
#define GTIM_IFR_CC3_Msk (0x1UL << GTIM_IFR_CC3_Pos)
#define GTIM_IFR_CC3 GTIM_IFR_CC3_Msk

// GTIM_ICR
#define GTIM_ICR_UI_Pos (0U)
#define GTIM_ICR_UI_Msk (0x1UL << GTIM_ICR_UI_Pos)
#define GTIM_ICR_UI GTIM_ICR_UI_Msk
#define GTIM_ICR_TI_Pos (1U)
#define GTIM_ICR_TI_Msk (0x1UL << GTIM_ICR_TI_Pos)
#define GTIM_ICR_TI GTIM_ICR_TI_Msk
#define GTIM_ICR_CC0_Pos (2U)
#define GTIM_ICR_CC0_Msk (0x1UL << GTIM_ICR_CC0_Pos)
#define GTIM_ICR_CC0 GTIM_ICR_CC0_Msk
#define GTIM_ICR_CC1_Pos (3U)
#define GTIM_ICR_CC1_Msk (0x1UL << GTIM_ICR_CC1_Pos)
#define GTIM_ICR_CC1 GTIM_ICR_CC1_Msk
#define GTIM_ICR_CC2_Pos (4U)
#define GTIM_ICR_CC2_Msk (0x1UL << GTIM_ICR_CC2_Pos)
#define GTIM_ICR_CC2 GTIM_ICR_CC2_Msk
#define GTIM_ICR_CC3_Pos (5U)
#define GTIM_ICR_CC3_Msk (0x1UL << GTIM_ICR_CC3_Pos)
#define GTIM_ICR_CC3 GTIM_ICR_CC3_Msk

// GTIM_CCR0
#define GTIM_CCR0_CCR_Pos (0U)
#define GTIM_CCR0_CCR_Msk (0xFFFFUL << GTIM_CCR0_CCR_Pos)
#define GTIM_CCR0_CCR GTIM_CCR0_CCR_Msk

// GTIM_CCR1
#define GTIM_CCR1_CCR_Pos (0U)
#define GTIM_CCR1_CCR_Msk (0xFFFFUL << GTIM_CCR1_CCR_Pos)
#define GTIM_CCR1_CCR GTIM_CCR1_CCR_Msk

// GTIM_CCR2
#define GTIM_CCR2_CCR_Pos (0U)
#define GTIM_CCR2_CCR_Msk (0xFFFFUL << GTIM_CCR2_CCR_Pos)
#define GTIM_CCR2_CCR GTIM_CCR2_CCR_Msk

// GTIM_CCR3
#define GTIM_CCR3_CCR_Pos (0U)
#define GTIM_CCR3_CCR_Msk (0xFFFFUL << GTIM_CCR3_CCR_Pos)
#define GTIM_CCR3_CCR GTIM_CCR3_CCR_Msk

