sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
//********************    Bits Define For Peripheral I2C    ********************//
// I2C_TMRUN
#define I2C_TMRUN_TME_Pos (0U)
#define I2C_TMRUN_TME_Msk (0x1UL << I2C_TMRUN_TME_Pos)
#define I2C_TMRUN_TME I2C_TMRUN_TME_Msk

// I2C_TM
#define I2C_TM_TM_Pos (0U)
#define I2C_TM_TM_Msk (0xFFUL << I2C_TM_TM_Pos)
#define I2C_TM_TM I2C_TM_TM_Msk

// I2C_CR
#define I2C_CR_H1M_Pos (0U)
#define I2C_CR_H1M_Msk (0x1UL << I2C_CR_H1M_Pos)
#define I2C_CR_H1M I2C_CR_H1M_Msk
#define I2C_CR_AA_Pos (2U)
#define I2C_CR_AA_Msk (0x1UL << I2C_CR_AA_Pos)
#define I2C_CR_AA I2C_CR_AA_Msk
#define I2C_CR_SI_Pos (3U)
#define I2C_CR_SI_Msk (0x1UL << I2C_CR_SI_Pos)
#define I2C_CR_SI I2C_CR_SI_Msk
#define I2C_CR_STO_Pos (4U)
#define I2C_CR_STO_Msk (0x1UL << I2C_CR_STO_Pos)
#define I2C_CR_STO I2C_CR_STO_Msk
#define I2C_CR_STA_Pos (5U)
#define I2C_CR_STA_Msk (0x1UL << I2C_CR_STA_Pos)
#define I2C_CR_STA I2C_CR_STA_Msk
#define I2C_CR_ENS_Pos (6U)
#define I2C_CR_ENS_Msk (0x1UL << I2C_CR_ENS_Pos)
#define I2C_CR_ENS I2C_CR_ENS_Msk

// I2C_DATA
#define I2C_DATA_DAT_Pos (0U)
#define I2C_DATA_DAT_Msk (0xFFUL << I2C_DATA_DAT_Pos)
#define I2C_DATA_DAT I2C_DATA_DAT_Msk

// I2C_ADDR0
#define I2C_ADDR0_GC_Pos (0U)
#define I2C_ADDR0_GC_Msk (0x1UL << I2C_ADDR0_GC_Pos)
#define I2C_ADDR0_GC I2C_ADDR0_GC_Msk
#define I2C_ADDR0_ADDR0_Pos (1U)
#define I2C_ADDR0_ADDR0_Msk (0x7FUL << I2C_ADDR0_ADDR0_Pos)
#define I2C_ADDR0_ADDR0 I2C_ADDR0_ADDR0_Msk

// I2C_STAT
#define I2C_STAT_STAT_Pos (0U)
#define I2C_STAT_STAT_Msk (0xFFUL << I2C_STAT_STAT_Pos)
#define I2C_STAT_STAT I2C_STAT_STAT_Msk

// I2C_ADDR1
#define I2C_ADDR1_ADDR_Pos (1U)
#define I2C_ADDR1_ADDR_Msk (0x7FUL << I2C_ADDR1_ADDR_Pos)
#define I2C_ADDR1_ADDR I2C_ADDR1_ADDR_Msk

// I2C_ADDR2
#define I2C_ADDR2_ADDR_Pos (1U)
#define I2C_ADDR2_ADDR_Msk (0x7FUL << I2C_ADDR2_ADDR_Pos)
#define I2C_ADDR2_ADDR I2C_ADDR2_ADDR_Msk

// I2C_MATCH
#define I2C_MATCH_AD0F_Pos (0U)
#define I2C_MATCH_AD0F_Msk (0x1UL << I2C_MATCH_AD0F_Pos)
#define I2C_MATCH_AD0F I2C_MATCH_AD0F_Msk
#define I2C_MATCH_AD1F_Pos (1U)
#define I2C_MATCH_AD1F_Msk (0x1UL << I2C_MATCH_AD1F_Pos)
#define I2C_MATCH_AD1F I2C_MATCH_AD1F_Msk
#define I2C_MATCH_AD2F_Pos (2U)
#define I2C_MATCH_AD2F_Msk (0x1UL << I2C_MATCH_AD2F_Pos)
#define I2C_MATCH_AD2F I2C_MATCH_AD2F_Msk

//********************    Bits Define For Peripheral I2CSLV    ********************//
// I2CSLV_SR
#define I2CSLV_SR_RD_Pos (0U)
#define I2CSLV_SR_RD_Msk (0x1UL << I2CSLV_SR_RD_Pos)
#define I2CSLV_SR_RD I2CSLV_SR_RD_Msk
#define I2CSLV_SR_WR_Pos (1U)
#define I2CSLV_SR_WR_Msk (0x1UL << I2CSLV_SR_WR_Pos)
#define I2CSLV_SR_WR I2CSLV_SR_WR_Msk
#define I2CSLV_SR_STOP_Pos (2U)
#define I2CSLV_SR_STOP_Msk (0x1UL << I2CSLV_SR_STOP_Pos)
#define I2CSLV_SR_STOP I2CSLV_SR_STOP_Msk
#define I2CSLV_SR_START_Pos (3U)
#define I2CSLV_SR_START_Msk (0x1UL << I2CSLV_SR_START_Pos)
#define I2CSLV_SR_START I2CSLV_SR_START_Msk
#define I2CSLV_SR_NACK_Pos (4U)
#define I2CSLV_SR_NACK_Msk (0x1UL << I2CSLV_SR_NACK_Pos)
#define I2CSLV_SR_NACK I2CSLV_SR_NACK_Msk
#define I2CSLV_SR_I2CINT_Pos (5U)
#define I2CSLV_SR_I2CINT_Msk (0x1UL << I2CSLV_SR_I2CINT_Pos)
#define I2CSLV_SR_I2CINT I2CSLV_SR_I2CINT_Msk
#define I2CSLV_SR_ACTIVE_Pos (6U)
#define I2CSLV_SR_ACTIVE_Msk (0x1UL << I2CSLV_SR_ACTIVE_Pos)
#define I2CSLV_SR_ACTIVE I2CSLV_SR_ACTIVE_Msk
#define I2CSLV_SR_HSMODE_Pos (7U)
#define I2CSLV_SR_HSMODE_Msk (0x1UL << I2CSLV_SR_HSMODE_Pos)
#define I2CSLV_SR_HSMODE I2CSLV_SR_HSMODE_Msk
#define I2CSLV_SR_TIMEOUT_Pos (8U)
#define I2CSLV_SR_TIMEOUT_Msk (0x1UL << I2CSLV_SR_TIMEOUT_Pos)
#define I2CSLV_SR_TIMEOUT I2CSLV_SR_TIMEOUT_Msk
#define I2CSLV_SR_ACK_Pos (9U)
#define I2CSLV_SR_ACK_Msk (0x1UL << I2CSLV_SR_ACK_Pos)
#define I2CSLV_SR_ACK I2CSLV_SR_ACK_Msk
#define I2CSLV_SR_SLADDR0_Pos (10U)
#define I2CSLV_SR_SLADDR0_Msk (0x1UL << I2CSLV_SR_SLADDR0_Pos)
#define I2CSLV_SR_SLADDR0 I2CSLV_SR_SLADDR0_Msk
#define I2CSLV_SR_SLADDR1_Pos (11U)
#define I2CSLV_SR_SLADDR1_Msk (0x1UL << I2CSLV_SR_SLADDR1_Pos)
#define I2CSLV_SR_SLADDR1 I2CSLV_SR_SLADDR1_Msk
#define I2CSLV_SR_SLADDR2_Pos (12U)
#define I2CSLV_SR_SLADDR2_Msk (0x1UL << I2CSLV_SR_SLADDR2_Pos)
#define I2CSLV_SR_SLADDR2 I2CSLV_SR_SLADDR2_Msk
#define I2CSLV_SR_SLADDR3_Pos (13U)
#define I2CSLV_SR_SLADDR3_Msk (0x1UL << I2CSLV_SR_SLADDR3_Pos)
#define I2CSLV_SR_SLADDR3 I2CSLV_SR_SLADDR3_Msk
#define I2CSLV_SR_TXE_Pos (14U)
#define I2CSLV_SR_TXE_Msk (0x1UL << I2CSLV_SR_TXE_Pos)
#define I2CSLV_SR_TXE I2CSLV_SR_TXE_Msk
#define I2CSLV_SR_RXNE_Pos (15U)
#define I2CSLV_SR_RXNE_Msk (0x1UL << I2CSLV_SR_RXNE_Pos)
#define I2CSLV_SR_RXNE I2CSLV_SR_RXNE_Msk
#define I2CSLV_SR_GC_Pos (16U)
#define I2CSLV_SR_GC_Msk (0x1UL << I2CSLV_SR_GC_Pos)
#define I2CSLV_SR_GC I2CSLV_SR_GC_Msk

// I2CSLV_DOUTR
#define I2CSLV_DOUTR_DOUT_Pos (0U)
#define I2CSLV_DOUTR_DOUT_Msk (0xFFUL << I2CSLV_DOUTR_DOUT_Pos)
#define I2CSLV_DOUTR_DOUT I2CSLV_DOUTR_DOUT_Msk

// I2CSLV_ADIR
#define I2CSLV_ADIR_ADIR_Pos (0U)
#define I2CSLV_ADIR_ADIR_Msk (0x3FFUL << I2CSLV_ADIR_ADIR_Pos)
#define I2CSLV_ADIR_ADIR I2CSLV_ADIR_ADIR_Msk
#define I2CSLV_ADIR_ADRLEN_Pos (10U)
#define I2CSLV_ADIR_ADRLEN_Msk (0x1UL << I2CSLV_ADIR_ADRLEN_Pos)
#define I2CSLV_ADIR_ADRLEN I2CSLV_ADIR_ADRLEN_Msk

// I2CSLV_SLADR0
#define I2CSLV_SLADR0_ADDR_Pos (0U)
#define I2CSLV_SLADR0_ADDR_Msk (0x3FFUL << I2CSLV_SLADR0_ADDR_Pos)
#define I2CSLV_SLADR0_ADDR I2CSLV_SLADR0_ADDR_Msk
#define I2CSLV_SLADR0_AM_Pos (10U)
#define I2CSLV_SLADR0_AM_Msk (0x1UL << I2CSLV_SLADR0_AM_Pos)
#define I2CSLV_SLADR0_AM I2CSLV_SLADR0_AM_Msk

// I2CSLV_SLADR1
#define I2CSLV_SLADR1_ADDR_Pos (0U)
#define I2CSLV_SLADR1_ADDR_Msk (0x3FFUL << I2CSLV_SLADR1_ADDR_Pos)
#define I2CSLV_SLADR1_ADDR I2CSLV_SLADR1_ADDR_Msk
#define I2CSLV_SLADR1_AM_Pos (10U)
#define I2CSLV_SLADR1_AM_Msk (0x1UL << I2CSLV_SLADR1_AM_Pos)
#define I2CSLV_SLADR1_AM I2CSLV_SLADR1_AM_Msk

// I2CSLV_SLADR2
#define I2CSLV_SLADR2_ADDR_Pos (0U)
#define I2CSLV_SLADR2_ADDR_Msk (0x3FFUL << I2CSLV_SLADR2_ADDR_Pos)
#define I2CSLV_SLADR2_ADDR I2CSLV_SLADR2_ADDR_Msk
#define I2CSLV_SLADR2_ADDRLEN_Pos (10U)
#define I2CSLV_SLADR2_ADDRLEN_Msk (0x1UL << I2CSLV_SLADR2_ADDRLEN_Pos)
#define I2CSLV_SLADR2_ADDRLEN I2CSLV_SLADR2_ADDRLEN_Msk

// I2CSLV_SLADR3
#define I2CSLV_SLADR3_ADDR_Pos (0U)
#define I2CSLV_SLADR3_ADDR_Msk (0x3FFUL << I2CSLV_SLADR3_ADDR_Pos)
#define I2CSLV_SLADR3_ADDR I2CSLV_SLADR3_ADDR_Msk
#define I2CSLV_SLADR3_ADDRLEN_Pos (10U)
#define I2CSLV_SLADR3_ADDRLEN_Msk (0x1UL << I2CSLV_SLADR3_ADDRLEN_Pos)
#define I2CSLV_SLADR3_ADDRLEN I2CSLV_SLADR3_ADDRLEN_Msk

// I2CSLV_DINR
#define I2CSLV_DINR_DIN_Pos (0U)
#define I2CSLV_DINR_DIN_Msk (0xFFUL << I2CSLV_DINR_DIN_Pos)
#define I2CSLV_DINR_DIN I2CSLV_DINR_DIN_Msk

// I2CSLV_CR
#define I2CSLV_CR_EN_Pos (0U)
#define I2CSLV_CR_EN_Msk (0x1UL << I2CSLV_CR_EN_Pos)
#define I2CSLV_CR_EN I2CSLV_CR_EN_Msk
#define I2CSLV_CR_BUSY_Pos (1U)
#define I2CSLV_CR_BUSY_Msk (0x1UL << I2CSLV_CR_BUSY_Pos)
#define I2CSLV_CR_BUSY I2CSLV_CR_BUSY_Msk
#define I2CSLV_CR_FSCLC_Pos (2U)
#define I2CSLV_CR_FSCLC_Msk (0x1UL << I2CSLV_CR_FSCLC_Pos)
#define I2CSLV_CR_FSCLC I2CSLV_CR_FSCLC_Msk
#define I2CSLV_CR_TIMEOUT_Pos (3U)
#define I2CSLV_CR_TIMEOUT_Msk (0x1UL << I2CSLV_CR_TIMEOUT_Pos)
#define I2CSLV_CR_TIMEOUT I2CSLV_CR_TIMEOUT_Msk
#define I2CSLV_CR_GC_Pos (7U)
#define I2CSLV_CR_GC_Msk (0x1UL << I2CSLV_CR_GC_Pos)
#define I2CSLV_CR_GC I2CSLV_CR_GC_Msk
#define I2CSLV_CR_DMATE_Pos (8U)
#define I2CSLV_CR_DMATE_Msk (0x1UL << I2CSLV_CR_DMATE_Pos)
#define I2CSLV_CR_DMATE I2CSLV_CR_DMATE_Msk
#define I2CSLV_CR_DMARE_Pos (9U)
#define I2CSLV_CR_DMARE_Msk (0x1UL << I2CSLV_CR_DMARE_Pos)
#define I2CSLV_CR_DMARE I2CSLV_CR_DMARE_Msk

