sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// I2CSLV_ADMR0
#define I2CSLV_ADMR0_ADDRMASK_Pos (0U)
#define I2CSLV_ADMR0_ADDRMASK_Msk (0x3FFUL << I2CSLV_ADMR0_ADDRMASK_Pos)
#define I2CSLV_ADMR0_ADDRMASK I2CSLV_ADMR0_ADDRMASK_Msk
#define I2CSLV_ADMR0_FACS_Pos (10U)
#define I2CSLV_ADMR0_FACS_Msk (0x1UL << I2CSLV_ADMR0_FACS_Pos)
#define I2CSLV_ADMR0_FACS I2CSLV_ADMR0_FACS_Msk

// I2CSLV_FLT
#define I2CSLV_FLT_FW_Pos (0U)
#define I2CSLV_FLT_FW_Msk (0x7UL << I2CSLV_FLT_FW_Pos)
#define I2CSLV_FLT_FW I2CSLV_FLT_FW_Msk

// I2CSLV_TOR
#define I2CSLV_TOR_TOR_Pos (0U)
#define I2CSLV_TOR_TOR_Msk (0xFFFFUL << I2CSLV_TOR_TOR_Pos)
#define I2CSLV_TOR_TOR I2CSLV_TOR_TOR_Msk

// I2CSLV_ODDR
#define I2CSLV_ODDR_ODPU_Pos (0U)
#define I2CSLV_ODDR_ODPU_Msk (0x3UL << I2CSLV_ODDR_ODPU_Pos)
#define I2CSLV_ODDR_ODPU I2CSLV_ODDR_ODPU_Msk

// I2CSLV_RSR
#define I2CSLV_RSR_NS_Pos (0U)
#define I2CSLV_RSR_NS_Msk (0x3UL << I2CSLV_RSR_NS_Pos)
#define I2CSLV_RSR_NS I2CSLV_RSR_NS_Msk

// I2CSLV_IER
#define I2CSLV_IER_RD_Pos (0U)
#define I2CSLV_IER_RD_Msk (0x1UL << I2CSLV_IER_RD_Pos)
#define I2CSLV_IER_RD I2CSLV_IER_RD_Msk
#define I2CSLV_IER_WR_Pos (1U)
#define I2CSLV_IER_WR_Msk (0x1UL << I2CSLV_IER_WR_Pos)
#define I2CSLV_IER_WR I2CSLV_IER_WR_Msk
#define I2CSLV_IER_STOP_Pos (2U)
#define I2CSLV_IER_STOP_Msk (0x1UL << I2CSLV_IER_STOP_Pos)
#define I2CSLV_IER_STOP I2CSLV_IER_STOP_Msk
#define I2CSLV_IER_START_Pos (3U)
#define I2CSLV_IER_START_Msk (0x1UL << I2CSLV_IER_START_Pos)
#define I2CSLV_IER_START I2CSLV_IER_START_Msk
#define I2CSLV_IER_NACK_Pos (4U)
#define I2CSLV_IER_NACK_Msk (0x1UL << I2CSLV_IER_NACK_Pos)
#define I2CSLV_IER_NACK I2CSLV_IER_NACK_Msk
#define I2CSLV_IER_I2CINT_Pos (5U)
#define I2CSLV_IER_I2CINT_Msk (0x1UL << I2CSLV_IER_I2CINT_Pos)
#define I2CSLV_IER_I2CINT I2CSLV_IER_I2CINT_Msk
#define I2CSLV_IER_ACTIVE_Pos (6U)
#define I2CSLV_IER_ACTIVE_Msk (0x1UL << I2CSLV_IER_ACTIVE_Pos)
#define I2CSLV_IER_ACTIVE I2CSLV_IER_ACTIVE_Msk
#define I2CSLV_IER_HSMODE_Pos (7U)
#define I2CSLV_IER_HSMODE_Msk (0x1UL << I2CSLV_IER_HSMODE_Pos)
#define I2CSLV_IER_HSMODE I2CSLV_IER_HSMODE_Msk
#define I2CSLV_IER_TIMEOUT_Pos (8U)
#define I2CSLV_IER_TIMEOUT_Msk (0x1UL << I2CSLV_IER_TIMEOUT_Pos)
#define I2CSLV_IER_TIMEOUT I2CSLV_IER_TIMEOUT_Msk
#define I2CSLV_IER_ACK_Pos (9U)
#define I2CSLV_IER_ACK_Msk (0x1UL << I2CSLV_IER_ACK_Pos)
#define I2CSLV_IER_ACK I2CSLV_IER_ACK_Msk
#define I2CSLV_IER_SLADDR0_Pos (10U)
#define I2CSLV_IER_SLADDR0_Msk (0x1UL << I2CSLV_IER_SLADDR0_Pos)
#define I2CSLV_IER_SLADDR0 I2CSLV_IER_SLADDR0_Msk
#define I2CSLV_IER_SLADDR1_Pos (11U)
#define I2CSLV_IER_SLADDR1_Msk (0x1UL << I2CSLV_IER_SLADDR1_Pos)
#define I2CSLV_IER_SLADDR1 I2CSLV_IER_SLADDR1_Msk
#define I2CSLV_IER_SLADDR2_Pos (12U)
#define I2CSLV_IER_SLADDR2_Msk (0x1UL << I2CSLV_IER_SLADDR2_Pos)
#define I2CSLV_IER_SLADDR2 I2CSLV_IER_SLADDR2_Msk
#define I2CSLV_IER_SLADDR3_Pos (13U)
#define I2CSLV_IER_SLADDR3_Msk (0x1UL << I2CSLV_IER_SLADDR3_Pos)
#define I2CSLV_IER_SLADDR3 I2CSLV_IER_SLADDR3_Msk
#define I2CSLV_IER_TXE_Pos (14U)
#define I2CSLV_IER_TXE_Msk (0x1UL << I2CSLV_IER_TXE_Pos)
#define I2CSLV_IER_TXE I2CSLV_IER_TXE_Msk
#define I2CSLV_IER_RXNE_Pos (15U)
#define I2CSLV_IER_RXNE_Msk (0x1UL << I2CSLV_IER_RXNE_Pos)
#define I2CSLV_IER_RXNE I2CSLV_IER_RXNE_Msk
#define I2CSLV_IER_GC_Pos (16U)
#define I2CSLV_IER_GC_Msk (0x1UL << I2CSLV_IER_GC_Pos)
#define I2CSLV_IER_GC I2CSLV_IER_GC_Msk

// I2CSLV_ICR
#define I2CSLV_ICR_RD_Pos (0U)
#define I2CSLV_ICR_RD_Msk (0x1UL << I2CSLV_ICR_RD_Pos)
#define I2CSLV_ICR_RD I2CSLV_ICR_RD_Msk
#define I2CSLV_ICR_WR_Pos (1U)
#define I2CSLV_ICR_WR_Msk (0x1UL << I2CSLV_ICR_WR_Pos)
#define I2CSLV_ICR_WR I2CSLV_ICR_WR_Msk
#define I2CSLV_ICR_STOP_Pos (2U)
#define I2CSLV_ICR_STOP_Msk (0x1UL << I2CSLV_ICR_STOP_Pos)
#define I2CSLV_ICR_STOP I2CSLV_ICR_STOP_Msk
#define I2CSLV_ICR_START_Pos (3U)
#define I2CSLV_ICR_START_Msk (0x1UL << I2CSLV_ICR_START_Pos)
#define I2CSLV_ICR_START I2CSLV_ICR_START_Msk
#define I2CSLV_ICR_NACK_Pos (4U)
#define I2CSLV_ICR_NACK_Msk (0x1UL << I2CSLV_ICR_NACK_Pos)
#define I2CSLV_ICR_NACK I2CSLV_ICR_NACK_Msk
#define I2CSLV_ICR_I2CINT_Pos (5U)
#define I2CSLV_ICR_I2CINT_Msk (0x1UL << I2CSLV_ICR_I2CINT_Pos)
#define I2CSLV_ICR_I2CINT I2CSLV_ICR_I2CINT_Msk
#define I2CSLV_ICR_ACTIVE_Pos (6U)
#define I2CSLV_ICR_ACTIVE_Msk (0x1UL << I2CSLV_ICR_ACTIVE_Pos)
#define I2CSLV_ICR_ACTIVE I2CSLV_ICR_ACTIVE_Msk
#define I2CSLV_ICR_HSMODE_Pos (7U)
#define I2CSLV_ICR_HSMODE_Msk (0x1UL << I2CSLV_ICR_HSMODE_Pos)
#define I2CSLV_ICR_HSMODE I2CSLV_ICR_HSMODE_Msk
#define I2CSLV_ICR_TIMEOUT_Pos (8U)
#define I2CSLV_ICR_TIMEOUT_Msk (0x1UL << I2CSLV_ICR_TIMEOUT_Pos)
#define I2CSLV_ICR_TIMEOUT I2CSLV_ICR_TIMEOUT_Msk
#define I2CSLV_ICR_ACK_Pos (9U)
#define I2CSLV_ICR_ACK_Msk (0x1UL << I2CSLV_ICR_ACK_Pos)
#define I2CSLV_ICR_ACK I2CSLV_ICR_ACK_Msk
#define I2CSLV_ICR_SLADDR0_Pos (10U)
#define I2CSLV_ICR_SLADDR0_Msk (0x1UL << I2CSLV_ICR_SLADDR0_Pos)
#define I2CSLV_ICR_SLADDR0 I2CSLV_ICR_SLADDR0_Msk
#define I2CSLV_ICR_SLADDR1_Pos (11U)
#define I2CSLV_ICR_SLADDR1_Msk (0x1UL << I2CSLV_ICR_SLADDR1_Pos)
#define I2CSLV_ICR_SLADDR1 I2CSLV_ICR_SLADDR1_Msk
#define I2CSLV_ICR_SLADDR2_Pos (12U)
#define I2CSLV_ICR_SLADDR2_Msk (0x1UL << I2CSLV_ICR_SLADDR2_Pos)
#define I2CSLV_ICR_SLADDR2 I2CSLV_ICR_SLADDR2_Msk
#define I2CSLV_ICR_SLADDR3_Pos (13U)
#define I2CSLV_ICR_SLADDR3_Msk (0x1UL << I2CSLV_ICR_SLADDR3_Pos)
#define I2CSLV_ICR_SLADDR3 I2CSLV_ICR_SLADDR3_Msk
#define I2CSLV_ICR_TXE_Pos (14U)
#define I2CSLV_ICR_TXE_Msk (0x1UL << I2CSLV_ICR_TXE_Pos)
#define I2CSLV_ICR_TXE I2CSLV_ICR_TXE_Msk
#define I2CSLV_ICR_RXNE_Pos (15U)
#define I2CSLV_ICR_RXNE_Msk (0x1UL << I2CSLV_ICR_RXNE_Pos)
#define I2CSLV_ICR_RXNE I2CSLV_ICR_RXNE_Msk
#define I2CSLV_ICR_GC_Pos (16U)
#define I2CSLV_ICR_GC_Msk (0x1UL << I2CSLV_ICR_GC_Pos)
#define I2CSLV_ICR_GC I2CSLV_ICR_GC_Msk

// I2CSLV_DIDR
#define I2CSLV_DIDR_RID_Pos (0U)
#define I2CSLV_DIDR_RID_Msk (0x7UL << I2CSLV_DIDR_RID_Pos)
#define I2CSLV_DIDR_RID I2CSLV_DIDR_RID_Msk
#define I2CSLV_DIDR_PID_Pos (3U)
#define I2CSLV_DIDR_PID_Msk (0x1FFUL << I2CSLV_DIDR_PID_Pos)
#define I2CSLV_DIDR_PID I2CSLV_DIDR_PID_Msk
#define I2CSLV_DIDR_MID_Pos (12U)
#define I2CSLV_DIDR_MID_Msk (0xFFFUL << I2CSLV_DIDR_MID_Pos)
#define I2CSLV_DIDR_MID I2CSLV_DIDR_MID_Msk

//********************    Bits Define For Peripheral IWDT    ********************//
// IWDT_KR
#define IWDT_KR_KR_Pos (0U)
#define IWDT_KR_KR_Msk (0xFFFFUL << IWDT_KR_KR_Pos)
#define IWDT_KR_KR IWDT_KR_KR_Msk

// IWDT_CR
#define IWDT_CR_PRS_Pos (0U)
#define IWDT_CR_PRS_Msk (0x7UL << IWDT_CR_PRS_Pos)
#define IWDT_CR_PRS IWDT_CR_PRS_Msk
#define IWDT_CR_IE_Pos (4U)
#define IWDT_CR_IE_Msk (0x1UL << IWDT_CR_IE_Pos)
#define IWDT_CR_IE IWDT_CR_IE_Msk
#define IWDT_CR_ACTION_Pos (5U)
#define IWDT_CR_ACTION_Msk (0x1UL << IWDT_CR_ACTION_Pos)
#define IWDT_CR_ACTION IWDT_CR_ACTION_Msk
#define IWDT_CR_PAUSE_Pos (6U)
#define IWDT_CR_PAUSE_Msk (0x1UL << IWDT_CR_PAUSE_Pos)
#define IWDT_CR_PAUSE IWDT_CR_PAUSE_Msk

