sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// IWDT_ARR
#define IWDT_ARR_ARR_Pos (0U)
#define IWDT_ARR_ARR_Msk (0xFFFUL << IWDT_ARR_ARR_Pos)
#define IWDT_ARR_ARR IWDT_ARR_ARR_Msk

// IWDT_SR
#define IWDT_SR_PRSF_Pos (0U)
#define IWDT_SR_PRSF_Msk (0x1UL << IWDT_SR_PRSF_Pos)
#define IWDT_SR_PRSF IWDT_SR_PRSF_Msk
#define IWDT_SR_ARRF_Pos (1U)
#define IWDT_SR_ARRF_Msk (0x1UL << IWDT_SR_ARRF_Pos)
#define IWDT_SR_ARRF IWDT_SR_ARRF_Msk
#define IWDT_SR_WINRF_Pos (2U)
#define IWDT_SR_WINRF_Msk (0x1UL << IWDT_SR_WINRF_Pos)
#define IWDT_SR_WINRF IWDT_SR_WINRF_Msk
#define IWDT_SR_OV_Pos (3U)
#define IWDT_SR_OV_Msk (0x1UL << IWDT_SR_OV_Pos)
#define IWDT_SR_OV IWDT_SR_OV_Msk
#define IWDT_SR_RUN_Pos (4U)
#define IWDT_SR_RUN_Msk (0x1UL << IWDT_SR_RUN_Pos)
#define IWDT_SR_RUN IWDT_SR_RUN_Msk

// IWDT_WINR
#define IWDT_WINR_WINR_Pos (0U)
#define IWDT_WINR_WINR_Msk (0xFFFUL << IWDT_WINR_WINR_Pos)
#define IWDT_WINR_WINR IWDT_WINR_WINR_Msk

//********************    Bits Define For Peripheral LPTIM    ********************//
// LPTIM_CNT
#define LPTIM_CNT_CNT_Pos (0U)
#define LPTIM_CNT_CNT_Msk (0xFFFFUL << LPTIM_CNT_CNT_Pos)
#define LPTIM_CNT_CNT LPTIM_CNT_CNT_Msk

// LPTIM_ARR
#define LPTIM_ARR_ARR_Pos (0U)
#define LPTIM_ARR_ARR_Msk (0xFFFFUL << LPTIM_ARR_ARR_Pos)
#define LPTIM_ARR_ARR LPTIM_ARR_ARR_Msk

// LPTIM_CR
#define LPTIM_CR_CEN_Pos (0U)
#define LPTIM_CR_CEN_Msk (0x1UL << LPTIM_CR_CEN_Pos)
#define LPTIM_CR_CEN LPTIM_CR_CEN_Msk
#define LPTIM_CR_MD_Pos (1U)
#define LPTIM_CR_MD_Msk (0x1UL << LPTIM_CR_MD_Pos)
#define LPTIM_CR_MD LPTIM_CR_MD_Msk
#define LPTIM_CR_CT_Pos (2U)
#define LPTIM_CR_CT_Msk (0x1UL << LPTIM_CR_CT_Pos)
#define LPTIM_CR_CT LPTIM_CR_CT_Msk
#define LPTIM_CR_TOG_EN_Pos (3U)
#define LPTIM_CR_TOG_EN_Msk (0x1UL << LPTIM_CR_TOG_EN_Pos)
#define LPTIM_CR_TOG_EN LPTIM_CR_TOG_EN_Msk
#define LPTIM_CR_TCK_SEL_Pos (4U)
#define LPTIM_CR_TCK_SEL_Msk (0x3UL << LPTIM_CR_TCK_SEL_Pos)
#define LPTIM_CR_TCK_SEL LPTIM_CR_TCK_SEL_Msk
#define LPTIM_CR_WT_FLAG_Pos (7U)
#define LPTIM_CR_WT_FLAG_Msk (0x1UL << LPTIM_CR_WT_FLAG_Pos)
#define LPTIM_CR_WT_FLAG LPTIM_CR_WT_FLAG_Msk
#define LPTIM_CR_GATE_Pos (8U)
#define LPTIM_CR_GATE_Msk (0x1UL << LPTIM_CR_GATE_Pos)
#define LPTIM_CR_GATE LPTIM_CR_GATE_Msk
#define LPTIM_CR_GATE_P_Pos (9U)
#define LPTIM_CR_GATE_P_Msk (0x1UL << LPTIM_CR_GATE_P_Pos)
#define LPTIM_CR_GATE_P LPTIM_CR_GATE_P_Msk
#define LPTIM_CR_IE_Pos (10U)
#define LPTIM_CR_IE_Msk (0x1UL << LPTIM_CR_IE_Pos)
#define LPTIM_CR_IE LPTIM_CR_IE_Msk
#define LPTIM_CR_PRS_Pos (11U)
#define LPTIM_CR_PRS_Msk (0xFUL << LPTIM_CR_PRS_Pos)
#define LPTIM_CR_PRS LPTIM_CR_PRS_Msk

// LPTIM_IFR
#define LPTIM_IFR_OV_Pos (0U)
#define LPTIM_IFR_OV_Msk (0x1UL << LPTIM_IFR_OV_Pos)
#define LPTIM_IFR_OV LPTIM_IFR_OV_Msk

// LPTIM_ICLR
#define LPTIM_ICLR_OV_Pos (0U)
#define LPTIM_ICLR_OV_Msk (0x1UL << LPTIM_ICLR_OV_Pos)
#define LPTIM_ICLR_OV LPTIM_ICLR_OV_Msk

//********************    Bits Define For Peripheral LPUART    ********************//
// LPUART_SBUF
#define LPUART_SBUF_DATA_Pos (0U)
#define LPUART_SBUF_DATA_Msk (0xFFUL << LPUART_SBUF_DATA_Pos)
#define LPUART_SBUF_DATA LPUART_SBUF_DATA_Msk
#define LPUART_SBUF_DR8_Pos (8U)
#define LPUART_SBUF_DR8_Msk (0x1UL << LPUART_SBUF_DR8_Pos)
#define LPUART_SBUF_DR8 LPUART_SBUF_DR8_Msk

// LPUART_SCON
#define LPUART_SCON_RCIE_Pos (0U)
#define LPUART_SCON_RCIE_Msk (0x1UL << LPUART_SCON_RCIE_Pos)
#define LPUART_SCON_RCIE LPUART_SCON_RCIE_Msk
#define LPUART_SCON_TCIE_Pos (1U)
#define LPUART_SCON_TCIE_Msk (0x1UL << LPUART_SCON_TCIE_Pos)
#define LPUART_SCON_TCIE LPUART_SCON_TCIE_Msk
#define LPUART_SCON_DR8CFG_Pos (2U)
#define LPUART_SCON_DR8CFG_Msk (0x3UL << LPUART_SCON_DR8CFG_Pos)
#define LPUART_SCON_DR8CFG LPUART_SCON_DR8CFG_Msk
#define LPUART_SCON_RXEN_Pos (4U)
#define LPUART_SCON_RXEN_Msk (0x1UL << LPUART_SCON_RXEN_Pos)
#define LPUART_SCON_RXEN LPUART_SCON_RXEN_Msk
#define LPUART_SCON_ADRDET_Pos (5U)
#define LPUART_SCON_ADRDET_Msk (0x1UL << LPUART_SCON_ADRDET_Pos)
#define LPUART_SCON_ADRDET LPUART_SCON_ADRDET_Msk
#define LPUART_SCON_MODE_Pos (6U)
#define LPUART_SCON_MODE_Msk (0x3UL << LPUART_SCON_MODE_Pos)
#define LPUART_SCON_MODE LPUART_SCON_MODE_Msk
#define LPUART_SCON_TXEIE_Pos (8U)
#define LPUART_SCON_TXEIE_Msk (0x1UL << LPUART_SCON_TXEIE_Pos)
#define LPUART_SCON_TXEIE LPUART_SCON_TXEIE_Msk
#define LPUART_SCON_OVER_Pos (9U)
#define LPUART_SCON_OVER_Msk (0x3UL << LPUART_SCON_OVER_Pos)
#define LPUART_SCON_OVER LPUART_SCON_OVER_Msk
#define LPUART_SCON_CLKSRC_Pos (11U)
#define LPUART_SCON_CLKSRC_Msk (0x3UL << LPUART_SCON_CLKSRC_Pos)
#define LPUART_SCON_CLKSRC LPUART_SCON_CLKSRC_Msk
#define LPUART_SCON_PEIE_Pos (13U)
#define LPUART_SCON_PEIE_Msk (0x1UL << LPUART_SCON_PEIE_Pos)
#define LPUART_SCON_PEIE LPUART_SCON_PEIE_Msk
#define LPUART_SCON_STOP_Pos (14U)
#define LPUART_SCON_STOP_Msk (0x3UL << LPUART_SCON_STOP_Pos)
#define LPUART_SCON_STOP LPUART_SCON_STOP_Msk
#define LPUART_SCON_DMARXEN_Pos (16U)
#define LPUART_SCON_DMARXEN_Msk (0x1UL << LPUART_SCON_DMARXEN_Pos)
#define LPUART_SCON_DMARXEN LPUART_SCON_DMARXEN_Msk
#define LPUART_SCON_DMATXEN_Pos (17U)
#define LPUART_SCON_DMATXEN_Msk (0x1UL << LPUART_SCON_DMATXEN_Pos)
#define LPUART_SCON_DMATXEN LPUART_SCON_DMATXEN_Msk
#define LPUART_SCON_RTSEN_Pos (18U)
#define LPUART_SCON_RTSEN_Msk (0x1UL << LPUART_SCON_RTSEN_Pos)
#define LPUART_SCON_RTSEN LPUART_SCON_RTSEN_Msk
#define LPUART_SCON_CTSEN_Pos (19U)
#define LPUART_SCON_CTSEN_Msk (0x1UL << LPUART_SCON_CTSEN_Pos)
#define LPUART_SCON_CTSEN LPUART_SCON_CTSEN_Msk
#define LPUART_SCON_CTSIE_Pos (20U)
#define LPUART_SCON_CTSIE_Msk (0x1UL << LPUART_SCON_CTSIE_Pos)
#define LPUART_SCON_CTSIE LPUART_SCON_CTSIE_Msk
#define LPUART_SCON_FEIE_Pos (21U)
#define LPUART_SCON_FEIE_Msk (0x1UL << LPUART_SCON_FEIE_Pos)
#define LPUART_SCON_FEIE LPUART_SCON_FEIE_Msk
#define LPUART_SCON_HDSEL_Pos (22U)
#define LPUART_SCON_HDSEL_Msk (0x1UL << LPUART_SCON_HDSEL_Pos)
#define LPUART_SCON_HDSEL LPUART_SCON_HDSEL_Msk

// LPUART_SADDR
#define LPUART_SADDR_ADDR_Pos (0U)
#define LPUART_SADDR_ADDR_Msk (0xFFUL << LPUART_SADDR_ADDR_Pos)
#define LPUART_SADDR_ADDR LPUART_SADDR_ADDR_Msk

// LPUART_SADEN
#define LPUART_SADEN_SADEN_Pos (0U)
#define LPUART_SADEN_SADEN_Msk (0xFFUL << LPUART_SADEN_SADEN_Pos)
#define LPUART_SADEN_SADEN LPUART_SADEN_SADEN_Msk

