sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// LPUART_ISR
#define LPUART_ISR_RC_Pos (0U)
#define LPUART_ISR_RC_Msk (0x1UL << LPUART_ISR_RC_Pos)
#define LPUART_ISR_RC LPUART_ISR_RC_Msk
#define LPUART_ISR_TC_Pos (1U)
#define LPUART_ISR_TC_Msk (0x1UL << LPUART_ISR_TC_Pos)
#define LPUART_ISR_TC LPUART_ISR_TC_Msk
#define LPUART_ISR_FE_Pos (2U)
#define LPUART_ISR_FE_Msk (0x1UL << LPUART_ISR_FE_Pos)
#define LPUART_ISR_FE LPUART_ISR_FE_Msk
#define LPUART_ISR_TXE_Pos (3U)
#define LPUART_ISR_TXE_Msk (0x1UL << LPUART_ISR_TXE_Pos)
#define LPUART_ISR_TXE LPUART_ISR_TXE_Msk
#define LPUART_ISR_PE_Pos (4U)
#define LPUART_ISR_PE_Msk (0x1UL << LPUART_ISR_PE_Pos)
#define LPUART_ISR_PE LPUART_ISR_PE_Msk
#define LPUART_ISR_CTSIF_Pos (5U)
#define LPUART_ISR_CTSIF_Msk (0x1UL << LPUART_ISR_CTSIF_Pos)
#define LPUART_ISR_CTSIF LPUART_ISR_CTSIF_Msk
#define LPUART_ISR_CTS_Pos (6U)
#define LPUART_ISR_CTS_Msk (0x1UL << LPUART_ISR_CTS_Pos)
#define LPUART_ISR_CTS LPUART_ISR_CTS_Msk

// LPUART_ICR
#define LPUART_ICR_RC_Pos (0U)
#define LPUART_ICR_RC_Msk (0x1UL << LPUART_ICR_RC_Pos)
#define LPUART_ICR_RC LPUART_ICR_RC_Msk
#define LPUART_ICR_TC_Pos (1U)
#define LPUART_ICR_TC_Msk (0x1UL << LPUART_ICR_TC_Pos)
#define LPUART_ICR_TC LPUART_ICR_TC_Msk
#define LPUART_ICR_FE_Pos (2U)
#define LPUART_ICR_FE_Msk (0x1UL << LPUART_ICR_FE_Pos)
#define LPUART_ICR_FE LPUART_ICR_FE_Msk
#define LPUART_ICR_PE_Pos (4U)
#define LPUART_ICR_PE_Msk (0x1UL << LPUART_ICR_PE_Pos)
#define LPUART_ICR_PE LPUART_ICR_PE_Msk
#define LPUART_ICR_CTSIF_Pos (5U)
#define LPUART_ICR_CTSIF_Msk (0x1UL << LPUART_ICR_CTSIF_Pos)
#define LPUART_ICR_CTSIF LPUART_ICR_CTSIF_Msk

// LPUART_SCNT
#define LPUART_SCNT_SCNT_Pos (0U)
#define LPUART_SCNT_SCNT_Msk (0xFFFFUL << LPUART_SCNT_SCNT_Pos)
#define LPUART_SCNT_SCNT LPUART_SCNT_SCNT_Msk

//********************    Bits Define For Peripheral LVD    ********************//
// LVD_CR
#define LVD_CR_LVDEN_Pos (0U)
#define LVD_CR_LVDEN_Msk (0x1UL << LVD_CR_LVDEN_Pos)
#define LVD_CR_LVDEN LVD_CR_LVDEN_Msk
#define LVD_CR_ACT_Pos (1U)
#define LVD_CR_ACT_Msk (0x1UL << LVD_CR_ACT_Pos)
#define LVD_CR_ACT LVD_CR_ACT_Msk
#define LVD_CR_SOURCE_Pos (2U)
#define LVD_CR_SOURCE_Msk (0x3UL << LVD_CR_SOURCE_Pos)
#define LVD_CR_SOURCE LVD_CR_SOURCE_Msk
#define LVD_CR_VTDS_Pos (4U)
#define LVD_CR_VTDS_Msk (0xFUL << LVD_CR_VTDS_Pos)
#define LVD_CR_VTDS LVD_CR_VTDS_Msk
#define LVD_CR_FLTEN_Pos (8U)
#define LVD_CR_FLTEN_Msk (0x1UL << LVD_CR_FLTEN_Pos)
#define LVD_CR_FLTEN LVD_CR_FLTEN_Msk
#define LVD_CR_DEBOUNCETIME_Pos (9U)
#define LVD_CR_DEBOUNCETIME_Msk (0x7UL << LVD_CR_DEBOUNCETIME_Pos)
#define LVD_CR_DEBOUNCETIME LVD_CR_DEBOUNCETIME_Msk
#define LVD_CR_FTEN_Pos (12U)
#define LVD_CR_FTEN_Msk (0x1UL << LVD_CR_FTEN_Pos)
#define LVD_CR_FTEN LVD_CR_FTEN_Msk
#define LVD_CR_RTEN_Pos (13U)
#define LVD_CR_RTEN_Msk (0x1UL << LVD_CR_RTEN_Pos)
#define LVD_CR_RTEN LVD_CR_RTEN_Msk
#define LVD_CR_HTEN_Pos (14U)
#define LVD_CR_HTEN_Msk (0x1UL << LVD_CR_HTEN_Pos)
#define LVD_CR_HTEN LVD_CR_HTEN_Msk
#define LVD_CR_IE_Pos (15U)
#define LVD_CR_IE_Msk (0x1UL << LVD_CR_IE_Pos)
#define LVD_CR_IE LVD_CR_IE_Msk

// LVD_SR
#define LVD_SR_INTF_Pos (0U)
#define LVD_SR_INTF_Msk (0x1UL << LVD_SR_INTF_Pos)
#define LVD_SR_INTF LVD_SR_INTF_Msk
#define LVD_SR_FILTER_Pos (1U)
#define LVD_SR_FILTER_Msk (0x1UL << LVD_SR_FILTER_Pos)
#define LVD_SR_FILTER LVD_SR_FILTER_Msk

//********************    Bits Define For Peripheral OPA    ********************//
// OPA_CR0
#define OPA_CR0_OPAEN_Pos (0U)
#define OPA_CR0_OPAEN_Msk (0x1UL << OPA_CR0_OPAEN_Pos)
#define OPA_CR0_OPAEN OPA_CR0_OPAEN_Msk
#define OPA_CR0_AZEN_Pos (1U)
#define OPA_CR0_AZEN_Msk (0x1UL << OPA_CR0_AZEN_Pos)
#define OPA_CR0_AZEN OPA_CR0_AZEN_Msk
#define OPA_CR0_BIASSEL_Pos (7U)
#define OPA_CR0_BIASSEL_Msk (0x7UL << OPA_CR0_BIASSEL_Pos)
#define OPA_CR0_BIASSEL OPA_CR0_BIASSEL_Msk

// OPA_CR1
#define OPA_CR1_OPAEN_Pos (0U)
#define OPA_CR1_OPAEN_Msk (0x1UL << OPA_CR1_OPAEN_Pos)
#define OPA_CR1_OPAEN OPA_CR1_OPAEN_Msk
#define OPA_CR1_AZEN_Pos (1U)
#define OPA_CR1_AZEN_Msk (0x1UL << OPA_CR1_AZEN_Pos)
#define OPA_CR1_AZEN OPA_CR1_AZEN_Msk
#define OPA_CR1_BIASSEL_Pos (7U)
#define OPA_CR1_BIASSEL_Msk (0x7UL << OPA_CR1_BIASSEL_Pos)
#define OPA_CR1_BIASSEL OPA_CR1_BIASSEL_Msk

// OPA_AZ
#define OPA_AZ_ADCTREN_Pos (0U)
#define OPA_AZ_ADCTREN_Msk (0x1UL << OPA_AZ_ADCTREN_Pos)
#define OPA_AZ_ADCTREN OPA_AZ_ADCTREN_Msk
#define OPA_AZ_TRIGGER_Pos (1U)
#define OPA_AZ_TRIGGER_Msk (0x1UL << OPA_AZ_TRIGGER_Pos)
#define OPA_AZ_TRIGGER OPA_AZ_TRIGGER_Msk
#define OPA_AZ_AZPULSE_Pos (2U)
#define OPA_AZ_AZPULSE_Msk (0x1UL << OPA_AZ_AZPULSE_Pos)
#define OPA_AZ_AZPULSE OPA_AZ_AZPULSE_Msk
#define OPA_AZ_CLKSWSET_Pos (3U)
#define OPA_AZ_CLKSWSET_Msk (0x1UL << OPA_AZ_CLKSWSET_Pos)
#define OPA_AZ_CLKSWSET OPA_AZ_CLKSWSET_Msk
#define OPA_AZ_CLKSEL_Pos (4U)
#define OPA_AZ_CLKSEL_Msk (0xFUL << OPA_AZ_CLKSEL_Pos)
#define OPA_AZ_CLKSEL OPA_AZ_CLKSEL_Msk

//********************    Bits Define For Peripheral RAM    ********************//
// RAM_CR
#define RAM_CR_IE_Pos (1U)
#define RAM_CR_IE_Msk (0x1UL << RAM_CR_IE_Pos)
#define RAM_CR_IE RAM_CR_IE_Msk

// RAM_ERRADDR
#define RAM_ERRADDR_ERRADDR_Pos (0U)
#define RAM_ERRADDR_ERRADDR_Msk (0x3FFFUL << RAM_ERRADDR_ERRADDR_Pos)
#define RAM_ERRADDR_ERRADDR RAM_ERRADDR_ERRADDR_Msk

// RAM_IFR
#define RAM_IFR_ERR_Pos (0U)
#define RAM_IFR_ERR_Msk (0x1UL << RAM_IFR_ERR_Pos)
#define RAM_IFR_ERR RAM_IFR_ERR_Msk

// RAM_ICLR
#define RAM_ICLR_ERRCLR_Pos (0U)
#define RAM_ICLR_ERRCLR_Msk (0x1UL << RAM_ICLR_ERRCLR_Pos)
#define RAM_ICLR_ERRCLR RAM_ICLR_ERRCLR_Msk

//********************    Bits Define For Peripheral RTC    ********************//
// RTC_CR0
#define RTC_CR0_PRDS_Pos (0U)
#define RTC_CR0_PRDS_Msk (0x7UL << RTC_CR0_PRDS_Pos)
#define RTC_CR0_PRDS RTC_CR0_PRDS_Msk
#define RTC_CR0_AMPM_Pos (3U)
#define RTC_CR0_AMPM_Msk (0x1UL << RTC_CR0_AMPM_Pos)
#define RTC_CR0_AMPM RTC_CR0_AMPM_Msk
#define RTC_CR0_HZ1OE_Pos (5U)
#define RTC_CR0_HZ1OE_Msk (0x1UL << RTC_CR0_HZ1OE_Pos)
#define RTC_CR0_HZ1OE RTC_CR0_HZ1OE_Msk
#define RTC_CR0_HZ1SEL_Pos (6U)
#define RTC_CR0_HZ1SEL_Msk (0x1UL << RTC_CR0_HZ1SEL_Pos)
#define RTC_CR0_HZ1SEL RTC_CR0_HZ1SEL_Msk
#define RTC_CR0_START_Pos (7U)
#define RTC_CR0_START_Msk (0x1UL << RTC_CR0_START_Pos)
#define RTC_CR0_START RTC_CR0_START_Msk
#define RTC_CR0_PRDX_Pos (8U)
#define RTC_CR0_PRDX_Msk (0x3FUL << RTC_CR0_PRDX_Pos)
#define RTC_CR0_PRDX RTC_CR0_PRDX_Msk
#define RTC_CR0_PRDSEL_Pos (14U)
#define RTC_CR0_PRDSEL_Msk (0x1UL << RTC_CR0_PRDSEL_Pos)
#define RTC_CR0_PRDSEL RTC_CR0_PRDSEL_Msk
#define RTC_CR0_TEST_Pos (15U)
#define RTC_CR0_TEST_Msk (0x1UL << RTC_CR0_TEST_Pos)
#define RTC_CR0_TEST RTC_CR0_TEST_Msk

