sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// RTC_CR1
#define RTC_CR1_WAIT_Pos (0U)
#define RTC_CR1_WAIT_Msk (0x1UL << RTC_CR1_WAIT_Pos)
#define RTC_CR1_WAIT RTC_CR1_WAIT_Msk
#define RTC_CR1_WAITF_Pos (1U)
#define RTC_CR1_WAITF_Msk (0x1UL << RTC_CR1_WAITF_Pos)
#define RTC_CR1_WAITF RTC_CR1_WAITF_Msk
#define RTC_CR1_CKSEL_Pos (8U)
#define RTC_CR1_CKSEL_Msk (0x7UL << RTC_CR1_CKSEL_Pos)
#define RTC_CR1_CKSEL RTC_CR1_CKSEL_Msk

// RTC_SEC
#define RTC_SEC_SECL_Pos (0U)
#define RTC_SEC_SECL_Msk (0xFUL << RTC_SEC_SECL_Pos)
#define RTC_SEC_SECL RTC_SEC_SECL_Msk
#define RTC_SEC_SECH_Pos (4U)
#define RTC_SEC_SECH_Msk (0x7UL << RTC_SEC_SECH_Pos)
#define RTC_SEC_SECH RTC_SEC_SECH_Msk

// RTC_MIN
#define RTC_MIN_MINL_Pos (0U)
#define RTC_MIN_MINL_Msk (0xFUL << RTC_MIN_MINL_Pos)
#define RTC_MIN_MINL RTC_MIN_MINL_Msk
#define RTC_MIN_MINH_Pos (4U)
#define RTC_MIN_MINH_Msk (0x7UL << RTC_MIN_MINH_Pos)
#define RTC_MIN_MINH RTC_MIN_MINH_Msk

// RTC_HOUR
#define RTC_HOUR_HOURL_Pos (0U)
#define RTC_HOUR_HOURL_Msk (0xFUL << RTC_HOUR_HOURL_Pos)
#define RTC_HOUR_HOURL RTC_HOUR_HOURL_Msk
#define RTC_HOUR_HOURH_Pos (4U)
#define RTC_HOUR_HOURH_Msk (0x3UL << RTC_HOUR_HOURH_Pos)
#define RTC_HOUR_HOURH RTC_HOUR_HOURH_Msk

// RTC_WEEK
#define RTC_WEEK_WEEK_Pos (0U)
#define RTC_WEEK_WEEK_Msk (0x7UL << RTC_WEEK_WEEK_Pos)
#define RTC_WEEK_WEEK RTC_WEEK_WEEK_Msk

// RTC_DAY
#define RTC_DAY_DAYL_Pos (0U)
#define RTC_DAY_DAYL_Msk (0xFUL << RTC_DAY_DAYL_Pos)
#define RTC_DAY_DAYL RTC_DAY_DAYL_Msk
#define RTC_DAY_DAYH_Pos (4U)
#define RTC_DAY_DAYH_Msk (0x3UL << RTC_DAY_DAYH_Pos)
#define RTC_DAY_DAYH RTC_DAY_DAYH_Msk

// RTC_MON
#define RTC_MON_MON_Pos (0U)
#define RTC_MON_MON_Msk (0x1FUL << RTC_MON_MON_Pos)
#define RTC_MON_MON RTC_MON_MON_Msk

// RTC_YEAR
#define RTC_YEAR_YEARL_Pos (0U)
#define RTC_YEAR_YEARL_Msk (0xFUL << RTC_YEAR_YEARL_Pos)
#define RTC_YEAR_YEARL RTC_YEAR_YEARL_Msk
#define RTC_YEAR_YEARH_Pos (4U)
#define RTC_YEAR_YEARH_Msk (0xFUL << RTC_YEAR_YEARH_Pos)
#define RTC_YEAR_YEARH RTC_YEAR_YEARH_Msk

// RTC_COMPEN
#define RTC_COMPEN_CR_Pos (0U)
#define RTC_COMPEN_CR_Msk (0x1FFUL << RTC_COMPEN_CR_Pos)
#define RTC_COMPEN_CR RTC_COMPEN_CR_Msk
#define RTC_COMPEN_EN_Pos (15U)
#define RTC_COMPEN_EN_Msk (0x1UL << RTC_COMPEN_EN_Pos)
#define RTC_COMPEN_EN RTC_COMPEN_EN_Msk

// RTC_CR2
#define RTC_CR2_WUCKSEL_Pos (0U)
#define RTC_CR2_WUCKSEL_Msk (0x7UL << RTC_CR2_WUCKSEL_Pos)
#define RTC_CR2_WUCKSEL RTC_CR2_WUCKSEL_Msk
#define RTC_CR2_TSEDG_Pos (3U)
#define RTC_CR2_TSEDG_Msk (0x1UL << RTC_CR2_TSEDG_Pos)
#define RTC_CR2_TSEDG RTC_CR2_TSEDG_Msk
#define RTC_CR2_O2SEL_Pos (4U)
#define RTC_CR2_O2SEL_Msk (0x3UL << RTC_CR2_O2SEL_Pos)
#define RTC_CR2_O2SEL RTC_CR2_O2SEL_Msk
#define RTC_CR2_TSE_Pos (6U)
#define RTC_CR2_TSE_Msk (0x1UL << RTC_CR2_TSE_Pos)
#define RTC_CR2_TSE RTC_CR2_TSE_Msk
#define RTC_CR2_WUTE_Pos (7U)
#define RTC_CR2_WUTE_Msk (0x1UL << RTC_CR2_WUTE_Pos)
#define RTC_CR2_WUTE RTC_CR2_WUTE_Msk
#define RTC_CR2_ALMAE_Pos (9U)
#define RTC_CR2_ALMAE_Msk (0x1UL << RTC_CR2_ALMAE_Pos)
#define RTC_CR2_ALMAE RTC_CR2_ALMAE_Msk
#define RTC_CR2_ALMBE_Pos (10U)
#define RTC_CR2_ALMBE_Msk (0x1UL << RTC_CR2_ALMBE_Pos)
#define RTC_CR2_ALMBE RTC_CR2_ALMBE_Msk

// RTC_ALMA
#define RTC_ALMA_SECL_Pos (0U)
#define RTC_ALMA_SECL_Msk (0xFUL << RTC_ALMA_SECL_Pos)
#define RTC_ALMA_SECL RTC_ALMA_SECL_Msk
#define RTC_ALMA_SECH_Pos (4U)
#define RTC_ALMA_SECH_Msk (0x7UL << RTC_ALMA_SECH_Pos)
#define RTC_ALMA_SECH RTC_ALMA_SECH_Msk
#define RTC_ALMA_MSKS_Pos (7U)
#define RTC_ALMA_MSKS_Msk (0x1UL << RTC_ALMA_MSKS_Pos)
#define RTC_ALMA_MSKS RTC_ALMA_MSKS_Msk
#define RTC_ALMA_MINL_Pos (8U)
#define RTC_ALMA_MINL_Msk (0xFUL << RTC_ALMA_MINL_Pos)
#define RTC_ALMA_MINL RTC_ALMA_MINL_Msk
#define RTC_ALMA_MINH_Pos (12U)
#define RTC_ALMA_MINH_Msk (0x7UL << RTC_ALMA_MINH_Pos)
#define RTC_ALMA_MINH RTC_ALMA_MINH_Msk
#define RTC_ALMA_MSKM_Pos (15U)
#define RTC_ALMA_MSKM_Msk (0x1UL << RTC_ALMA_MSKM_Pos)
#define RTC_ALMA_MSKM RTC_ALMA_MSKM_Msk
#define RTC_ALMA_HOURL_Pos (16U)
#define RTC_ALMA_HOURL_Msk (0xFUL << RTC_ALMA_HOURL_Pos)
#define RTC_ALMA_HOURL RTC_ALMA_HOURL_Msk
#define RTC_ALMA_HOURH_Pos (20U)
#define RTC_ALMA_HOURH_Msk (0x3UL << RTC_ALMA_HOURH_Pos)
#define RTC_ALMA_HOURH RTC_ALMA_HOURH_Msk
#define RTC_ALMA_MSKH_Pos (23U)
#define RTC_ALMA_MSKH_Msk (0x1UL << RTC_ALMA_MSKH_Pos)
#define RTC_ALMA_MSKH RTC_ALMA_MSKH_Msk
#define RTC_ALMA_WEEK_Pos (24U)
#define RTC_ALMA_WEEK_Msk (0x7FUL << RTC_ALMA_WEEK_Pos)
#define RTC_ALMA_WEEK RTC_ALMA_WEEK_Msk

// RTC_ALMB
#define RTC_ALMB_SECL_Pos (0U)
#define RTC_ALMB_SECL_Msk (0xFUL << RTC_ALMB_SECL_Pos)
#define RTC_ALMB_SECL RTC_ALMB_SECL_Msk
#define RTC_ALMB_SECH_Pos (4U)
#define RTC_ALMB_SECH_Msk (0x7UL << RTC_ALMB_SECH_Pos)
#define RTC_ALMB_SECH RTC_ALMB_SECH_Msk
#define RTC_ALMB_MSKS_Pos (7U)
#define RTC_ALMB_MSKS_Msk (0x1UL << RTC_ALMB_MSKS_Pos)
#define RTC_ALMB_MSKS RTC_ALMB_MSKS_Msk
#define RTC_ALMB_MINL_Pos (8U)
#define RTC_ALMB_MINL_Msk (0xFUL << RTC_ALMB_MINL_Pos)
#define RTC_ALMB_MINL RTC_ALMB_MINL_Msk
#define RTC_ALMB_MINH_Pos (12U)
#define RTC_ALMB_MINH_Msk (0x7UL << RTC_ALMB_MINH_Pos)
#define RTC_ALMB_MINH RTC_ALMB_MINH_Msk
#define RTC_ALMB_MSKM_Pos (15U)
#define RTC_ALMB_MSKM_Msk (0x1UL << RTC_ALMB_MSKM_Pos)
#define RTC_ALMB_MSKM RTC_ALMB_MSKM_Msk
#define RTC_ALMB_HOURL_Pos (16U)
#define RTC_ALMB_HOURL_Msk (0xFUL << RTC_ALMB_HOURL_Pos)
#define RTC_ALMB_HOURL RTC_ALMB_HOURL_Msk
#define RTC_ALMB_HOURH_Pos (20U)
#define RTC_ALMB_HOURH_Msk (0x3UL << RTC_ALMB_HOURH_Pos)
#define RTC_ALMB_HOURH RTC_ALMB_HOURH_Msk
#define RTC_ALMB_MSKH_Pos (23U)
#define RTC_ALMB_MSKH_Msk (0x1UL << RTC_ALMB_MSKH_Pos)
#define RTC_ALMB_MSKH RTC_ALMB_MSKH_Msk
#define RTC_ALMB_WEEK_Pos (24U)
#define RTC_ALMB_WEEK_Msk (0x7FUL << RTC_ALMB_WEEK_Pos)
#define RTC_ALMB_WEEK RTC_ALMB_WEEK_Msk

// RTC_TSTR
#define RTC_TSTR_SECL_Pos (0U)
#define RTC_TSTR_SECL_Msk (0xFUL << RTC_TSTR_SECL_Pos)
#define RTC_TSTR_SECL RTC_TSTR_SECL_Msk
#define RTC_TSTR_SECH_Pos (4U)
#define RTC_TSTR_SECH_Msk (0x7UL << RTC_TSTR_SECH_Pos)
#define RTC_TSTR_SECH RTC_TSTR_SECH_Msk
#define RTC_TSTR_MINL_Pos (8U)
#define RTC_TSTR_MINL_Msk (0xFUL << RTC_TSTR_MINL_Pos)
#define RTC_TSTR_MINL RTC_TSTR_MINL_Msk
#define RTC_TSTR_MINH_Pos (12U)
#define RTC_TSTR_MINH_Msk (0x7UL << RTC_TSTR_MINH_Pos)
#define RTC_TSTR_MINH RTC_TSTR_MINH_Msk
#define RTC_TSTR_HOURL_Pos (16U)
#define RTC_TSTR_HOURL_Msk (0xFUL << RTC_TSTR_HOURL_Pos)
#define RTC_TSTR_HOURL RTC_TSTR_HOURL_Msk
#define RTC_TSTR_HOURH_Pos (20U)
#define RTC_TSTR_HOURH_Msk (0x3UL << RTC_TSTR_HOURH_Pos)
#define RTC_TSTR_HOURH RTC_TSTR_HOURH_Msk

// RTC_TSDR
#define RTC_TSDR_DAYL_Pos (0U)
#define RTC_TSDR_DAYL_Msk (0xFUL << RTC_TSDR_DAYL_Pos)
#define RTC_TSDR_DAYL RTC_TSDR_DAYL_Msk
#define RTC_TSDR_DAYH_Pos (4U)
#define RTC_TSDR_DAYH_Msk (0x3UL << RTC_TSDR_DAYH_Pos)
#define RTC_TSDR_DAYH RTC_TSDR_DAYH_Msk
#define RTC_TSDR_MON_Pos (8U)
#define RTC_TSDR_MON_Msk (0x1FUL << RTC_TSDR_MON_Pos)
#define RTC_TSDR_MON RTC_TSDR_MON_Msk
#define RTC_TSDR_WEEK_Pos (13U)
#define RTC_TSDR_WEEK_Msk (0x7UL << RTC_TSDR_WEEK_Pos)
#define RTC_TSDR_WEEK RTC_TSDR_WEEK_Msk

// RTC_WUTARR
#define RTC_WUTARR_WUTARR_Pos (0U)
#define RTC_WUTARR_WUTARR_Msk (0xFFFFUL << RTC_WUTARR_WUTARR_Pos)
#define RTC_WUTARR_WUTARR RTC_WUTARR_WUTARR_Msk

// RTC_IER
#define RTC_IER_ALMA_Pos (0U)
#define RTC_IER_ALMA_Msk (0x1UL << RTC_IER_ALMA_Pos)
#define RTC_IER_ALMA RTC_IER_ALMA_Msk
#define RTC_IER_ALMB_Pos (1U)
#define RTC_IER_ALMB_Msk (0x1UL << RTC_IER_ALMB_Pos)
#define RTC_IER_ALMB RTC_IER_ALMB_Msk
#define RTC_IER_WU_Pos (2U)
#define RTC_IER_WU_Msk (0x1UL << RTC_IER_WU_Pos)
#define RTC_IER_WU RTC_IER_WU_Msk
#define RTC_IER_TS_Pos (3U)
#define RTC_IER_TS_Msk (0x1UL << RTC_IER_TS_Pos)
#define RTC_IER_TS RTC_IER_TS_Msk
#define RTC_IER_TSOV_Pos (4U)
#define RTC_IER_TSOV_Msk (0x1UL << RTC_IER_TSOV_Pos)
#define RTC_IER_TSOV RTC_IER_TSOV_Msk
#define RTC_IER_PRD_Pos (6U)
#define RTC_IER_PRD_Msk (0x1UL << RTC_IER_PRD_Pos)
#define RTC_IER_PRD RTC_IER_PRD_Msk

// RTC_IFR
#define RTC_IFR_ALMA_Pos (0U)
#define RTC_IFR_ALMA_Msk (0x1UL << RTC_IFR_ALMA_Pos)
#define RTC_IFR_ALMA RTC_IFR_ALMA_Msk
#define RTC_IFR_ALMB_Pos (1U)
#define RTC_IFR_ALMB_Msk (0x1UL << RTC_IFR_ALMB_Pos)
#define RTC_IFR_ALMB RTC_IFR_ALMB_Msk
#define RTC_IFR_WU_Pos (2U)
#define RTC_IFR_WU_Msk (0x1UL << RTC_IFR_WU_Pos)
#define RTC_IFR_WU RTC_IFR_WU_Msk
#define RTC_IFR_TS_Pos (3U)
#define RTC_IFR_TS_Msk (0x1UL << RTC_IFR_TS_Pos)
#define RTC_IFR_TS RTC_IFR_TS_Msk
#define RTC_IFR_TSOV_Pos (4U)
#define RTC_IFR_TSOV_Msk (0x1UL << RTC_IFR_TSOV_Pos)
#define RTC_IFR_TSOV RTC_IFR_TSOV_Msk
#define RTC_IFR_PRD_Pos (6U)
#define RTC_IFR_PRD_Msk (0x1UL << RTC_IFR_PRD_Pos)
#define RTC_IFR_PRD RTC_IFR_PRD_Msk

