sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// RTC_ICR
#define RTC_ICR_ALMA_Pos (0U)
#define RTC_ICR_ALMA_Msk (0x1UL << RTC_ICR_ALMA_Pos)
#define RTC_ICR_ALMA RTC_ICR_ALMA_Msk
#define RTC_ICR_ALMB_Pos (1U)
#define RTC_ICR_ALMB_Msk (0x1UL << RTC_ICR_ALMB_Pos)
#define RTC_ICR_ALMB RTC_ICR_ALMB_Msk
#define RTC_ICR_WU_Pos (2U)
#define RTC_ICR_WU_Msk (0x1UL << RTC_ICR_WU_Pos)
#define RTC_ICR_WU RTC_ICR_WU_Msk
#define RTC_ICR_TS_Pos (3U)
#define RTC_ICR_TS_Msk (0x1UL << RTC_ICR_TS_Pos)
#define RTC_ICR_TS RTC_ICR_TS_Msk
#define RTC_ICR_TSOV_Pos (4U)
#define RTC_ICR_TSOV_Msk (0x1UL << RTC_ICR_TSOV_Pos)
#define RTC_ICR_TSOV RTC_ICR_TSOV_Msk
#define RTC_ICR_PRD_Pos (6U)
#define RTC_ICR_PRD_Msk (0x1UL << RTC_ICR_PRD_Pos)
#define RTC_ICR_PRD RTC_ICR_PRD_Msk

// RTC_WPR
#define RTC_WPR_WPR_Pos (0U)
#define RTC_WPR_WPR_Msk (0xFFUL << RTC_WPR_WPR_Pos)
#define RTC_WPR_WPR RTC_WPR_WPR_Msk

//********************    Bits Define For Peripheral SPI    ********************//
// SPI_CR0
#define SPI_CR0_EN_Pos (0U)
#define SPI_CR0_EN_Msk (0x1UL << SPI_CR0_EN_Pos)
#define SPI_CR0_EN SPI_CR0_EN_Msk
#define SPI_CR0_BRR_Pos (1U)
#define SPI_CR0_BRR_Msk (0x7UL << SPI_CR0_BRR_Pos)
#define SPI_CR0_BRR SPI_CR0_BRR_Msk
#define SPI_CR0_CPHA_Pos (4U)
#define SPI_CR0_CPHA_Msk (0x1UL << SPI_CR0_CPHA_Pos)
#define SPI_CR0_CPHA SPI_CR0_CPHA_Msk
#define SPI_CR0_CPOL_Pos (5U)
#define SPI_CR0_CPOL_Msk (0x1UL << SPI_CR0_CPOL_Pos)
#define SPI_CR0_CPOL SPI_CR0_CPOL_Msk
#define SPI_CR0_MSTR_Pos (6U)
#define SPI_CR0_MSTR_Msk (0x1UL << SPI_CR0_MSTR_Pos)
#define SPI_CR0_MSTR SPI_CR0_MSTR_Msk
#define SPI_CR0_LSBF_Pos (7U)
#define SPI_CR0_LSBF_Msk (0x1UL << SPI_CR0_LSBF_Pos)
#define SPI_CR0_LSBF SPI_CR0_LSBF_Msk
#define SPI_CR0_WIDTH_Pos (8U)
#define SPI_CR0_WIDTH_Msk (0xFUL << SPI_CR0_WIDTH_Pos)
#define SPI_CR0_WIDTH SPI_CR0_WIDTH_Msk
#define SPI_CR0_SSM_Pos (12U)
#define SPI_CR0_SSM_Msk (0x1UL << SPI_CR0_SSM_Pos)
#define SPI_CR0_SSM SPI_CR0_SSM_Msk
#define SPI_CR0_CM_Pos (13U)
#define SPI_CR0_CM_Msk (0x3UL << SPI_CR0_CM_Pos)
#define SPI_CR0_CM SPI_CR0_CM_Msk
#define SPI_CR0_SMP_Pos (15U)
#define SPI_CR0_SMP_Msk (0x1UL << SPI_CR0_SMP_Pos)
#define SPI_CR0_SMP SPI_CR0_SMP_Msk

// SPI_CR1
#define SPI_CR1_TXEIE_Pos (0U)
#define SPI_CR1_TXEIE_Msk (0x1UL << SPI_CR1_TXEIE_Pos)
#define SPI_CR1_TXEIE SPI_CR1_TXEIE_Msk
#define SPI_CR1_RXNEIE_Pos (1U)
#define SPI_CR1_RXNEIE_Msk (0x1UL << SPI_CR1_RXNEIE_Pos)
#define SPI_CR1_RXNEIE SPI_CR1_RXNEIE_Msk
#define SPI_CR1_SSFIE_Pos (2U)
#define SPI_CR1_SSFIE_Msk (0x1UL << SPI_CR1_SSFIE_Pos)
#define SPI_CR1_SSFIE SPI_CR1_SSFIE_Msk
#define SPI_CR1_SSRIE_Pos (3U)
#define SPI_CR1_SSRIE_Msk (0x1UL << SPI_CR1_SSRIE_Pos)
#define SPI_CR1_SSRIE SPI_CR1_SSRIE_Msk
#define SPI_CR1_UDFIE_Pos (4U)
#define SPI_CR1_UDFIE_Msk (0x1UL << SPI_CR1_UDFIE_Pos)
#define SPI_CR1_UDFIE SPI_CR1_UDFIE_Msk
#define SPI_CR1_OVFIE_Pos (5U)
#define SPI_CR1_OVFIE_Msk (0x1UL << SPI_CR1_OVFIE_Pos)
#define SPI_CR1_OVFIE SPI_CR1_OVFIE_Msk
#define SPI_CR1_SSERRIE_Pos (6U)
#define SPI_CR1_SSERRIE_Msk (0x1UL << SPI_CR1_SSERRIE_Pos)
#define SPI_CR1_SSERRIE SPI_CR1_SSERRIE_Msk
#define SPI_CR1_MODFIE_Pos (7U)
#define SPI_CR1_MODFIE_Msk (0x1UL << SPI_CR1_MODFIE_Pos)
#define SPI_CR1_MODFIE SPI_CR1_MODFIE_Msk
#define SPI_CR1_DMARXEN_Pos (8U)
#define SPI_CR1_DMARXEN_Msk (0x1UL << SPI_CR1_DMARXEN_Pos)
#define SPI_CR1_DMARXEN SPI_CR1_DMARXEN_Msk
#define SPI_CR1_DMATXEN_Pos (9U)
#define SPI_CR1_DMATXEN_Msk (0x1UL << SPI_CR1_DMATXEN_Pos)
#define SPI_CR1_DMATXEN SPI_CR1_DMATXEN_Msk

// SPI_HDOE
#define SPI_HDOE_HDOE_Pos (0U)
#define SPI_HDOE_HDOE_Msk (0x1UL << SPI_HDOE_HDOE_Pos)
#define SPI_HDOE_HDOE SPI_HDOE_HDOE_Msk

// SPI_SSI
#define SPI_SSI_SSI_Pos (0U)
#define SPI_SSI_SSI_Msk (0x1UL << SPI_SSI_SSI_Pos)
#define SPI_SSI_SSI SPI_SSI_SSI_Msk

// SPI_SR
#define SPI_SR_TXE_Pos (0U)
#define SPI_SR_TXE_Msk (0x1UL << SPI_SR_TXE_Pos)
#define SPI_SR_TXE SPI_SR_TXE_Msk
#define SPI_SR_RXNE_Pos (1U)
#define SPI_SR_RXNE_Msk (0x1UL << SPI_SR_RXNE_Pos)
#define SPI_SR_RXNE SPI_SR_RXNE_Msk
#define SPI_SR_SSF_Pos (2U)
#define SPI_SR_SSF_Msk (0x1UL << SPI_SR_SSF_Pos)
#define SPI_SR_SSF SPI_SR_SSF_Msk
#define SPI_SR_SSR_Pos (3U)
#define SPI_SR_SSR_Msk (0x1UL << SPI_SR_SSR_Pos)
#define SPI_SR_SSR SPI_SR_SSR_Msk
#define SPI_SR_UDF_Pos (4U)
#define SPI_SR_UDF_Msk (0x1UL << SPI_SR_UDF_Pos)
#define SPI_SR_UDF SPI_SR_UDF_Msk
#define SPI_SR_OVF_Pos (5U)
#define SPI_SR_OVF_Msk (0x1UL << SPI_SR_OVF_Pos)
#define SPI_SR_OVF SPI_SR_OVF_Msk
#define SPI_SR_SSERR_Pos (6U)
#define SPI_SR_SSERR_Msk (0x1UL << SPI_SR_SSERR_Pos)
#define SPI_SR_SSERR SPI_SR_SSERR_Msk
#define SPI_SR_MODF_Pos (7U)
#define SPI_SR_MODF_Msk (0x1UL << SPI_SR_MODF_Pos)
#define SPI_SR_MODF SPI_SR_MODF_Msk
#define SPI_SR_BUSY_Pos (8U)
#define SPI_SR_BUSY_Msk (0x1UL << SPI_SR_BUSY_Pos)
#define SPI_SR_BUSY SPI_SR_BUSY_Msk
#define SPI_SR_SSLVL_Pos (9U)
#define SPI_SR_SSLVL_Msk (0x1UL << SPI_SR_SSLVL_Pos)
#define SPI_SR_SSLVL SPI_SR_SSLVL_Msk

// SPI_ICR
#define SPI_ICR_TXE_Pos (0U)
#define SPI_ICR_TXE_Msk (0x1UL << SPI_ICR_TXE_Pos)
#define SPI_ICR_TXE SPI_ICR_TXE_Msk
#define SPI_ICR_RXNE_Pos (1U)
#define SPI_ICR_RXNE_Msk (0x1UL << SPI_ICR_RXNE_Pos)
#define SPI_ICR_RXNE SPI_ICR_RXNE_Msk
#define SPI_ICR_SSF_Pos (2U)
#define SPI_ICR_SSF_Msk (0x1UL << SPI_ICR_SSF_Pos)
#define SPI_ICR_SSF SPI_ICR_SSF_Msk
#define SPI_ICR_SSR_Pos (3U)
#define SPI_ICR_SSR_Msk (0x1UL << SPI_ICR_SSR_Pos)
#define SPI_ICR_SSR SPI_ICR_SSR_Msk
#define SPI_ICR_UDF_Pos (4U)
#define SPI_ICR_UDF_Msk (0x1UL << SPI_ICR_UDF_Pos)
#define SPI_ICR_UDF SPI_ICR_UDF_Msk
#define SPI_ICR_OVF_Pos (5U)
#define SPI_ICR_OVF_Msk (0x1UL << SPI_ICR_OVF_Pos)
#define SPI_ICR_OVF SPI_ICR_OVF_Msk
#define SPI_ICR_SSERR_Pos (6U)
#define SPI_ICR_SSERR_Msk (0x1UL << SPI_ICR_SSERR_Pos)
#define SPI_ICR_SSERR SPI_ICR_SSERR_Msk
#define SPI_ICR_MODF_Pos (7U)
#define SPI_ICR_MODF_Msk (0x1UL << SPI_ICR_MODF_Pos)
#define SPI_ICR_MODF SPI_ICR_MODF_Msk

// SPI_DR
#define SPI_DR_DR_Pos (0U)
#define SPI_DR_DR_Msk (0xFFFFUL << SPI_DR_DR_Pos)
#define SPI_DR_DR SPI_DR_DR_Msk

