sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
//********************    Bits Define For Peripheral SYSCTRL    ********************//
// SYSCTRL_CR0
#define SYSCTRL_CR0_CLKSRC_Pos (0U)
#define SYSCTRL_CR0_CLKSRC_Msk (0x7UL << SYSCTRL_CR0_CLKSRC_Pos)
#define SYSCTRL_CR0_CLKSRC SYSCTRL_CR0_CLKSRC_Msk
#define SYSCTRL_CR0_HCLKPRS_Pos (3U)
#define SYSCTRL_CR0_HCLKPRS_Msk (0x7UL << SYSCTRL_CR0_HCLKPRS_Pos)
#define SYSCTRL_CR0_HCLKPRS SYSCTRL_CR0_HCLKPRS_Msk
#define SYSCTRL_CR0_PCLKPRS_Pos (6U)
#define SYSCTRL_CR0_PCLKPRS_Msk (0x3UL << SYSCTRL_CR0_PCLKPRS_Pos)
#define SYSCTRL_CR0_PCLKPRS SYSCTRL_CR0_PCLKPRS_Msk

// SYSCTRL_CR1
#define SYSCTRL_CR1_SWDUSEIO_Pos (0U)
#define SYSCTRL_CR1_SWDUSEIO_Msk (0x1UL << SYSCTRL_CR1_SWDUSEIO_Pos)
#define SYSCTRL_CR1_SWDUSEIO SYSCTRL_CR1_SWDUSEIO_Msk
#define SYSCTRL_CR1_LOCKUP_EN_Pos (1U)
#define SYSCTRL_CR1_LOCKUP_EN_Msk (0x1UL << SYSCTRL_CR1_LOCKUP_EN_Pos)
#define SYSCTRL_CR1_LOCKUP_EN SYSCTRL_CR1_LOCKUP_EN_Msk
#define SYSCTRL_CR1_WAKEUPBYRCH_Pos (2U)
#define SYSCTRL_CR1_WAKEUPBYRCH_Msk (0x1UL << SYSCTRL_CR1_WAKEUPBYRCH_Pos)
#define SYSCTRL_CR1_WAKEUPBYRCH SYSCTRL_CR1_WAKEUPBYRCH_Msk
#define SYSCTRL_CR1_RTCLPW_Pos (3U)
#define SYSCTRL_CR1_RTCLPW_Msk (0x1UL << SYSCTRL_CR1_RTCLPW_Pos)
#define SYSCTRL_CR1_RTCLPW SYSCTRL_CR1_RTCLPW_Msk
#define SYSCTRL_CR1_RTCADJ_Pos (4U)
#define SYSCTRL_CR1_RTCADJ_Msk (0x7UL << SYSCTRL_CR1_RTCADJ_Pos)
#define SYSCTRL_CR1_RTCADJ SYSCTRL_CR1_RTCADJ_Msk
#define SYSCTRL_CR1_AUTOSWITCH_Pos (7U)
#define SYSCTRL_CR1_AUTOSWITCH_Msk (0x1UL << SYSCTRL_CR1_AUTOSWITCH_Pos)
#define SYSCTRL_CR1_AUTOSWITCH SYSCTRL_CR1_AUTOSWITCH_Msk
#define SYSCTRL_CR1_SPIPCTRL_Pos (8U)
#define SYSCTRL_CR1_SPIPCTRL_Msk (0x1UL << SYSCTRL_CR1_SPIPCTRL_Pos)
#define SYSCTRL_CR1_SPIPCTRL SYSCTRL_CR1_SPIPCTRL_Msk
#define SYSCTRL_CR1_XTHFLT_Pos (9U)
#define SYSCTRL_CR1_XTHFLT_Msk (0x1UL << SYSCTRL_CR1_XTHFLT_Pos)
#define SYSCTRL_CR1_XTHFLT SYSCTRL_CR1_XTHFLT_Msk
#define SYSCTRL_CR1_GTIM0CFG_Pos (10U)
#define SYSCTRL_CR1_GTIM0CFG_Msk (0x1UL << SYSCTRL_CR1_GTIM0CFG_Pos)
#define SYSCTRL_CR1_GTIM0CFG SYSCTRL_CR1_GTIM0CFG_Msk
#define SYSCTRL_CR1_GTIM1CFG_Pos (11U)
#define SYSCTRL_CR1_GTIM1CFG_Msk (0x1UL << SYSCTRL_CR1_GTIM1CFG_Pos)
#define SYSCTRL_CR1_GTIM1CFG SYSCTRL_CR1_GTIM1CFG_Msk
#define SYSCTRL_CR1_FASTIOENB_Pos (12U)
#define SYSCTRL_CR1_FASTIOENB_Msk (0x1UL << SYSCTRL_CR1_FASTIOENB_Pos)
#define SYSCTRL_CR1_FASTIOENB SYSCTRL_CR1_FASTIOENB_Msk

// SYSCTRL_CR2
#define SYSCTRL_CR2_RCH_Pos (0U)
#define SYSCTRL_CR2_RCH_Msk (0x1UL << SYSCTRL_CR2_RCH_Pos)
#define SYSCTRL_CR2_RCH SYSCTRL_CR2_RCH_Msk
#define SYSCTRL_CR2_XTH_Pos (1U)
#define SYSCTRL_CR2_XTH_Msk (0x1UL << SYSCTRL_CR2_XTH_Pos)
#define SYSCTRL_CR2_XTH SYSCTRL_CR2_XTH_Msk
#define SYSCTRL_CR2_RCL_Pos (2U)
#define SYSCTRL_CR2_RCL_Msk (0x1UL << SYSCTRL_CR2_RCL_Pos)
#define SYSCTRL_CR2_RCL SYSCTRL_CR2_RCL_Msk
#define SYSCTRL_CR2_XTL_Pos (3U)
#define SYSCTRL_CR2_XTL_Msk (0x1UL << SYSCTRL_CR2_XTL_Pos)
#define SYSCTRL_CR2_XTL SYSCTRL_CR2_XTL_Msk
#define SYSCTRL_CR2_PLL_Pos (4U)
#define SYSCTRL_CR2_PLL_Msk (0x1UL << SYSCTRL_CR2_PLL_Pos)
#define SYSCTRL_CR2_PLL SYSCTRL_CR2_PLL_Msk
#define SYSCTRL_CR2_EXXTH_Pos (5U)
#define SYSCTRL_CR2_EXXTH_Msk (0x1UL << SYSCTRL_CR2_EXXTH_Pos)
#define SYSCTRL_CR2_EXXTH SYSCTRL_CR2_EXXTH_Msk
#define SYSCTRL_CR2_EXXTL_Pos (6U)
#define SYSCTRL_CR2_EXXTL_Msk (0x1UL << SYSCTRL_CR2_EXXTL_Pos)
#define SYSCTRL_CR2_EXXTL SYSCTRL_CR2_EXXTL_Msk
#define SYSCTRL_CR2_XTLLOCK_Pos (7U)
#define SYSCTRL_CR2_XTLLOCK_Msk (0x1UL << SYSCTRL_CR2_XTLLOCK_Pos)
#define SYSCTRL_CR2_XTLLOCK SYSCTRL_CR2_XTLLOCK_Msk

// SYSCTRL_CR3
#define SYSCTRL_CR3_CR3_Pos (0U)
#define SYSCTRL_CR3_CR3_Msk (0xFFFFUL << SYSCTRL_CR3_CR3_Pos)
#define SYSCTRL_CR3_CR3 SYSCTRL_CR3_CR3_Msk

// SYSCTRL_RCHCR
#define SYSCTRL_RCHCR_DIV_Pos (0U)
#define SYSCTRL_RCHCR_DIV_Msk (0x7UL << SYSCTRL_RCHCR_DIV_Pos)
#define SYSCTRL_RCHCR_DIV SYSCTRL_RCHCR_DIV_Msk

// SYSCTRL_XTHCR
#define SYSCTRL_XTHCR_DRIVER_Pos (0U)
#define SYSCTRL_XTHCR_DRIVER_Msk (0x3UL << SYSCTRL_XTHCR_DRIVER_Pos)
#define SYSCTRL_XTHCR_DRIVER SYSCTRL_XTHCR_DRIVER_Msk
#define SYSCTRL_XTHCR_RANGE_Pos (2U)
#define SYSCTRL_XTHCR_RANGE_Msk (0x3UL << SYSCTRL_XTHCR_RANGE_Pos)
#define SYSCTRL_XTHCR_RANGE SYSCTRL_XTHCR_RANGE_Msk
#define SYSCTRL_XTHCR_STARTUP_Pos (4U)
#define SYSCTRL_XTHCR_STARTUP_Msk (0x3UL << SYSCTRL_XTHCR_STARTUP_Pos)
#define SYSCTRL_XTHCR_STARTUP SYSCTRL_XTHCR_STARTUP_Msk
#define SYSCTRL_XTHCR_DETEN_Pos (6U)
#define SYSCTRL_XTHCR_DETEN_Msk (0x1UL << SYSCTRL_XTHCR_DETEN_Pos)
#define SYSCTRL_XTHCR_DETEN SYSCTRL_XTHCR_DETEN_Msk
#define SYSCTRL_XTHCR_DETTIME_Pos (7U)
#define SYSCTRL_XTHCR_DETTIME_Msk (0x1UL << SYSCTRL_XTHCR_DETTIME_Pos)
#define SYSCTRL_XTHCR_DETTIME SYSCTRL_XTHCR_DETTIME_Msk
#define SYSCTRL_XTHCR_DETIE_Pos (8U)
#define SYSCTRL_XTHCR_DETIE_Msk (0x1UL << SYSCTRL_XTHCR_DETIE_Pos)
#define SYSCTRL_XTHCR_DETIE SYSCTRL_XTHCR_DETIE_Msk

// SYSCTRL_RCLCR
#define SYSCTRL_RCLCR_STARTUP_Pos (10U)
#define SYSCTRL_RCLCR_STARTUP_Msk (0x3UL << SYSCTRL_RCLCR_STARTUP_Pos)
#define SYSCTRL_RCLCR_STARTUP SYSCTRL_RCLCR_STARTUP_Msk

// SYSCTRL_XTLCR
#define SYSCTRL_XTLCR_DRIVER_Pos (0U)
#define SYSCTRL_XTLCR_DRIVER_Msk (0x3UL << SYSCTRL_XTLCR_DRIVER_Pos)
#define SYSCTRL_XTLCR_DRIVER SYSCTRL_XTLCR_DRIVER_Msk
#define SYSCTRL_XTLCR_AMP_SEL_Pos (2U)
#define SYSCTRL_XTLCR_AMP_SEL_Msk (0x3UL << SYSCTRL_XTLCR_AMP_SEL_Pos)
#define SYSCTRL_XTLCR_AMP_SEL SYSCTRL_XTLCR_AMP_SEL_Msk
#define SYSCTRL_XTLCR_STARTUP_Pos (4U)
#define SYSCTRL_XTLCR_STARTUP_Msk (0x3UL << SYSCTRL_XTLCR_STARTUP_Pos)
#define SYSCTRL_XTLCR_STARTUP SYSCTRL_XTLCR_STARTUP_Msk
#define SYSCTRL_XTLCR_DETEN_Pos (6U)
#define SYSCTRL_XTLCR_DETEN_Msk (0x1UL << SYSCTRL_XTLCR_DETEN_Pos)
#define SYSCTRL_XTLCR_DETEN SYSCTRL_XTLCR_DETEN_Msk
#define SYSCTRL_XTLCR_DETTIME_Pos (7U)
#define SYSCTRL_XTLCR_DETTIME_Msk (0x1UL << SYSCTRL_XTLCR_DETTIME_Pos)
#define SYSCTRL_XTLCR_DETTIME SYSCTRL_XTLCR_DETTIME_Msk
#define SYSCTRL_XTLCR_DETIE_Pos (8U)
#define SYSCTRL_XTLCR_DETIE_Msk (0x1UL << SYSCTRL_XTLCR_DETIE_Pos)
#define SYSCTRL_XTLCR_DETIE SYSCTRL_XTLCR_DETIE_Msk

// SYSCTRL_PLLCR
#define SYSCTRL_PLLCR_SRC_Pos (0U)
#define SYSCTRL_PLLCR_SRC_Msk (0x3UL << SYSCTRL_PLLCR_SRC_Pos)
#define SYSCTRL_PLLCR_SRC SYSCTRL_PLLCR_SRC_Msk
#define SYSCTRL_PLLCR_DIVR_Pos (2U)
#define SYSCTRL_PLLCR_DIVR_Msk (0x1UL << SYSCTRL_PLLCR_DIVR_Pos)
#define SYSCTRL_PLLCR_DIVR SYSCTRL_PLLCR_DIVR_Msk
#define SYSCTRL_PLLCR_WAITCYCLE_Pos (4U)
#define SYSCTRL_PLLCR_WAITCYCLE_Msk (0x7UL << SYSCTRL_PLLCR_WAITCYCLE_Pos)
#define SYSCTRL_PLLCR_WAITCYCLE SYSCTRL_PLLCR_WAITCYCLE_Msk
#define SYSCTRL_PLLCR_DIVN_Pos (8U)
#define SYSCTRL_PLLCR_DIVN_Msk (0x7FUL << SYSCTRL_PLLCR_DIVN_Pos)
#define SYSCTRL_PLLCR_DIVN SYSCTRL_PLLCR_DIVN_Msk
#define SYSCTRL_PLLCR_DIVF_Pos (16U)
#define SYSCTRL_PLLCR_DIVF_Msk (0x7UL << SYSCTRL_PLLCR_DIVF_Pos)
#define SYSCTRL_PLLCR_DIVF SYSCTRL_PLLCR_DIVF_Msk
#define SYSCTRL_PLLCR_POSTDIV_Pos (20U)
#define SYSCTRL_PLLCR_POSTDIV_Msk (0xFUL << SYSCTRL_PLLCR_POSTDIV_Pos)
#define SYSCTRL_PLLCR_POSTDIV SYSCTRL_PLLCR_POSTDIV_Msk

// SYSCTRL_RCHTRIM
#define SYSCTRL_RCHTRIM_TRIML_Pos (0U)
#define SYSCTRL_RCHTRIM_TRIML_Msk (0x3FUL << SYSCTRL_RCHTRIM_TRIML_Pos)
#define SYSCTRL_RCHTRIM_TRIML SYSCTRL_RCHTRIM_TRIML_Msk
#define SYSCTRL_RCHTRIM_TRIMH_Pos (6U)
#define SYSCTRL_RCHTRIM_TRIMH_Msk (0x1FUL << SYSCTRL_RCHTRIM_TRIMH_Pos)
#define SYSCTRL_RCHTRIM_TRIMH SYSCTRL_RCHTRIM_TRIMH_Msk

// SYSCTRL_RCLTRIM
#define SYSCTRL_RCLTRIM_TRIM_Pos (0U)
#define SYSCTRL_RCLTRIM_TRIM_Msk (0x3FFUL << SYSCTRL_RCLTRIM_TRIM_Pos)
#define SYSCTRL_RCLTRIM_TRIM SYSCTRL_RCLTRIM_TRIM_Msk

// SYSCTRL_STATE
#define SYSCTRL_STATE_RCH_Pos (0U)
#define SYSCTRL_STATE_RCH_Msk (0x1UL << SYSCTRL_STATE_RCH_Pos)
#define SYSCTRL_STATE_RCH SYSCTRL_STATE_RCH_Msk
#define SYSCTRL_STATE_XTH_Pos (1U)
#define SYSCTRL_STATE_XTH_Msk (0x1UL << SYSCTRL_STATE_XTH_Pos)
#define SYSCTRL_STATE_XTH SYSCTRL_STATE_XTH_Msk
#define SYSCTRL_STATE_RCL_Pos (2U)
#define SYSCTRL_STATE_RCL_Msk (0x1UL << SYSCTRL_STATE_RCL_Pos)
#define SYSCTRL_STATE_RCL SYSCTRL_STATE_RCL_Msk
#define SYSCTRL_STATE_XTL_Pos (3U)
#define SYSCTRL_STATE_XTL_Msk (0x1UL << SYSCTRL_STATE_XTL_Pos)
#define SYSCTRL_STATE_XTL SYSCTRL_STATE_XTL_Msk
#define SYSCTRL_STATE_PLL_Pos (4U)
#define SYSCTRL_STATE_PLL_Msk (0x1UL << SYSCTRL_STATE_PLL_Pos)
#define SYSCTRL_STATE_PLL SYSCTRL_STATE_PLL_Msk
#define SYSCTRL_STATE_PLLLOCK_Pos (5U)
#define SYSCTRL_STATE_PLLLOCK_Msk (0x1UL << SYSCTRL_STATE_PLLLOCK_Pos)
#define SYSCTRL_STATE_PLLLOCK SYSCTRL_STATE_PLLLOCK_Msk
#define SYSCTRL_STATE_XTHFAIL_Pos (8U)
#define SYSCTRL_STATE_XTHFAIL_Msk (0x1UL << SYSCTRL_STATE_XTHFAIL_Pos)
#define SYSCTRL_STATE_XTHFAIL SYSCTRL_STATE_XTHFAIL_Msk
#define SYSCTRL_STATE_XTHFAULT_Pos (9U)
#define SYSCTRL_STATE_XTHFAULT_Msk (0x1UL << SYSCTRL_STATE_XTHFAULT_Pos)
#define SYSCTRL_STATE_XTHFAULT SYSCTRL_STATE_XTHFAULT_Msk
#define SYSCTRL_STATE_XTLFAIL_Pos (10U)
#define SYSCTRL_STATE_XTLFAIL_Msk (0x1UL << SYSCTRL_STATE_XTLFAIL_Pos)
#define SYSCTRL_STATE_XTLFAIL SYSCTRL_STATE_XTLFAIL_Msk
#define SYSCTRL_STATE_XTLFAULT_Pos (11U)
#define SYSCTRL_STATE_XTLFAULT_Msk (0x1UL << SYSCTRL_STATE_XTLFAULT_Pos)
#define SYSCTRL_STATE_XTLFAULT SYSCTRL_STATE_XTLFAULT_Msk

// SYSCTRL_PERICLKEN0
#define SYSCTRL_PERICLKEN0_USART0_Pos (0U)
#define SYSCTRL_PERICLKEN0_USART0_Msk (0x1UL << SYSCTRL_PERICLKEN0_USART0_Pos)
#define SYSCTRL_PERICLKEN0_USART0 SYSCTRL_PERICLKEN0_USART0_Msk
#define SYSCTRL_PERICLKEN0_USART1_Pos (1U)
#define SYSCTRL_PERICLKEN0_USART1_Msk (0x1UL << SYSCTRL_PERICLKEN0_USART1_Pos)
#define SYSCTRL_PERICLKEN0_USART1 SYSCTRL_PERICLKEN0_USART1_Msk
#define SYSCTRL_PERICLKEN0_LPUART0_Pos (2U)
#define SYSCTRL_PERICLKEN0_LPUART0_Msk (0x1UL << SYSCTRL_PERICLKEN0_LPUART0_Pos)
#define SYSCTRL_PERICLKEN0_LPUART0 SYSCTRL_PERICLKEN0_LPUART0_Msk
#define SYSCTRL_PERICLKEN0_LPUART1_Pos (3U)
#define SYSCTRL_PERICLKEN0_LPUART1_Msk (0x1UL << SYSCTRL_PERICLKEN0_LPUART1_Pos)
#define SYSCTRL_PERICLKEN0_LPUART1 SYSCTRL_PERICLKEN0_LPUART1_Msk
#define SYSCTRL_PERICLKEN0_I2C0_Pos (4U)
#define SYSCTRL_PERICLKEN0_I2C0_Msk (0x1UL << SYSCTRL_PERICLKEN0_I2C0_Pos)
#define SYSCTRL_PERICLKEN0_I2C0 SYSCTRL_PERICLKEN0_I2C0_Msk
#define SYSCTRL_PERICLKEN0_I2C1_Pos (5U)
#define SYSCTRL_PERICLKEN0_I2C1_Msk (0x1UL << SYSCTRL_PERICLKEN0_I2C1_Pos)
#define SYSCTRL_PERICLKEN0_I2C1 SYSCTRL_PERICLKEN0_I2C1_Msk
#define SYSCTRL_PERICLKEN0_SPI0_Pos (6U)
#define SYSCTRL_PERICLKEN0_SPI0_Msk (0x1UL << SYSCTRL_PERICLKEN0_SPI0_Pos)
#define SYSCTRL_PERICLKEN0_SPI0 SYSCTRL_PERICLKEN0_SPI0_Msk
#define SYSCTRL_PERICLKEN0_SPI1_Pos (7U)
#define SYSCTRL_PERICLKEN0_SPI1_Msk (0x1UL << SYSCTRL_PERICLKEN0_SPI1_Pos)
#define SYSCTRL_PERICLKEN0_SPI1 SYSCTRL_PERICLKEN0_SPI1_Msk
#define SYSCTRL_PERICLKEN0_ATIM0_Pos (8U)
#define SYSCTRL_PERICLKEN0_ATIM0_Msk (0x1UL << SYSCTRL_PERICLKEN0_ATIM0_Pos)
#define SYSCTRL_PERICLKEN0_ATIM0 SYSCTRL_PERICLKEN0_ATIM0_Msk
#define SYSCTRL_PERICLKEN0_LPTIM_Pos (9U)
#define SYSCTRL_PERICLKEN0_LPTIM_Msk (0x1UL << SYSCTRL_PERICLKEN0_LPTIM_Pos)
#define SYSCTRL_PERICLKEN0_LPTIM SYSCTRL_PERICLKEN0_LPTIM_Msk
#define SYSCTRL_PERICLKEN0_ATIM1_Pos (10U)
#define SYSCTRL_PERICLKEN0_ATIM1_Msk (0x1UL << SYSCTRL_PERICLKEN0_ATIM1_Pos)
#define SYSCTRL_PERICLKEN0_ATIM1 SYSCTRL_PERICLKEN0_ATIM1_Msk
#define SYSCTRL_PERICLKEN0_ATIM3_Pos (11U)
#define SYSCTRL_PERICLKEN0_ATIM3_Msk (0x1UL << SYSCTRL_PERICLKEN0_ATIM3_Pos)
#define SYSCTRL_PERICLKEN0_ATIM3 SYSCTRL_PERICLKEN0_ATIM3_Msk
#define SYSCTRL_PERICLKEN0_ATIM2_Pos (12U)
#define SYSCTRL_PERICLKEN0_ATIM2_Msk (0x1UL << SYSCTRL_PERICLKEN0_ATIM2_Pos)
#define SYSCTRL_PERICLKEN0_ATIM2 SYSCTRL_PERICLKEN0_ATIM2_Msk
#define SYSCTRL_PERICLKEN0_OPA_Pos (13U)
#define SYSCTRL_PERICLKEN0_OPA_Msk (0x1UL << SYSCTRL_PERICLKEN0_OPA_Pos)
#define SYSCTRL_PERICLKEN0_OPA SYSCTRL_PERICLKEN0_OPA_Msk
#define SYSCTRL_PERICLKEN0_WWDT_Pos (14U)
#define SYSCTRL_PERICLKEN0_WWDT_Msk (0x1UL << SYSCTRL_PERICLKEN0_WWDT_Pos)
#define SYSCTRL_PERICLKEN0_WWDT SYSCTRL_PERICLKEN0_WWDT_Msk
#define SYSCTRL_PERICLKEN0_IWDT_Pos (15U)
#define SYSCTRL_PERICLKEN0_IWDT_Msk (0x1UL << SYSCTRL_PERICLKEN0_IWDT_Pos)
#define SYSCTRL_PERICLKEN0_IWDT SYSCTRL_PERICLKEN0_IWDT_Msk
#define SYSCTRL_PERICLKEN0_ADC_Pos (16U)
#define SYSCTRL_PERICLKEN0_ADC_Msk (0x1UL << SYSCTRL_PERICLKEN0_ADC_Pos)
#define SYSCTRL_PERICLKEN0_ADC SYSCTRL_PERICLKEN0_ADC_Msk
#define SYSCTRL_PERICLKEN0_VCLVD_Pos (17U)
#define SYSCTRL_PERICLKEN0_VCLVD_Msk (0x1UL << SYSCTRL_PERICLKEN0_VCLVD_Pos)
#define SYSCTRL_PERICLKEN0_VCLVD SYSCTRL_PERICLKEN0_VCLVD_Msk
#define SYSCTRL_PERICLKEN0_I2CSLV_Pos (18U)
#define SYSCTRL_PERICLKEN0_I2CSLV_Msk (0x1UL << SYSCTRL_PERICLKEN0_I2CSLV_Pos)
#define SYSCTRL_PERICLKEN0_I2CSLV SYSCTRL_PERICLKEN0_I2CSLV_Msk
#define SYSCTRL_PERICLKEN0_RTC_Pos (20U)
#define SYSCTRL_PERICLKEN0_RTC_Msk (0x1UL << SYSCTRL_PERICLKEN0_RTC_Pos)
#define SYSCTRL_PERICLKEN0_RTC SYSCTRL_PERICLKEN0_RTC_Msk
#define SYSCTRL_PERICLKEN0_CTRIM_Pos (21U)
#define SYSCTRL_PERICLKEN0_CTRIM_Msk (0x1UL << SYSCTRL_PERICLKEN0_CTRIM_Pos)
#define SYSCTRL_PERICLKEN0_CTRIM SYSCTRL_PERICLKEN0_CTRIM_Msk
#define SYSCTRL_PERICLKEN0_TICK_Pos (24U)
#define SYSCTRL_PERICLKEN0_TICK_Msk (0x1UL << SYSCTRL_PERICLKEN0_TICK_Pos)
#define SYSCTRL_PERICLKEN0_TICK SYSCTRL_PERICLKEN0_TICK_Msk
#define SYSCTRL_PERICLKEN0_SWD_Pos (25U)
#define SYSCTRL_PERICLKEN0_SWD_Msk (0x1UL << SYSCTRL_PERICLKEN0_SWD_Pos)
#define SYSCTRL_PERICLKEN0_SWD SYSCTRL_PERICLKEN0_SWD_Msk
#define SYSCTRL_PERICLKEN0_CRC_Pos (26U)
#define SYSCTRL_PERICLKEN0_CRC_Msk (0x1UL << SYSCTRL_PERICLKEN0_CRC_Pos)
#define SYSCTRL_PERICLKEN0_CRC SYSCTRL_PERICLKEN0_CRC_Msk
#define SYSCTRL_PERICLKEN0_DMA_Pos (29U)
#define SYSCTRL_PERICLKEN0_DMA_Msk (0x1UL << SYSCTRL_PERICLKEN0_DMA_Pos)
#define SYSCTRL_PERICLKEN0_DMA SYSCTRL_PERICLKEN0_DMA_Msk
#define SYSCTRL_PERICLKEN0_EAU_Pos (30U)
#define SYSCTRL_PERICLKEN0_EAU_Msk (0x1UL << SYSCTRL_PERICLKEN0_EAU_Pos)
#define SYSCTRL_PERICLKEN0_EAU SYSCTRL_PERICLKEN0_EAU_Msk
#define SYSCTRL_PERICLKEN0_FLASH_Pos (31U)
#define SYSCTRL_PERICLKEN0_FLASH_Msk (0x1UL << SYSCTRL_PERICLKEN0_FLASH_Pos)
#define SYSCTRL_PERICLKEN0_FLASH SYSCTRL_PERICLKEN0_FLASH_Msk

// SYSCTRL_PERICLKEN1
#define SYSCTRL_PERICLKEN1_GPIOA_Pos (0U)
#define SYSCTRL_PERICLKEN1_GPIOA_Msk (0x1UL << SYSCTRL_PERICLKEN1_GPIOA_Pos)
#define SYSCTRL_PERICLKEN1_GPIOA SYSCTRL_PERICLKEN1_GPIOA_Msk
#define SYSCTRL_PERICLKEN1_GPIOB_Pos (1U)
#define SYSCTRL_PERICLKEN1_GPIOB_Msk (0x1UL << SYSCTRL_PERICLKEN1_GPIOB_Pos)
#define SYSCTRL_PERICLKEN1_GPIOB SYSCTRL_PERICLKEN1_GPIOB_Msk
#define SYSCTRL_PERICLKEN1_GPIOC_Pos (2U)
#define SYSCTRL_PERICLKEN1_GPIOC_Msk (0x1UL << SYSCTRL_PERICLKEN1_GPIOC_Pos)
#define SYSCTRL_PERICLKEN1_GPIOC SYSCTRL_PERICLKEN1_GPIOC_Msk
#define SYSCTRL_PERICLKEN1_GPIOD_Pos (3U)
#define SYSCTRL_PERICLKEN1_GPIOD_Msk (0x1UL << SYSCTRL_PERICLKEN1_GPIOD_Pos)
#define SYSCTRL_PERICLKEN1_GPIOD SYSCTRL_PERICLKEN1_GPIOD_Msk
#define SYSCTRL_PERICLKEN1_CAN_Pos (7U)
#define SYSCTRL_PERICLKEN1_CAN_Msk (0x1UL << SYSCTRL_PERICLKEN1_CAN_Pos)
#define SYSCTRL_PERICLKEN1_CAN SYSCTRL_PERICLKEN1_CAN_Msk
#define SYSCTRL_PERICLKEN1_GTIM0_Pos (8U)
#define SYSCTRL_PERICLKEN1_GTIM0_Msk (0x1UL << SYSCTRL_PERICLKEN1_GTIM0_Pos)
#define SYSCTRL_PERICLKEN1_GTIM0 SYSCTRL_PERICLKEN1_GTIM0_Msk
#define SYSCTRL_PERICLKEN1_GTIM1_Pos (9U)
#define SYSCTRL_PERICLKEN1_GTIM1_Msk (0x1UL << SYSCTRL_PERICLKEN1_GTIM1_Pos)
#define SYSCTRL_PERICLKEN1_GTIM1 SYSCTRL_PERICLKEN1_GTIM1_Msk

// SYSCTRL_PERIRESET0
#define SYSCTRL_PERIRESET0_USART0_Pos (0U)
#define SYSCTRL_PERIRESET0_USART0_Msk (0x1UL << SYSCTRL_PERIRESET0_USART0_Pos)
#define SYSCTRL_PERIRESET0_USART0 SYSCTRL_PERIRESET0_USART0_Msk
#define SYSCTRL_PERIRESET0_USART1_Pos (1U)
#define SYSCTRL_PERIRESET0_USART1_Msk (0x1UL << SYSCTRL_PERIRESET0_USART1_Pos)
#define SYSCTRL_PERIRESET0_USART1 SYSCTRL_PERIRESET0_USART1_Msk
#define SYSCTRL_PERIRESET0_LPUART0_Pos (2U)
#define SYSCTRL_PERIRESET0_LPUART0_Msk (0x1UL << SYSCTRL_PERIRESET0_LPUART0_Pos)
#define SYSCTRL_PERIRESET0_LPUART0 SYSCTRL_PERIRESET0_LPUART0_Msk
#define SYSCTRL_PERIRESET0_LPUART1_Pos (3U)
#define SYSCTRL_PERIRESET0_LPUART1_Msk (0x1UL << SYSCTRL_PERIRESET0_LPUART1_Pos)
#define SYSCTRL_PERIRESET0_LPUART1 SYSCTRL_PERIRESET0_LPUART1_Msk
#define SYSCTRL_PERIRESET0_I2C0_Pos (4U)
#define SYSCTRL_PERIRESET0_I2C0_Msk (0x1UL << SYSCTRL_PERIRESET0_I2C0_Pos)
#define SYSCTRL_PERIRESET0_I2C0 SYSCTRL_PERIRESET0_I2C0_Msk
#define SYSCTRL_PERIRESET0_I2C1_Pos (5U)
#define SYSCTRL_PERIRESET0_I2C1_Msk (0x1UL << SYSCTRL_PERIRESET0_I2C1_Pos)
#define SYSCTRL_PERIRESET0_I2C1 SYSCTRL_PERIRESET0_I2C1_Msk
#define SYSCTRL_PERIRESET0_SPI0_Pos (6U)
#define SYSCTRL_PERIRESET0_SPI0_Msk (0x1UL << SYSCTRL_PERIRESET0_SPI0_Pos)
#define SYSCTRL_PERIRESET0_SPI0 SYSCTRL_PERIRESET0_SPI0_Msk
#define SYSCTRL_PERIRESET0_SPI1_Pos (7U)
#define SYSCTRL_PERIRESET0_SPI1_Msk (0x1UL << SYSCTRL_PERIRESET0_SPI1_Pos)
#define SYSCTRL_PERIRESET0_SPI1 SYSCTRL_PERIRESET0_SPI1_Msk
#define SYSCTRL_PERIRESET0_ATIM0_Pos (8U)
#define SYSCTRL_PERIRESET0_ATIM0_Msk (0x1UL << SYSCTRL_PERIRESET0_ATIM0_Pos)
#define SYSCTRL_PERIRESET0_ATIM0 SYSCTRL_PERIRESET0_ATIM0_Msk
#define SYSCTRL_PERIRESET0_LPTIM_Pos (9U)
#define SYSCTRL_PERIRESET0_LPTIM_Msk (0x1UL << SYSCTRL_PERIRESET0_LPTIM_Pos)
#define SYSCTRL_PERIRESET0_LPTIM SYSCTRL_PERIRESET0_LPTIM_Msk
#define SYSCTRL_PERIRESET0_ATIM1_Pos (10U)
#define SYSCTRL_PERIRESET0_ATIM1_Msk (0x1UL << SYSCTRL_PERIRESET0_ATIM1_Pos)
#define SYSCTRL_PERIRESET0_ATIM1 SYSCTRL_PERIRESET0_ATIM1_Msk
#define SYSCTRL_PERIRESET0_ATIM3_Pos (11U)
#define SYSCTRL_PERIRESET0_ATIM3_Msk (0x1UL << SYSCTRL_PERIRESET0_ATIM3_Pos)
#define SYSCTRL_PERIRESET0_ATIM3 SYSCTRL_PERIRESET0_ATIM3_Msk
#define SYSCTRL_PERIRESET0_ATIM2_Pos (12U)
#define SYSCTRL_PERIRESET0_ATIM2_Msk (0x1UL << SYSCTRL_PERIRESET0_ATIM2_Pos)
#define SYSCTRL_PERIRESET0_ATIM2 SYSCTRL_PERIRESET0_ATIM2_Msk
#define SYSCTRL_PERIRESET0_OPA_Pos (13U)
#define SYSCTRL_PERIRESET0_OPA_Msk (0x1UL << SYSCTRL_PERIRESET0_OPA_Pos)
#define SYSCTRL_PERIRESET0_OPA SYSCTRL_PERIRESET0_OPA_Msk
#define SYSCTRL_PERIRESET0_WWDT_Pos (14U)
#define SYSCTRL_PERIRESET0_WWDT_Msk (0x1UL << SYSCTRL_PERIRESET0_WWDT_Pos)
#define SYSCTRL_PERIRESET0_WWDT SYSCTRL_PERIRESET0_WWDT_Msk
#define SYSCTRL_PERIRESET0_IWDT_Pos (15U)
#define SYSCTRL_PERIRESET0_IWDT_Msk (0x1UL << SYSCTRL_PERIRESET0_IWDT_Pos)
#define SYSCTRL_PERIRESET0_IWDT SYSCTRL_PERIRESET0_IWDT_Msk
#define SYSCTRL_PERIRESET0_ADC_Pos (16U)
#define SYSCTRL_PERIRESET0_ADC_Msk (0x1UL << SYSCTRL_PERIRESET0_ADC_Pos)
#define SYSCTRL_PERIRESET0_ADC SYSCTRL_PERIRESET0_ADC_Msk
#define SYSCTRL_PERIRESET0_VCLVD_Pos (17U)
#define SYSCTRL_PERIRESET0_VCLVD_Msk (0x1UL << SYSCTRL_PERIRESET0_VCLVD_Pos)
#define SYSCTRL_PERIRESET0_VCLVD SYSCTRL_PERIRESET0_VCLVD_Msk
#define SYSCTRL_PERIRESET0_I2CSLV_Pos (18U)
#define SYSCTRL_PERIRESET0_I2CSLV_Msk (0x1UL << SYSCTRL_PERIRESET0_I2CSLV_Pos)
#define SYSCTRL_PERIRESET0_I2CSLV SYSCTRL_PERIRESET0_I2CSLV_Msk
#define SYSCTRL_PERIRESET0_RTC_Pos (20U)
#define SYSCTRL_PERIRESET0_RTC_Msk (0x1UL << SYSCTRL_PERIRESET0_RTC_Pos)
#define SYSCTRL_PERIRESET0_RTC SYSCTRL_PERIRESET0_RTC_Msk
#define SYSCTRL_PERIRESET0_CTRIM_Pos (21U)
#define SYSCTRL_PERIRESET0_CTRIM_Msk (0x1UL << SYSCTRL_PERIRESET0_CTRIM_Pos)
#define SYSCTRL_PERIRESET0_CTRIM SYSCTRL_PERIRESET0_CTRIM_Msk
#define SYSCTRL_PERIRESET0_TICK_Pos (24U)
#define SYSCTRL_PERIRESET0_TICK_Msk (0x1UL << SYSCTRL_PERIRESET0_TICK_Pos)
#define SYSCTRL_PERIRESET0_TICK SYSCTRL_PERIRESET0_TICK_Msk
#define SYSCTRL_PERIRESET0_SWD_Pos (25U)
#define SYSCTRL_PERIRESET0_SWD_Msk (0x1UL << SYSCTRL_PERIRESET0_SWD_Pos)
#define SYSCTRL_PERIRESET0_SWD SYSCTRL_PERIRESET0_SWD_Msk
#define SYSCTRL_PERIRESET0_CRC_Pos (26U)
#define SYSCTRL_PERIRESET0_CRC_Msk (0x1UL << SYSCTRL_PERIRESET0_CRC_Pos)
#define SYSCTRL_PERIRESET0_CRC SYSCTRL_PERIRESET0_CRC_Msk
#define SYSCTRL_PERIRESET0_DMA_Pos (29U)
#define SYSCTRL_PERIRESET0_DMA_Msk (0x1UL << SYSCTRL_PERIRESET0_DMA_Pos)
#define SYSCTRL_PERIRESET0_DMA SYSCTRL_PERIRESET0_DMA_Msk
#define SYSCTRL_PERIRESET0_EAU_Pos (30U)
#define SYSCTRL_PERIRESET0_EAU_Msk (0x1UL << SYSCTRL_PERIRESET0_EAU_Pos)
#define SYSCTRL_PERIRESET0_EAU SYSCTRL_PERIRESET0_EAU_Msk

// SYSCTRL_PERIRESET1
#define SYSCTRL_PERIRESET1_GPIOA_Pos (0U)
#define SYSCTRL_PERIRESET1_GPIOA_Msk (0x1UL << SYSCTRL_PERIRESET1_GPIOA_Pos)
#define SYSCTRL_PERIRESET1_GPIOA SYSCTRL_PERIRESET1_GPIOA_Msk
#define SYSCTRL_PERIRESET1_GPIOB_Pos (1U)
#define SYSCTRL_PERIRESET1_GPIOB_Msk (0x1UL << SYSCTRL_PERIRESET1_GPIOB_Pos)
#define SYSCTRL_PERIRESET1_GPIOB SYSCTRL_PERIRESET1_GPIOB_Msk
#define SYSCTRL_PERIRESET1_GPIOC_Pos (2U)
#define SYSCTRL_PERIRESET1_GPIOC_Msk (0x1UL << SYSCTRL_PERIRESET1_GPIOC_Pos)
#define SYSCTRL_PERIRESET1_GPIOC SYSCTRL_PERIRESET1_GPIOC_Msk
#define SYSCTRL_PERIRESET1_GPIOD_Pos (3U)
#define SYSCTRL_PERIRESET1_GPIOD_Msk (0x1UL << SYSCTRL_PERIRESET1_GPIOD_Pos)
#define SYSCTRL_PERIRESET1_GPIOD SYSCTRL_PERIRESET1_GPIOD_Msk
#define SYSCTRL_PERIRESET1_CAN_Pos (7U)
#define SYSCTRL_PERIRESET1_CAN_Msk (0x1UL << SYSCTRL_PERIRESET1_CAN_Pos)
#define SYSCTRL_PERIRESET1_CAN SYSCTRL_PERIRESET1_CAN_Msk
#define SYSCTRL_PERIRESET1_GTIM0_Pos (8U)
#define SYSCTRL_PERIRESET1_GTIM0_Msk (0x1UL << SYSCTRL_PERIRESET1_GTIM0_Pos)
#define SYSCTRL_PERIRESET1_GTIM0 SYSCTRL_PERIRESET1_GTIM0_Msk
#define SYSCTRL_PERIRESET1_GTIM1_Pos (9U)
#define SYSCTRL_PERIRESET1_GTIM1_Msk (0x1UL << SYSCTRL_PERIRESET1_GTIM1_Pos)
#define SYSCTRL_PERIRESET1_GTIM1 SYSCTRL_PERIRESET1_GTIM1_Msk

// SYSCTRL_RSTFLAG
#define SYSCTRL_RSTFLAG_POR5V_Pos (0U)
#define SYSCTRL_RSTFLAG_POR5V_Msk (0x1UL << SYSCTRL_RSTFLAG_POR5V_Pos)
#define SYSCTRL_RSTFLAG_POR5V SYSCTRL_RSTFLAG_POR5V_Msk
#define SYSCTRL_RSTFLAG_POR12V_Pos (1U)
#define SYSCTRL_RSTFLAG_POR12V_Msk (0x1UL << SYSCTRL_RSTFLAG_POR12V_Pos)
#define SYSCTRL_RSTFLAG_POR12V SYSCTRL_RSTFLAG_POR12V_Msk
#define SYSCTRL_RSTFLAG_LVD_Pos (2U)
#define SYSCTRL_RSTFLAG_LVD_Msk (0x1UL << SYSCTRL_RSTFLAG_LVD_Pos)
#define SYSCTRL_RSTFLAG_LVD SYSCTRL_RSTFLAG_LVD_Msk
#define SYSCTRL_RSTFLAG_IWDT_Pos (3U)
#define SYSCTRL_RSTFLAG_IWDT_Msk (0x1UL << SYSCTRL_RSTFLAG_IWDT_Pos)
#define SYSCTRL_RSTFLAG_IWDT SYSCTRL_RSTFLAG_IWDT_Msk
#define SYSCTRL_RSTFLAG_WWDT_Pos (4U)
#define SYSCTRL_RSTFLAG_WWDT_Msk (0x1UL << SYSCTRL_RSTFLAG_WWDT_Pos)
#define SYSCTRL_RSTFLAG_WWDT SYSCTRL_RSTFLAG_WWDT_Msk
#define SYSCTRL_RSTFLAG_LOCKUP_Pos (5U)
#define SYSCTRL_RSTFLAG_LOCKUP_Msk (0x1UL << SYSCTRL_RSTFLAG_LOCKUP_Pos)
#define SYSCTRL_RSTFLAG_LOCKUP SYSCTRL_RSTFLAG_LOCKUP_Msk
#define SYSCTRL_RSTFLAG_SYSREQ_Pos (6U)
#define SYSCTRL_RSTFLAG_SYSREQ_Msk (0x1UL << SYSCTRL_RSTFLAG_SYSREQ_Pos)
#define SYSCTRL_RSTFLAG_SYSREQ SYSCTRL_RSTFLAG_SYSREQ_Msk
#define SYSCTRL_RSTFLAG_RSTB_Pos (7U)
#define SYSCTRL_RSTFLAG_RSTB_Msk (0x1UL << SYSCTRL_RSTFLAG_RSTB_Pos)
#define SYSCTRL_RSTFLAG_RSTB SYSCTRL_RSTFLAG_RSTB_Msk

