sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// SYSCTRL_DBGSTOP
#define SYSCTRL_DBGSTOP_ATIM0_Pos (0U)
#define SYSCTRL_DBGSTOP_ATIM0_Msk (0x1UL << SYSCTRL_DBGSTOP_ATIM0_Pos)
#define SYSCTRL_DBGSTOP_ATIM0 SYSCTRL_DBGSTOP_ATIM0_Msk
#define SYSCTRL_DBGSTOP_ATIM1_Pos (1U)
#define SYSCTRL_DBGSTOP_ATIM1_Msk (0x1UL << SYSCTRL_DBGSTOP_ATIM1_Pos)
#define SYSCTRL_DBGSTOP_ATIM1 SYSCTRL_DBGSTOP_ATIM1_Msk
#define SYSCTRL_DBGSTOP_ATIM2_Pos (2U)
#define SYSCTRL_DBGSTOP_ATIM2_Msk (0x1UL << SYSCTRL_DBGSTOP_ATIM2_Pos)
#define SYSCTRL_DBGSTOP_ATIM2 SYSCTRL_DBGSTOP_ATIM2_Msk
#define SYSCTRL_DBGSTOP_LPTIM_Pos (3U)
#define SYSCTRL_DBGSTOP_LPTIM_Msk (0x1UL << SYSCTRL_DBGSTOP_LPTIM_Pos)
#define SYSCTRL_DBGSTOP_LPTIM SYSCTRL_DBGSTOP_LPTIM_Msk
#define SYSCTRL_DBGSTOP_GTIM0_Pos (4U)
#define SYSCTRL_DBGSTOP_GTIM0_Msk (0x1UL << SYSCTRL_DBGSTOP_GTIM0_Pos)
#define SYSCTRL_DBGSTOP_GTIM0 SYSCTRL_DBGSTOP_GTIM0_Msk
#define SYSCTRL_DBGSTOP_GTIM1_Pos (5U)
#define SYSCTRL_DBGSTOP_GTIM1_Msk (0x1UL << SYSCTRL_DBGSTOP_GTIM1_Pos)
#define SYSCTRL_DBGSTOP_GTIM1 SYSCTRL_DBGSTOP_GTIM1_Msk
#define SYSCTRL_DBGSTOP_CTRIM_Pos (7U)
#define SYSCTRL_DBGSTOP_CTRIM_Msk (0x1UL << SYSCTRL_DBGSTOP_CTRIM_Pos)
#define SYSCTRL_DBGSTOP_CTRIM SYSCTRL_DBGSTOP_CTRIM_Msk
#define SYSCTRL_DBGSTOP_IWDT_Pos (8U)
#define SYSCTRL_DBGSTOP_IWDT_Msk (0x1UL << SYSCTRL_DBGSTOP_IWDT_Pos)
#define SYSCTRL_DBGSTOP_IWDT SYSCTRL_DBGSTOP_IWDT_Msk
#define SYSCTRL_DBGSTOP_RTC_Pos (9U)
#define SYSCTRL_DBGSTOP_RTC_Msk (0x1UL << SYSCTRL_DBGSTOP_RTC_Pos)
#define SYSCTRL_DBGSTOP_RTC SYSCTRL_DBGSTOP_RTC_Msk
#define SYSCTRL_DBGSTOP_TICK_Pos (10U)
#define SYSCTRL_DBGSTOP_TICK_Msk (0x1UL << SYSCTRL_DBGSTOP_TICK_Pos)
#define SYSCTRL_DBGSTOP_TICK SYSCTRL_DBGSTOP_TICK_Msk
#define SYSCTRL_DBGSTOP_ATIM3_Pos (11U)
#define SYSCTRL_DBGSTOP_ATIM3_Msk (0x1UL << SYSCTRL_DBGSTOP_ATIM3_Pos)
#define SYSCTRL_DBGSTOP_ATIM3 SYSCTRL_DBGSTOP_ATIM3_Msk
#define SYSCTRL_DBGSTOP_WWDT_Pos (12U)
#define SYSCTRL_DBGSTOP_WWDT_Msk (0x1UL << SYSCTRL_DBGSTOP_WWDT_Pos)
#define SYSCTRL_DBGSTOP_WWDT SYSCTRL_DBGSTOP_WWDT_Msk

//********************    Bits Define For Peripheral USART    ********************//
// USART_CR1
#define USART_CR1_RE_Pos (0U)
#define USART_CR1_RE_Msk (0x1UL << USART_CR1_RE_Pos)
#define USART_CR1_RE USART_CR1_RE_Msk
#define USART_CR1_TE_Pos (1U)
#define USART_CR1_TE_Msk (0x1UL << USART_CR1_TE_Pos)
#define USART_CR1_TE USART_CR1_TE_Msk
#define USART_CR1_PS_Pos (2U)
#define USART_CR1_PS_Msk (0x1UL << USART_CR1_PS_Pos)
#define USART_CR1_PS USART_CR1_PS_Msk
#define USART_CR1_PCE_Pos (3U)
#define USART_CR1_PCE_Msk (0x1UL << USART_CR1_PCE_Pos)
#define USART_CR1_PCE USART_CR1_PCE_Msk
#define USART_CR1_CHLEN_Pos (4U)
#define USART_CR1_CHLEN_Msk (0x1UL << USART_CR1_CHLEN_Pos)
#define USART_CR1_CHLEN USART_CR1_CHLEN_Msk
#define USART_CR1_STOP_Pos (5U)
#define USART_CR1_STOP_Msk (0x1UL << USART_CR1_STOP_Pos)
#define USART_CR1_STOP USART_CR1_STOP_Msk
#define USART_CR1_MSB_Pos (6U)
#define USART_CR1_MSB_Msk (0x1UL << USART_CR1_MSB_Pos)
#define USART_CR1_MSB USART_CR1_MSB_Msk
#define USART_CR1_OVER8_Pos (7U)
#define USART_CR1_OVER8_Msk (0x1UL << USART_CR1_OVER8_Pos)
#define USART_CR1_OVER8 USART_CR1_OVER8_Msk
#define USART_CR1_TOE_Pos (8U)
#define USART_CR1_TOE_Msk (0x7UL << USART_CR1_TOE_Pos)
#define USART_CR1_TOE USART_CR1_TOE_Msk
#define USART_CR1_SBS_Pos (11U)
#define USART_CR1_SBS_Msk (0x1UL << USART_CR1_SBS_Pos)
#define USART_CR1_SBS USART_CR1_SBS_Msk
#define USART_CR1_COMB_Pos (12U)
#define USART_CR1_COMB_Msk (0x1UL << USART_CR1_COMB_Pos)
#define USART_CR1_COMB USART_CR1_COMB_Msk
#define USART_CR1_MPE_Pos (13U)
#define USART_CR1_MPE_Msk (0x1UL << USART_CR1_MPE_Pos)
#define USART_CR1_MPE USART_CR1_MPE_Msk
#define USART_CR1_SLME_Pos (14U)
#define USART_CR1_SLME_Msk (0x1UL << USART_CR1_SLME_Pos)
#define USART_CR1_SLME USART_CR1_SLME_Msk

// USART_CR2
#define USART_CR2_RXDMAEN_Pos (0U)
#define USART_CR2_RXDMAEN_Msk (0x1UL << USART_CR2_RXDMAEN_Pos)
#define USART_CR2_RXDMAEN USART_CR2_RXDMAEN_Msk
#define USART_CR2_TXDMAEN_Pos (1U)
#define USART_CR2_TXDMAEN_Msk (0x1UL << USART_CR2_TXDMAEN_Pos)
#define USART_CR2_TXDMAEN USART_CR2_TXDMAEN_Msk
#define USART_CR2_RTSEN_Pos (2U)
#define USART_CR2_RTSEN_Msk (0x1UL << USART_CR2_RTSEN_Pos)
#define USART_CR2_RTSEN USART_CR2_RTSEN_Msk
#define USART_CR2_CTSEN_Pos (3U)
#define USART_CR2_CTSEN_Msk (0x1UL << USART_CR2_CTSEN_Pos)
#define USART_CR2_CTSEN USART_CR2_CTSEN_Msk
#define USART_CR2_RXINV_Pos (4U)
#define USART_CR2_RXINV_Msk (0x1UL << USART_CR2_RXINV_Pos)
#define USART_CR2_RXINV USART_CR2_RXINV_Msk
#define USART_CR2_TXINV_Pos (5U)
#define USART_CR2_TXINV_Msk (0x1UL << USART_CR2_TXINV_Pos)
#define USART_CR2_TXINV USART_CR2_TXINV_Msk
#define USART_CR2_SYNC_Pos (6U)
#define USART_CR2_SYNC_Msk (0x1UL << USART_CR2_SYNC_Pos)
#define USART_CR2_SYNC USART_CR2_SYNC_Msk
#define USART_CR2_SWAP_Pos (7U)
#define USART_CR2_SWAP_Msk (0x1UL << USART_CR2_SWAP_Pos)
#define USART_CR2_SWAP USART_CR2_SWAP_Msk
#define USART_CR2_CLKC_Pos (8U)
#define USART_CR2_CLKC_Msk (0x3UL << USART_CR2_CLKC_Pos)
#define USART_CR2_CLKC USART_CR2_CLKC_Msk

// USART_CR3
#define USART_CR3_LINEN_Pos (0U)
#define USART_CR3_LINEN_Msk (0x1UL << USART_CR3_LINEN_Pos)
#define USART_CR3_LINEN USART_CR3_LINEN_Msk
#define USART_CR3_LBDE_Pos (1U)
#define USART_CR3_LBDE_Msk (0x1UL << USART_CR3_LBDE_Pos)
#define USART_CR3_LBDE USART_CR3_LBDE_Msk
#define USART_CR3_ABRE_Pos (2U)
#define USART_CR3_ABRE_Msk (0x1UL << USART_CR3_ABRE_Pos)
#define USART_CR3_ABRE USART_CR3_ABRE_Msk
#define USART_CR3_BREAK_Pos (3U)
#define USART_CR3_BREAK_Msk (0x1UL << USART_CR3_BREAK_Pos)
#define USART_CR3_BREAK USART_CR3_BREAK_Msk
#define USART_CR3_SCEN_Pos (4U)
#define USART_CR3_SCEN_Msk (0x1UL << USART_CR3_SCEN_Pos)
#define USART_CR3_SCEN USART_CR3_SCEN_Msk
#define USART_CR3_BCN_Pos (5U)
#define USART_CR3_BCN_Msk (0x7UL << USART_CR3_BCN_Pos)
#define USART_CR3_BCN USART_CR3_BCN_Msk
#define USART_CR3_SMCPU_Pos (8U)
#define USART_CR3_SMCPU_Msk (0x3UL << USART_CR3_SMCPU_Pos)
#define USART_CR3_SMCPU USART_CR3_SMCPU_Msk
#define USART_CR3_IREN_Pos (13U)
#define USART_CR3_IREN_Msk (0x1UL << USART_CR3_IREN_Pos)
#define USART_CR3_IREN USART_CR3_IREN_Msk
#define USART_CR3_IRCW_Pos (14U)
#define USART_CR3_IRCW_Msk (0x1UL << USART_CR3_IRCW_Pos)
#define USART_CR3_IRCW USART_CR3_IRCW_Msk
#define USART_CR3_IRMOD_Pos (15U)
#define USART_CR3_IRMOD_Msk (0x1UL << USART_CR3_IRMOD_Pos)
#define USART_CR3_IRMOD USART_CR3_IRMOD_Msk

// USART_BRR
#define USART_BRR_DIVF_Pos (0U)
#define USART_BRR_DIVF_Msk (0x7FUL << USART_BRR_DIVF_Pos)
#define USART_BRR_DIVF USART_BRR_DIVF_Msk
#define USART_BRR_FBME_Pos (7U)
#define USART_BRR_FBME_Msk (0x1UL << USART_BRR_FBME_Pos)
#define USART_BRR_FBME USART_BRR_FBME_Msk
#define USART_BRR_DIVI_Pos (8U)
#define USART_BRR_DIVI_Msk (0xFFUL << USART_BRR_DIVI_Pos)
#define USART_BRR_DIVI USART_BRR_DIVI_Msk
#define USART_BRR_PSC_Pos (16U)
#define USART_BRR_PSC_Msk (0x3UL << USART_BRR_PSC_Pos)
#define USART_BRR_PSC USART_BRR_PSC_Msk

// USART_TOR
#define USART_TOR_TOR_Pos (0U)
#define USART_TOR_TOR_Msk (0xFFFFFUL << USART_TOR_TOR_Pos)
#define USART_TOR_TOR USART_TOR_TOR_Msk

// USART_SR
#define USART_SR_TXE_Pos (0U)
#define USART_SR_TXE_Msk (0x1UL << USART_SR_TXE_Pos)
#define USART_SR_TXE USART_SR_TXE_Msk
#define USART_SR_TC_Pos (1U)
#define USART_SR_TC_Msk (0x1UL << USART_SR_TC_Pos)
#define USART_SR_TC USART_SR_TC_Msk
#define USART_SR_RC_Pos (2U)
#define USART_SR_RC_Msk (0x1UL << USART_SR_RC_Pos)
#define USART_SR_RC USART_SR_RC_Msk
#define USART_SR_PE_Pos (3U)
#define USART_SR_PE_Msk (0x1UL << USART_SR_PE_Pos)
#define USART_SR_PE USART_SR_PE_Msk
#define USART_SR_FE_Pos (4U)
#define USART_SR_FE_Msk (0x1UL << USART_SR_FE_Pos)
#define USART_SR_FE USART_SR_FE_Msk
#define USART_SR_OR_Pos (5U)
#define USART_SR_OR_Msk (0x1UL << USART_SR_OR_Pos)
#define USART_SR_OR USART_SR_OR_Msk
#define USART_SR_TO_Pos (6U)
#define USART_SR_TO_Msk (0x1UL << USART_SR_TO_Pos)
#define USART_SR_TO USART_SR_TO_Msk
#define USART_SR_MPB_Pos (8U)
#define USART_SR_MPB_Msk (0x1UL << USART_SR_MPB_Pos)
#define USART_SR_MPB USART_SR_MPB_Msk
#define USART_SR_AM_Pos (9U)
#define USART_SR_AM_Msk (0x1UL << USART_SR_AM_Pos)
#define USART_SR_AM USART_SR_AM_Msk
#define USART_SR_CTSV_Pos (10U)
#define USART_SR_CTSV_Msk (0x1UL << USART_SR_CTSV_Pos)
#define USART_SR_CTSV USART_SR_CTSV_Msk
#define USART_SR_CTS_Pos (11U)
#define USART_SR_CTS_Msk (0x1UL << USART_SR_CTS_Pos)
#define USART_SR_CTS USART_SR_CTS_Msk
#define USART_SR_ABR_Pos (12U)
#define USART_SR_ABR_Msk (0x1UL << USART_SR_ABR_Pos)
#define USART_SR_ABR USART_SR_ABR_Msk
#define USART_SR_LBD_Pos (13U)
#define USART_SR_LBD_Msk (0x1UL << USART_SR_LBD_Pos)
#define USART_SR_LBD USART_SR_LBD_Msk
#define USART_SR_DWK_Pos (14U)
#define USART_SR_DWK_Msk (0x1UL << USART_SR_DWK_Pos)
#define USART_SR_DWK USART_SR_DWK_Msk

