sullivan986/HC32_SDK/hal/hc32a052/inc/hc32a052.h
// USART_TDR
#define USART_TDR_TDR_Pos (0U)
#define USART_TDR_TDR_Msk (0x1FFUL << USART_TDR_TDR_Pos)
#define USART_TDR_TDR USART_TDR_TDR_Msk
#define USART_TDR_MPID_Pos (9U)
#define USART_TDR_MPID_Msk (0x1UL << USART_TDR_MPID_Pos)
#define USART_TDR_MPID USART_TDR_MPID_Msk

// USART_IER
#define USART_IER_TXE_Pos (0U)
#define USART_IER_TXE_Msk (0x1UL << USART_IER_TXE_Pos)
#define USART_IER_TXE USART_IER_TXE_Msk
#define USART_IER_TC_Pos (1U)
#define USART_IER_TC_Msk (0x1UL << USART_IER_TC_Pos)
#define USART_IER_TC USART_IER_TC_Msk
#define USART_IER_RC_Pos (2U)
#define USART_IER_RC_Msk (0x1UL << USART_IER_RC_Pos)
#define USART_IER_RC USART_IER_RC_Msk
#define USART_IER_PE_Pos (3U)
#define USART_IER_PE_Msk (0x1UL << USART_IER_PE_Pos)
#define USART_IER_PE USART_IER_PE_Msk
#define USART_IER_FE_Pos (4U)
#define USART_IER_FE_Msk (0x1UL << USART_IER_FE_Pos)
#define USART_IER_FE USART_IER_FE_Msk
#define USART_IER_OR_Pos (5U)
#define USART_IER_OR_Msk (0x1UL << USART_IER_OR_Pos)
#define USART_IER_OR USART_IER_OR_Msk
#define USART_IER_TO_Pos (6U)
#define USART_IER_TO_Msk (0x1UL << USART_IER_TO_Pos)
#define USART_IER_TO USART_IER_TO_Msk
#define USART_IER_AM_Pos (9U)
#define USART_IER_AM_Msk (0x1UL << USART_IER_AM_Pos)
#define USART_IER_AM USART_IER_AM_Msk
#define USART_IER_CTS_Pos (11U)
#define USART_IER_CTS_Msk (0x1UL << USART_IER_CTS_Pos)
#define USART_IER_CTS USART_IER_CTS_Msk
#define USART_IER_ABR_Pos (12U)
#define USART_IER_ABR_Msk (0x1UL << USART_IER_ABR_Pos)
#define USART_IER_ABR USART_IER_ABR_Msk
#define USART_IER_LBD_Pos (13U)
#define USART_IER_LBD_Msk (0x1UL << USART_IER_LBD_Pos)
#define USART_IER_LBD USART_IER_LBD_Msk
#define USART_IER_DWK_Pos (14U)
#define USART_IER_DWK_Msk (0x1UL << USART_IER_DWK_Pos)
#define USART_IER_DWK USART_IER_DWK_Msk

// USART_ICR
#define USART_ICR_TC_Pos (1U)
#define USART_ICR_TC_Msk (0x1UL << USART_ICR_TC_Pos)
#define USART_ICR_TC USART_ICR_TC_Msk
#define USART_ICR_RC_Pos (2U)
#define USART_ICR_RC_Msk (0x1UL << USART_ICR_RC_Pos)
#define USART_ICR_RC USART_ICR_RC_Msk
#define USART_ICR_PE_Pos (3U)
#define USART_ICR_PE_Msk (0x1UL << USART_ICR_PE_Pos)
#define USART_ICR_PE USART_ICR_PE_Msk
#define USART_ICR_FE_Pos (4U)
#define USART_ICR_FE_Msk (0x1UL << USART_ICR_FE_Pos)
#define USART_ICR_FE USART_ICR_FE_Msk
#define USART_ICR_OR_Pos (5U)
#define USART_ICR_OR_Msk (0x1UL << USART_ICR_OR_Pos)
#define USART_ICR_OR USART_ICR_OR_Msk
#define USART_ICR_TO_Pos (6U)
#define USART_ICR_TO_Msk (0x1UL << USART_ICR_TO_Pos)
#define USART_ICR_TO USART_ICR_TO_Msk
#define USART_ICR_AM_Pos (9U)
#define USART_ICR_AM_Msk (0x1UL << USART_ICR_AM_Pos)
#define USART_ICR_AM USART_ICR_AM_Msk
#define USART_ICR_CTS_Pos (11U)
#define USART_ICR_CTS_Msk (0x1UL << USART_ICR_CTS_Pos)
#define USART_ICR_CTS USART_ICR_CTS_Msk
#define USART_ICR_ABR_Pos (12U)
#define USART_ICR_ABR_Msk (0x1UL << USART_ICR_ABR_Pos)
#define USART_ICR_ABR USART_ICR_ABR_Msk
#define USART_ICR_LBD_Pos (13U)
#define USART_ICR_LBD_Msk (0x1UL << USART_ICR_LBD_Pos)
#define USART_ICR_LBD USART_ICR_LBD_Msk
#define USART_ICR_DWK_Pos (14U)
#define USART_ICR_DWK_Msk (0x1UL << USART_ICR_DWK_Pos)
#define USART_ICR_DWK USART_ICR_DWK_Msk

// USART_RDR
#define USART_RDR_RDR_Pos (0U)
#define USART_RDR_RDR_Msk (0x1FFUL << USART_RDR_RDR_Pos)
#define USART_RDR_RDR USART_RDR_RDR_Msk

// USART_ADDR
#define USART_ADDR_ADDR_Pos (0U)
#define USART_ADDR_ADDR_Msk (0xFFUL << USART_ADDR_ADDR_Pos)
#define USART_ADDR_ADDR USART_ADDR_ADDR_Msk

// USART_ADDMR
#define USART_ADDMR_ADDM_Pos (0U)
#define USART_ADDMR_ADDM_Msk (0xFFUL << USART_ADDMR_ADDM_Pos)
#define USART_ADDMR_ADDM USART_ADDMR_ADDM_Msk

// USART_BDR
#define USART_BDR_BDR_Pos (0U)
#define USART_BDR_BDR_Msk (0xFFFUL << USART_BDR_BDR_Pos)
#define USART_BDR_BDR USART_BDR_BDR_Msk

// USART_IR
#define USART_IR_DCNTL_Pos (0U)
#define USART_IR_DCNTL_Msk (0x7FFUL << USART_IR_DCNTL_Pos)
#define USART_IR_DCNTL USART_IR_DCNTL_Msk
#define USART_IR_DCNTH_Pos (16U)
#define USART_IR_DCNTH_Msk (0x7FFUL << USART_IR_DCNTH_Pos)
#define USART_IR_DCNTH USART_IR_DCNTH_Msk

//********************    Bits Define For Peripheral VC    ********************//
// VC_CR0
#define VC_CR0_DIV_Pos (0U)
#define VC_CR0_DIV_Msk (0x3FUL << VC_CR0_DIV_Pos)
#define VC_CR0_DIV VC_CR0_DIV_Msk
#define VC_CR0_DIVEN_Pos (6U)
#define VC_CR0_DIVEN_Msk (0x1UL << VC_CR0_DIVEN_Pos)
#define VC_CR0_DIVEN VC_CR0_DIVEN_Msk
#define VC_CR0_REF_Pos (7U)
#define VC_CR0_REF_Msk (0x1UL << VC_CR0_REF_Pos)
#define VC_CR0_REF VC_CR0_REF_Msk
#define VC_CR0_BIAS_Pos (8U)
#define VC_CR0_BIAS_Msk (0x3UL << VC_CR0_BIAS_Pos)
#define VC_CR0_BIAS VC_CR0_BIAS_Msk
#define VC_CR0_HYS_Pos (10U)
#define VC_CR0_HYS_Msk (0x3UL << VC_CR0_HYS_Pos)
#define VC_CR0_HYS VC_CR0_HYS_Msk

// VC_CR1
#define VC_CR1_PSEL_Pos (0U)
#define VC_CR1_PSEL_Msk (0xFUL << VC_CR1_PSEL_Pos)
#define VC_CR1_PSEL VC_CR1_PSEL_Msk
#define VC_CR1_NSEL_Pos (4U)
#define VC_CR1_NSEL_Msk (0xFUL << VC_CR1_NSEL_Pos)
#define VC_CR1_NSEL VC_CR1_NSEL_Msk
#define VC_CR1_FLTEN_Pos (8U)
#define VC_CR1_FLTEN_Msk (0x1UL << VC_CR1_FLTEN_Pos)
#define VC_CR1_FLTEN VC_CR1_FLTEN_Msk
#define VC_CR1_FLTTIME_Pos (9U)
#define VC_CR1_FLTTIME_Msk (0x7UL << VC_CR1_FLTTIME_Pos)
#define VC_CR1_FLTTIME VC_CR1_FLTTIME_Msk
#define VC_CR1_FALLING_Pos (12U)
#define VC_CR1_FALLING_Msk (0x1UL << VC_CR1_FALLING_Pos)
#define VC_CR1_FALLING VC_CR1_FALLING_Msk
#define VC_CR1_RISING_Pos (13U)
#define VC_CR1_RISING_Msk (0x1UL << VC_CR1_RISING_Pos)
#define VC_CR1_RISING VC_CR1_RISING_Msk
#define VC_CR1_LEVEL_Pos (14U)
#define VC_CR1_LEVEL_Msk (0x1UL << VC_CR1_LEVEL_Pos)
#define VC_CR1_LEVEL VC_CR1_LEVEL_Msk
#define VC_CR1_IE_Pos (15U)
#define VC_CR1_IE_Msk (0x1UL << VC_CR1_IE_Pos)
#define VC_CR1_IE VC_CR1_IE_Msk
#define VC_CR1_EN_Pos (16U)
#define VC_CR1_EN_Msk (0x1UL << VC_CR1_EN_Pos)
#define VC_CR1_EN VC_CR1_EN_Msk
#define VC_CR1_FLTCLK_Pos (17U)
#define VC_CR1_FLTCLK_Msk (0x1UL << VC_CR1_FLTCLK_Pos)
#define VC_CR1_FLTCLK VC_CR1_FLTCLK_Msk

// VC_CR2
#define VC_CR2_POL_Pos (0U)
#define VC_CR2_POL_Msk (0x1UL << VC_CR2_POL_Pos)
#define VC_CR2_POL VC_CR2_POL_Msk
#define VC_CR2_ATIM0CLR_Pos (1U)
#define VC_CR2_ATIM0CLR_Msk (0x1UL << VC_CR2_ATIM0CLR_Pos)
#define VC_CR2_ATIM0CLR VC_CR2_ATIM0CLR_Msk
#define VC_CR2_ATIM1CLR_Pos (2U)
#define VC_CR2_ATIM1CLR_Msk (0x1UL << VC_CR2_ATIM1CLR_Pos)
#define VC_CR2_ATIM1CLR VC_CR2_ATIM1CLR_Msk
#define VC_CR2_ATIM2CLR_Pos (3U)
#define VC_CR2_ATIM2CLR_Msk (0x1UL << VC_CR2_ATIM2CLR_Pos)
#define VC_CR2_ATIM2CLR VC_CR2_ATIM2CLR_Msk
#define VC_CR2_ATIM3CLR_Pos (4U)
#define VC_CR2_ATIM3CLR_Msk (0x1UL << VC_CR2_ATIM3CLR_Pos)
#define VC_CR2_ATIM3CLR VC_CR2_ATIM3CLR_Msk
#define VC_CR2_ATIMBK_Pos (5U)
#define VC_CR2_ATIMBK_Msk (0x1UL << VC_CR2_ATIMBK_Pos)
#define VC_CR2_ATIMBK VC_CR2_ATIMBK_Msk
#define VC_CR2_WINDOW_Pos (6U)
#define VC_CR2_WINDOW_Msk (0x1UL << VC_CR2_WINDOW_Pos)
#define VC_CR2_WINDOW VC_CR2_WINDOW_Msk

// VC_SR
#define VC_SR_INTF_Pos (0U)
#define VC_SR_INTF_Msk (0x1UL << VC_SR_INTF_Pos)
#define VC_SR_INTF VC_SR_INTF_Msk
#define VC_SR_FLTV_Pos (1U)
#define VC_SR_FLTV_Msk (0x1UL << VC_SR_FLTV_Pos)
#define VC_SR_FLTV VC_SR_FLTV_Msk

//********************    Bits Define For Peripheral WWDT    ********************//
// WWDT_CR0
#define WWDT_CR0_WCNT_Pos (0U)
#define WWDT_CR0_WCNT_Msk (0x7FUL << WWDT_CR0_WCNT_Pos)
#define WWDT_CR0_WCNT WWDT_CR0_WCNT_Msk
#define WWDT_CR0_EN_Pos (7U)
#define WWDT_CR0_EN_Msk (0x1UL << WWDT_CR0_EN_Pos)
#define WWDT_CR0_EN WWDT_CR0_EN_Msk

// WWDT_CR1
#define WWDT_CR1_WINR_Pos (0U)
#define WWDT_CR1_WINR_Msk (0x7FUL << WWDT_CR1_WINR_Pos)
#define WWDT_CR1_WINR WWDT_CR1_WINR_Msk
#define WWDT_CR1_IE_Pos (9U)
#define WWDT_CR1_IE_Msk (0x1UL << WWDT_CR1_IE_Pos)
#define WWDT_CR1_IE WWDT_CR1_IE_Msk
#define WWDT_CR1_PRS_Pos (11U)
#define WWDT_CR1_PRS_Msk (0x7UL << WWDT_CR1_PRS_Pos)
#define WWDT_CR1_PRS WWDT_CR1_PRS_Msk

// WWDT_SR
#define WWDT_SR_POV_Pos (0U)
#define WWDT_SR_POV_Msk (0x1UL << WWDT_SR_POV_Pos)
#define WWDT_SR_POV WWDT_SR_POV_Msk

#ifdef __cplusplus
}
#endif

#endif /* __HC32A052_H__ */
